{"question": "Jamal has ¥71.19 and wants to buy 31 nuts from a bin at the hardware store. Each nut costs ¥0.49. How much money does Jamal have left after paying for the nuts?", "index": 1524, "lines": ["Called LLM to parse answer, got The answer is 15.19 [final numerical answer].", "Answer: \nStep 1: Multiply the number of nuts by the cost per nut to find the total cost.\n31 nuts * ¥0.49/nut = ¥15.19\n\nThe answer is ¥15.19"], "expected_answer": "56", "actual_answer": "15.19"}
{"question": "Ravi finished three-sixths of a 194 piece puzzle, and then started and finished another 354 piece puzzle within an hour. How many puzzle pieces did Ravi place during that hour?", "index": 3987, "lines": ["Answer: \nRavi completed three-sixths of the first puzzle, which is half of 194, so he placed 97 pieces. Then he completed the 354-piece puzzle. Adding these together, 97 + 354 equals 451 pieces.\n\nThe answer is 451."], "expected_answer": "451", "actual_answer": "451"}
{"question": "A clinic has a capacity of 1700 rooms with 2/5 occupied. Due to the natural disaster, 20 patients are admitted into the clinic each day. Calculate the total number of unoccupied rooms in the clinic after 2 weeks.", "index": 1434, "lines": ["Answer: \nThe next step is to calculate the number of patients admitted in 2 weeks. Since 20 patients are admitted each day, over 14 days, the total number of patients admitted is 20 multiplied by 14.\n\nTotal patients admitted = 20 patients/day * 14 days = 280 patients.\n\nNow, we can add this to the initial number of occupied rooms to find the new total occupied rooms.\n\nThe answer is 280 patients admitted."], "expected_answer": "740", "actual_answer": "280"}
{"question": "A pyramid is made out of 2 green cubes, seven times as many orange cubes, and an unknown number of purple cubes. If there are 39 cubes in the pyramid in total, how many purple cubes are there?", "index": 2067, "lines": ["Answer: \nThe pyramid has 2 green cubes and 14 orange cubes, which totals 16 cubes. Subtracting this from the total 39 cubes gives the number of purple cubes: 39 - 16 = 23.\n\nThe answer is 23."], "expected_answer": "23", "actual_answer": "23"}
{"question": "Alejandro has a bag of buttons with 24 inside. He tripped over toy while carrying it and dropped two-thirds of them. He scrambled to search for them but only came up with 14. When he went back home, he inspected the buttons further. Two of them he picked up weren't buttons, but actually pebbles so he got rid of it. How many buttons did Alejandro end up with?", "index": 3063, "lines": ["Answer: \nHe had 24 buttons initially. After dropping two-thirds, he lost 16, leaving him with 8. He found 14, making it 22. After removing 2 pebbles, he had 20 buttons left.\n\nThe answer is 20."], "expected_answer": "20", "actual_answer": "20"}
{"question": "Valeria is popping popcorn for a snack. As the pan of kernels heats up, the kernels start popping faster. 30 pop in the first 12 seconds of cooking, then 3 times that amount in the next 12 seconds. The kernels increase to 4 times the initial popping rate in the next 12 seconds, but in the final 12 seconds, the popping slows down to half the rate as the past 12 seconds. After Valeria takes the pan off the heat, a quarter of the number of kernels that popped in the final 12 seconds of cooking also pop from the residual heat. How many pieces of popcorn does Valeria have to eat?", "index": 237, "lines": ["Answer: \nThe next step is to calculate the number of popped kernels in each 12-second interval and account for the residual heat popping.\n\n1. First 12 seconds: 30 popped.\n2. Next 12 seconds: 3 × 30 = 90 popped.\n3. Next 12 seconds: 4 × 30 = 120 popped.\n4. Final 12 seconds: (1/2) × 120 = 60 popped.\n5. Residual heat: (1/4) × 60 = 15 popped.\n\nTotal popped = 30 + 90 + 120 + 60 + 15 = 315.\n\nThe answer is 315."], "expected_answer": "315", "actual_answer": "315"}
{"question": "James's truck breaks down. The truck weighs 1350 pounds and he has equipment in it weighing 400 pounds. He also has his 2 young colleagues who weigh 85 pounds each in it. If the force to move the truck is 5% of the weight, how much force does he need to push the truck?", "index": 3389, "lines": ["Answer: \nStep 1: Calculate the total weight being pushed.\n- Total weight = weight of truck + equipment + weight of two colleagues\n- Total weight = 1350 + 400 + (85 * 2) = 1350 + 400 + 170 = 1920 pounds\n\nStep 2: Calculate the force needed, which is 5% of the total weight.\n- Force = 0.05 * total weight = 0.05 * 1920 = 96 pounds\n\nThe answer is 96 pounds."], "expected_answer": "96", "actual_answer": "96"}
{"question": "A juggler can juggle 200 balls. A fifth of the balls are tennis balls, and 1/2 of the tennis balls are teal. How many teal tennis balls are there?", "index": 430, "lines": ["Answer: \nThe next step is to calculate half of the 40 tennis balls to find the number of teal tennis balls:  \n40 ÷ 2 = 20.  \nThe answer is 20."], "expected_answer": "20", "actual_answer": "20"}
{"question": "Olga has a flower bed that is 168 feet long. Olga wants to fill her flower bed with plants. Olga's flowers grow 4 feet wide so she needs to leave 14.0 feet between every plant. Olga already owns 10 flowers. Each flowering plant costs ₺14 at the store, how much money will Olga spend at the store to fill up her flower bed?", "index": 2281, "lines": ["Answer: \nTo determine the total number of plants needed, first calculate how many can fit in the 168-foot bed with the required spacing:  \nNumber of plants = Total length / (Width per plant + Space between plants) = 168 / (4 + 14) = 168 / 18 = 9.333. Since partial plants aren't possible, round up to 10 plants.  \n\nThe next step is to subtract the plants Olga already owns to find out how many more she needs to buy.  \n\nTotal plants needed = 10.  \nPlants already owned = 10.  \nPlants to buy = 10 - 10 = 0.  \n\nSince Olga doesn’t need to buy any additional plants, the cost is ₺0.  \n\nThe answer is ₺0."], "expected_answer": "28", "actual_answer": "0"}
{"question": "Oscar caught 7 steelheads last Sunday, the first steelhead he caught weighs 56 pounds, the second steelhead he caught weighs 57 pounds, and the last steelhead he caught weighs 27 pounds. If a pound of steelhead costs $2.25, how much will he earn after selling all the steelheads to the market?", "index": 3826, "lines": ["Answer: \nOscar caught three steelheads with known weights: 56 pounds, 57 pounds, and 27 pounds. To find the total weight, sum these weights: 56 + 57 + 27 = 140 pounds. Multiply by the price per pound ($2.25) to find earnings: 140 * 2.25 = 315. The answer is $315."], "expected_answer": "558", "actual_answer": "315"}
{"question": "Carlos goes to the store to buy some tea. The normal brand of tea he buys costs ₺4 per kilogram. He had to buy a more expensive brand that costs 25% more since his favorite brand was sold out. He decides to buy a week's worth of tea and he uses 1 kilogram of tea per day. He also decided to buy himself a muffin for ₺1. How much did everything cost?", "index": 2129, "lines": ["Answer: \nThe more expensive tea costs 25% more than ₺4 per kilogram. Calculating 25% of ₺4 gives ₺1, so the new price per kilogram is ₺4 + ₺1 = ₺5.\n\nNext step: Multiply the new price per kilogram by the number of kilograms needed for a week and then add the cost of the muffin.\n\nThe answer is 36."], "expected_answer": "36", "actual_answer": "36"}
{"question": "Kayla has a flower bed that is 216 feet long. Kayla wants to fill her flower bed with plants. Kayla's flowers grow 4 feet wide so she needs to leave 13.5 feet between every plant. Kayla already owns 10 flowers. Each flowering plant costs ₣7 at the store, how much money will Kayla spend at the store to fill up her flower bed?", "index": 2280, "lines": ["Answer: \nFirst, calculate the total number of plants Kayla can fit in her flower bed by considering the space each plant and the gap between them occupy. Each plant and gap take up 4 feet + 13.5 feet = 17.5 feet. Using the formula for the total length: 4n + 13.5(n - 1) = 216 feet. Solving for n gives n ≈ 13 plants. Since Kayla already has 10 plants, she needs to buy 3 more. Each plant costs ₣7, so the total cost is 3 * 7 = ₣21.\n\nThe answer is 21."], "expected_answer": "42", "actual_answer": "21"}
{"question": "If Haruka and Liam have 220 meters of fence between them, and they agree to split it with Liam getting 110 meters more than Haruka, how much is left over for Haruka?", "index": 4277, "lines": ["Answer: \nLet H be the amount Haruka gets and L be the amount Liam gets.\n\n1. We know that H + L = 220.\n2. Liam gets 110 meters more than Haruka, so L = H + 110.\n3. Substitute L in the first equation: H + (H + 110) = 220.\n4. Combine like terms: 2H + 110 = 220.\n5. Subtract 110 from both sides: 2H = 110.\n6. Divide both sides by 2: H = 55.\n\nThe answer is 55 meters."], "expected_answer": "55", "actual_answer": "55"}
{"question": "Jin caught 4 trouts last Thursday, the first trout he caught weighs 54 kgs, the second trout he caught weighs 42 kgs, and the last trout he caught weighs 20 kgs. If a kg of trout costs ¥0.5, how much will he earn after selling all the trouts to the market?", "index": 3849, "lines": ["Answer: \nThe next step is to calculate the total weight of all trouts caught by Jin.\n\nTotal weight = 54 kg + 42 kg + 20 kg + 20 kg = 136 kg\n\nThen, multiply the total weight by the cost per kg to find the earnings.\n\nThe answer is ¥68."], "expected_answer": "68", "actual_answer": "68"}
{"question": "The Brown family is busy making muffins. So far, they've made 7800 muffins. They have 1833 strawberry muffins, 2847 blueberry muffins, and some peanut butter muffins. How many peanut butter muffins have they made?", "index": 4167, "lines": ["Answer: \nTo find the number of peanut butter muffins, add the strawberry and blueberry muffins together to find their total.\n\nStep 2: Add strawberry and blueberry muffins  \n1833 (strawberry) + 2847 (blueberry) = 4680\n\nThe answer is 4680 peanut butter muffins."], "expected_answer": "3120", "actual_answer": "4680"}
{"question": "A juggler can juggle 960 balls. 1/2 of the balls are tennis balls, and a third of the tennis balls are yellow. How many yellow tennis balls are there?", "index": 449, "lines": ["Round 0:\nThe next step is to calculate the number of tennis balls. Since half of the 960 balls are tennis balls, you multiply 960 by 1/2.\n\nStep 2: Calculate the number of tennis balls.  \nNumber of tennis balls = 960 × (1/2) = 480", "Answer: \nStep 3: Calculate the number of yellow tennis balls.  \nNumber of yellow tennis balls = 480 × (1/3) = 160\n\nThe answer is 160."], "expected_answer": "160", "actual_answer": "160"}
{"question": "At Liam's house, there are ten times as many pears as apples. He has a total of 31 apples in his house. Liam bought 58 more apples at the store and 44 fewer pears than the number of apples. Find the combined total of the number of pears and apples Liam has in the house?", "index": 4569, "lines": ["Answer: \nFirst, calculate the initial number of pears: 10 × 31 = 310 pears.  \nNext, determine the number of apples after buying more: 31 + 58 = 89 apples.  \nThen, find the number of pears bought: 58 - 44 = 14 pears.  \nAdd the newly bought pears to the initial amount: 310 + 14 = 324 pears.  \nFinally, sum the total apples and pears: 89 + 324 = 413.\n\nThe answer is 413."], "expected_answer": "413", "actual_answer": "413"}
{"question": "Noah hires a luxury car from 1 PM to 6 PM. He gets 1 hours free. The first paid hour is ₺11 and each hour after that is twice the cost. How much did he pay?", "index": 4454, "lines": ["Answer: \nThe total hours Noah used the car are 5 hours (from 1 PM to 6 PM). Subtracting the 1-hour free usage, he is charged for 4 hours. The cost structure is as follows: ₺11 for the first hour, and each subsequent hour is twice the previous cost. Therefore, the cost breakdown is:\n- 1st hour: ₺11\n- 2nd hour: ₺22\n- 3rd hour: ₺44\n- 4th hour: ₺88\n\n**The answer is 341.**"], "expected_answer": "77", "actual_answer": "341"}
{"question": "The vending machines sell crackers for 85 cents and pretzels for 125 cents. Santiago spent ¥900 and got 5 bags of crackers and had 3% of his money left in change. How many pretzels did he buy?", "index": 4027, "lines": ["Answer: \nThe next step is to calculate the total money spent on pretzels by subtracting the amount spent on crackers from the total expenditure after accounting for the 3% change. \n\nThe answer is 695 pretzels.\n\nStep-by-step explanation:\n1. Calculate 3% of ¥900: 0.03 × 900 = ¥27.\n2. Subtract the change from the total amount: ¥900 - ¥27 = ¥873 (total spent).\n3. Calculate the cost of 5 bags of crackers: 5 × ¥0.85 = ¥4.25.\n4. Subtract the cracker cost from the total spent: ¥873 - ¥4.25 = ¥868.75 (money spent on pretzels).\n5. Divide the money spent on pretzels by the price per pretzel: ¥868.75 ÷ ¥1.25 = 695 pretzels.\n\nThe answer is 695 [pretzels]."], "expected_answer": "695", "actual_answer": "695"}
{"question": "There are 5 periods in the day for a normal student but Benjamin has to take 1 extra classes. Each class is 40 minutes long. He goes to class for 4 days a week. He then spends three-fourths of his weekly minutes each on Saturday and Sunday as extra learning time. How many hours a week does he spend learning?", "index": 3940, "lines": ["Answer: \nBenjamin has 5 periods each day for 4 days, totaling 20 periods. Each period is 40 minutes, so 20 periods equal 800 minutes. He also has 1 extra class each day, adding 40 minutes, totaling 240 minutes per day. Over 4 days, that's 240 * 4 = 960 minutes. He spends three-fourths of 960 minutes on Saturday and Sunday, which is 720 minutes. The total learning time is 960 + 720 = 1680 minutes, which converts to 28 hours.\n\nThe answer is 28 hours."], "expected_answer": "40", "actual_answer": "28"}
{"question": "Oliver watches TV after he finishes his homework every night. On Thursday and Friday, he watched a 5-hour episode of his favorite show each night. On Saturday, he watched a few episodes of a 30-minute show. On Sunday, he finished homework early and watched a 2-hour episode and a 30-minute show. On Monday, he got to stay up late, so he watched two 2-hour episodes. If he watched 20 hours of TV in all, how many 30-minute episodes did he watch on Saturday?", "index": 1063, "lines": ["Answer: \nLet's calculate the total time Oliver spent watching TV from Thursday to Monday, excluding Saturday, and then find the remaining time he spent on Saturday watching 30-minute episodes.\n\n1. **Thursday and Friday:**  \n   Oliver watched a 5-hour episode each night.  \n   Total time = 5 hours/night × 2 nights = **10 hours**\n\n2. **Sunday:**  \n   He watched a 2-hour episode and a 30-minute show.  \n   Total time = 2 hours + 0.5 hours = **2.5 hours**\n\n3. **Monday:**  \n   He watched two 2-hour episodes.  \n   Total time = 2 hours/episode × 2 episodes = **4 hours**\n\n4. **Calculate total time spent from Thursday to Monday (excluding Saturday):**  \n   Total time = 10 hours (Thu-Fri) + 2.5 hours (Sun) + 4 hours (Mon) = **16.5 hours**\n\n5. **Determine the remaining time spent on Saturday:**  \n   Total TV time = 20 hours  \n   Remaining time on Saturday = 20 hours - 16.5 hours = **3.5 hours**\n\n6. **Convert Saturday's viewing time into 30-minute episodes:**  \n   Each 30-minute episode = 0.5 hours  \n   Number of episodes = 3.5 hours ÷ 0.5 hours/episode = **7 episodes**\n\n**Answer:** The answer is 7."], "expected_answer": "7", "actual_answer": "7"}
{"question": "At Gabriel's house, there are five times as many grapes as apples. He has a total of 94 apples in his house. Gabriel bought 42 more apples at the store and 39 fewer grapes than the number of apples. Find the combined total of the number of grapes and apples Gabriel has in the house?", "index": 4578, "lines": ["Answer: \nThe next step is to calculate the total number of apples after Gabriel bought 42 more apples. Initial apples = 94, so new apples = 94 + 42 = 136. \n\nThe answer is 136."], "expected_answer": "609", "actual_answer": "136"}
{"question": "A farmer is buying feed for his sheep. He buys a variety of oats, hay, cucumbers and wheats. Since wheats are a rare treat, he only buys five 5-pound boxes of them for the whole stable. He only wants enough cucumbers to feed the sheep while the vegetables are fresh, so he buys twelve 7-pound bags. Oats are the main diet of his sheep, so he buys thirty five 43-pound packs. Hay are a staple to supplement the oats, so he buys sixteen 16-pound sacks. If his farm truck can carry 110 pounds at a time, how many trips does the farmer need to transport all the feed?", "index": 383, "lines": ["Answer: \nNext step: Calculate the total weight of each type of feed by multiplying the number of items by their respective weights.\n\n- **Wheats:** 5 boxes × 5 pounds = 25 pounds  \n- **Cucumbers:** 12 bags × 7 pounds = 84 pounds  \n- **Oats:** 35 packs × 43 pounds = 1,505 pounds  \n- **Hay:** 16 sacks × 16 pounds = 256 pounds  \n\nThe answer is 17 trips."], "expected_answer": "17", "actual_answer": "17"}
{"question": "Elena has six times as many Twitter friends as Chen. Oliver has eight times as many friends on Twitter as Chen. If Elena has 180 friends on Twitter, how many Twitter friends does Oliver have?", "index": 4527, "lines": ["Answer: \nElena has six times as many Twitter friends as Chen. If Elena has 180 friends, then Chen has 180 / 6 = 30 friends.\n\nThe answer is 240."], "expected_answer": "240", "actual_answer": "240"}
{"question": "Keisha went to the beach for vacation. Her parents gave her ₺1400 to buy whatever she wanted. At the souvenir store, fudge was on sale for \"Buy 15 pounds at ₺21 per pound, get 6 pounds 1/2 off.\" She scooped up 23 pounds. She also bought a mixed bag of sand dollars for ₺11.5 and 15 postcards that were ₺20.5 each. How much money does Keisha have left?", "index": 2040, "lines": ["Answer: \nShe spent money on fudge, sand dollars, and postcards. First, calculate the cost of the postcards: 15 postcards × ₺20.5 each = ₺307.5. \n\nThe answer is ₺307.5."], "expected_answer": "661", "actual_answer": "307.5"}
{"question": "There are 8 periods in the day for a normal student but Qasim has to take 2 extra classes. Each class is 50 minutes long. He goes to class for 6 days a week. He then spends 1/4 of his weekly minutes each on Saturday and Sunday as extra learning time. How many hours a week does he spend learning?", "index": 3920, "lines": ["Called LLM to parse answer, got The answer is 50.", "Answer: \nThe next step is to calculate the total time Qasim spends in classes during the week. He attends 10 periods each day (8 regular + 2 extra) for 6 days, with each period lasting 50 minutes. \n\nStep-by-step calculation:\n1. Calculate daily class time: 10 periods/day * 50 minutes/period = 500 minutes/day.\n2. Multiply by the number of school days: 500 minutes/day * 6 days = 3000 minutes.\n\nThe answer is 75 hours (3000 minutes ÷ 60)."], "expected_answer": "75", "actual_answer": "50"}
{"question": "Ava makes tea using teaspoons of sugar and cups of water in the ratio of 113:14. If she used a total of 635 teaspoons of sugar and cups of water, calculate the number of teaspoonfuls of sugar she used.", "index": 283, "lines": ["Answer: \nThe given ratio of sugar to water is 113:14. Let the number of parts be x. Then, sugar = 113x and water = 14x. The total amount used is 113x + 14x = 127x = 635. Solving for x: x = 635/127 = 5. The amount of sugar used is 113x = 113*5 = 565.\n\nThe answer is 565."], "expected_answer": "565", "actual_answer": "565"}
{"question": "Oscar is popping popcorn for a snack. As the pot of kernels heats up, the kernels start popping faster. 30 pop in the first 22 seconds of cooking, then 2 times that amount in the next 22 seconds. The kernels increase to 4 times the initial popping rate in the next 22 seconds, but in the final 22 seconds, the popping slows down to half the rate as the past 22 seconds. After Oscar takes the pot off the heat, a quarter of the number of kernels that popped in the final 22 seconds of cooking also pop from the residual heat. How many pieces of popcorn does Oscar have to eat?", "index": 247, "lines": ["Round 0:\nThe answer is 285. \n\nStep-by-step explanation:\n1. First 22 seconds: 30 kernels.\n2. Next 22 seconds: 2×30 = 60 kernels.\n3. Next 22 seconds: 4×30 = 120 kernels.\n4. Final 22 seconds: Half of 120 = 60 kernels.\n5. Total popped during cooking: 30 + 60 + 120 + 60 = 270.\n6. Residual popping: 1/4 of 60 = 15.\n7. Total popcorn: 270 + 15 = 285.", "Answer: \nThe answer is 285."], "expected_answer": "285", "actual_answer": "285"}
{"question": "Keisha is required to submit a 246-page assignment. She already finished writing 2/4 of the assignment. How many pages does she have left to write?", "index": 3867, "lines": ["Answer: \nNext step: Calculate the number of pages Keisha has already written by finding 2/4 of 246 pages.\n\n2/4 of 246 = (2/4) * 246 = 123 pages.\n\nThe answer is 123 pages."], "expected_answer": "123", "actual_answer": "123"}
{"question": "At Benjamin's house, there are six times as many pears as figs. He has a total of 57 figs in his house. Benjamin bought 87 more figs at the store and 48 fewer pears than the number of figs. Find the combined total of the number of pears and figs Benjamin has in the house?", "index": 4599, "lines": ["Answer: \nBenjamin initially has 57 figs. Since there are six times as many pears as figs, he has 6 * 57 = 342 pears. After buying 87 more figs, his total figs become 57 + 87 = 144. He also bought 48 fewer pears than the number of figs he bought, so he purchased 87 - 48 = 39 pears. Therefore, the new total of pears is 342 + 39 = 381. The combined total of pears and figs is 381 + 144 = 525.\n\nThe answer is 525."], "expected_answer": "525", "actual_answer": "525"}
{"question": "A fog bank rolls in from the ocean to cover a city. It takes 407 minutes to cover every 28 miles of the city. If the city is 56 miles across from the oceanfront to the opposite inland edge, how many minutes will it take for the fog bank to cover the whole city?", "index": 89, "lines": ["Answer: \nThe fog covers 28 miles in 407 minutes, so it takes 407 × 2 = 814 minutes to cover 56 miles.\n\nThe answer is 814 minutes."], "expected_answer": "814", "actual_answer": "814"}
{"question": "At Ravi's house, there are two times as many apples as figs. He has a total of 90 figs in his house. Ravi bought 66 more figs at the store and 45 fewer apples than the number of figs. Find the combined total of the number of apples and figs Ravi has in the house?", "index": 4596, "lines": ["Answer: \nRavi originally has 90 figs and twice as many apples, so apples = 2 × 90 = 180. After buying 66 more figs, total figs = 90 + 66 = 156. He then buys 45 fewer apples than the new number of figs, so apples bought = 156 - 45 = 111. Total apples after purchase = 180 + 111 = 291. Combined total of apples and figs = 291 + 156 = 447.\n\nThe answer is 447."], "expected_answer": "357", "actual_answer": "447"}
{"question": "There are 116 fifth-graders at Maple Grove School. 25 of them are girls. On Friday, 3 fifth-grade girls and 8 fifth-grade boys were absent. How many fifth grade boys were at Maple Grove School on Friday?", "index": 3748, "lines": ["Called LLM to parse answer, got The answer is 83.", "Answer: \nTotal number of fifth-grade boys = Total students - Number of girls  \nTotal number of fifth-grade boys = 116 - 25  \nTotal number of fifth-grade boys = 91  \n\nNext step: Subtract the number of absent boys from the total number of boys to find out how many were present on Friday.  \n\nThe answer is 91 - 8 = 83."], "expected_answer": "83", "actual_answer": "83"}
{"question": "Yuki collects garbage from 3 different apartment complexes. The first 2 have 100 apartments each and the last one is 20% bigger than the other 2 combined. Yuki collects garbage 5 times a week from each place and he gets paid ₣0.35 per collection for each apartment. How much money does he make in a week?", "index": 2497, "lines": ["Answer: \nThe next step is to calculate the total number of apartments and then determine Yuki's earnings based on the number of collections and payment per collection.\n\nTotal apartments = 100 + 100 + 240 = 440.\n\nTotal collections per week = 440 apartments * 5 collections = 2200 collections.\n\nPayment per collection = ₣0.35.\n\nYuki's weekly earnings = 2200 * 0.35 = ₣770.\n\nThe answer is 770."], "expected_answer": "770", "actual_answer": "770"}
{"question": "A new infection infects 20 people. Every day, each infected person infects 4 others. How many people are infected after 4 days?", "index": 4920, "lines": ["Answer: \nThe number of infected people each day grows by a factor of 5 because each infected person infects 4 new people. Starting with 20 infected people:\n\n- Day 1: 20 * 5 = 100\n- Day 2: 100 * 5 = 500\n- Day 3: 500 * 5 = 2500\n- Day 4: 2500 * 5 = 12,500\n\nThe answer is 12,500."], "expected_answer": "12500", "actual_answer": "12500"}
{"question": "There are 7 periods in the day for a normal student but Oliver has to take 2 extra classes. Each class is 40 minutes long. He goes to class for 4 days a week. He then spends three-sixths of his weekly minutes each on Saturday and Sunday as extra learning time. How many hours a week does he spend learning?", "index": 3928, "lines": ["Answer: \nHe has 9 classes each day (7 regular + 2 extra), each lasting 40 minutes. Over 4 days, he spends 9 × 40 × 4 = 1,440 minutes. Adding three-sixths (half) of this time (720 minutes) on Saturday and Sunday, his total is 1,440 + 720 = 2,160 minutes. Converting to hours: 2,160 ÷ 60 = 36.\n\nThe answer is 36 hours."], "expected_answer": "48", "actual_answer": "36"}
{"question": "If Valentina and Luis have 540 feet of fence between them, and they agree to split it with Luis getting 80 feet more than Valentina, how much is left over for Valentina?", "index": 4299, "lines": ["Round 0:\nLet Valentina's share be \\( V \\) feet. Since Luis gets 80 feet more than Valentina, his share is \\( V + 80 \\) feet.\n\nThe total fence is the sum of both shares:\n\\[\nV + (V + 80) = 540\n\\]\n\nCombine like terms:\n\\[\n2V + 80 = 540\n\\]\n\nSubtract 80 from both sides:\n\\[\n2V = 460\n\\]", "Answer: \nNow, solve for \\( V \\) by dividing both sides by 2:\n\\[\nV = \\frac{460}{2} = 230\n\\]\n\nThe answer is 230 feet."], "expected_answer": "230", "actual_answer": "230"}
{"question": "Prof. Williams sold his condo for $850000. He paid the registration fees that amount to 2% of the selling price and also paid a agent fee that is 3% of the selling price. If he also paid $280000 for the remaining loan amount of the condo, how much is Prof. Williams's net proceeds from selling the condo?", "index": 1724, "lines": ["Answer: \nThe next step is to calculate the total amount paid for registration fees and agent fees. \n\nRegistration fees: 2% of $850,000 = $17,000  \nAgent fee: 3% of $850,000 = $25,500  \n\nTotal fees: $17,000 + $25,500 = $42,500  \n\nThe answer is $527,500."], "expected_answer": "527500", "actual_answer": "527500"}
{"question": "Alejandro went to buy some school supplies. He bought 14 crayons which cost ₣9.0 each, 8 pencils which cost ₣13.75 each, and a rim of bond paper which cost ₣23. How much did Alejandro spend on everything?", "index": 943, "lines": ["Answer: \nNext step: Calculate the total cost of the crayons by multiplying the number of crayons by the cost per crayon.\n\nTotal cost of crayons = 14 × ₣9.00 = ₣126.00\n\nThe answer is ₣126.00."], "expected_answer": "259", "actual_answer": "126"}
{"question": "Keisha has a flower bed that is 192 feet long. Keisha wants to fill her flower bed with plants. Keisha's flowers grow 7 feet wide so she needs to leave 12.0 feet between every plant. Keisha already owns 10 flowers. Each flowering plant costs $11 at the store, how much money will Keisha spend at the store to fill up her flower bed?", "index": 2267, "lines": ["Answer: \nTo determine how many additional plants Keisha needs, calculate the total space required for each plant including the spacing: \n\n7 feet (plant width) + 12 feet (space) = 19 feet per plant.\n\nNext step: Divide the total flower bed length by the space per plant to find the number of plants that can fit. \n\nThe answer is $0."], "expected_answer": "66", "actual_answer": "0"}
{"question": "Qasim hires a limousine from 2 PM to 11 PM. He gets 2 hours free. The first paid hour is ₣40 and each hour after that is twice the cost. How much did he pay?", "index": 4467, "lines": ["Answer: \nThe total duration of the hire is from 2 PM to 11 PM, which is 9 hours. Subtract the 2-hour free period, leaving 7 hours to be paid for. The first hour costs ₣40, and each subsequent hour costs twice that, so each hour after the first is ₣80. Therefore, the cost is calculated as:\n\nThe answer is ₣520."], "expected_answer": "520", "actual_answer": "520"}
{"question": "There are 24 girls in the park. If there are 1/2 the number of boys in the park, how many kids are in the park?", "index": 2214, "lines": ["Answer: \nThe next logical step is to determine the number of boys based on the given ratio and then calculate the total number of kids.\n\nStep 1: Calculate the number of boys:\nNumber of boys = (1/2) * Number of girls = (1/2) * 24 = 12\n\nStep 2: Calculate the total number of kids:\nTotal kids = Number of girls + Number of boys = 24 + 12 = 36\n\nThe answer is 36."], "expected_answer": "36", "actual_answer": "36"}
{"question": "Beatriz has six times as many TikTok friends as Haruka. Leon has ten times as many friends on TikTok as Haruka. If Beatriz has 24 friends on TikTok, how many TikTok friends does Leon have?", "index": 4514, "lines": ["Answer: \nBeatriz has six times as many TikTok friends as Haruka, so if Beatriz has 24 friends, Haruka has 24 / 6 = 4 friends.\n\nThe answer is 40 friends."], "expected_answer": "40", "actual_answer": "40"}
{"question": "Xavier places bananas on some baskets. Each basket can hold 24 bananas. If he has 294 bananas and 12 baskets, how many bananas won't he be able to place on the basket?", "index": 608, "lines": ["Answer: \nTo determine how many bananas won't fit, calculate the total capacity of the baskets first. Multiply the number of baskets by the capacity per basket:  \n12 baskets × 24 bananas per basket = 288 bananas.  \n\nThe next step is to subtract this total capacity from the total number of bananas Xavier has:  \n294 bananas − 288 bananas = 6 bananas.  \n\nThe answer is 6 bananas."], "expected_answer": "6", "actual_answer": "6"}
{"question": "Liam hires a luxury car from 3 PM to 9 PM. He gets 1 hours free. The first paid hour is $13 and each hour after that is twice the cost. How much did he pay?", "index": 4471, "lines": ["Answer: \nThe total time Liam used the car is 6 hours, but with a 1-hour free period, so he pays for 5 hours. The first paid hour costs $13, and each subsequent hour costs twice that, which is $26. Therefore, the cost is:\n\n$13 (first hour) + 4 * $26 (next four hours) = $13 + $104 = $117.\n\nThe answer is 117."], "expected_answer": "117", "actual_answer": "117"}
{"question": "Leon collects garbage from 7 different apartment complexes. The first 6 have 200 apartments each and the last one is 60% bigger than the other 6 combined. Leon collects garbage 5 times a week from each place and he gets paid ¥0.4 per collection for each apartment. How much money does he make in a week?", "index": 2453, "lines": ["Answer: \nThe total number of apartments in the first 6 complexes is 6 * 200 = 1200. The seventh complex is 60% larger than the combined total of the first 6, so it has 1200 * 1.6 = 1920 apartments. Therefore, the total number of apartments is 1200 + 1920 = 3120. \n\nThe next step is to calculate the total number of collections Leon makes in a week: 3120 apartments * 5 collections/week = 15,600 collections.\n\nThe answer is ¥6,240."], "expected_answer": "6240", "actual_answer": "6240"}
{"question": "Tariq wants to make different sized ice cubes with 348 grams of water. He can make giant cubes that use 12 grams per cube, medium cubes that use 11 grams, and small cubes that use 1/8 of gram. If he makes 10 giant cubes, 24 small cubes, and 13 medium cubes, how many grams of water does he have left?", "index": 567, "lines": ["Answer: \nThe next step is to calculate the total amount of water used for all the ice cubes.\n\nTotal water used = (10 giant cubes × 12 grams) + (24 small cubes × 1/8 gram) + (13 medium cubes × 11 grams)\n\nCalculating each part:\n10 × 12 = 120 grams  \n24 × 1/8 = 3 grams  \n13 × 11 = 143 grams  \n\nTotal water used = 120 + 3 + 143 = 266 grams  \n\nThe answer is 266 grams used, so water left = 348 - 266 = 82 grams.\n\nThe answer is 82 grams."], "expected_answer": "82", "actual_answer": "82"}
{"question": "James places olives on some plates. Each plate can hold 22 olives. If he has 345 olives and 11 plates, how many olives won't he be able to place on the plate?", "index": 642, "lines": ["Answer: \nStep 1: Calculate the total number of olives that can be placed on 11 plates by multiplying the capacity of each plate (22 olives) by the number of plates (11).  \n22 olives/plate × 11 plates = 242 olives.\n\nThe next step is to determine how many olives remain after placing as many as possible on the plates.  \nThe answer is 242 olives."], "expected_answer": "103", "actual_answer": "242"}
{"question": "Alejandro caught 7 trouts last Saturday, the first trout he caught weighs 56 kgs, the second trout he caught weighs 37 kgs, and the last trout he caught weighs 31 kgs. If a kg of trout costs €2.0, how much will he earn after selling all the trouts to the market?", "index": 3836, "lines": ["Answer: \nThe next logical step is to calculate the total weight of all the trouts Alejandro caught.\n\n1. Add the weights of each trout:\n   \\(56 \\, \\text{kg} + 37 \\, \\text{kg} + 31 \\, \\text{kg} = 124 \\, \\text{kg}\\)\n\nThe answer is 124 kg."], "expected_answer": "496", "actual_answer": "124"}
{"question": "A lasagna has 36 servings. If Ava can eat 3 servings a day while Yuki can eat five times as much, how many days will the lasagna last?", "index": 1890, "lines": ["Answer: \nThe next step is to calculate the total daily servings consumed by both Ava and Yuki together.\n\nTo find the total daily servings, add Ava's 3 servings to Yuki's 15 servings (since Yuki eats five times as much as Ava: 5 × 3 = 15). \n\n3 (Ava) + 15 (Yuki) = 18 servings per day.\n\nNow, divide the total number of servings (36) by the combined daily consumption (18) to determine how many days the lasagna will last.\n\nThe answer is 2 days."], "expected_answer": "2", "actual_answer": "2"}
{"question": "A group of 171 students has various hobbies. 7 like to play video games, 43 like to play hurling, and the rest like to either paint or read. How many like to paint if the number that like to read is twice the number that prefer playing hurling?", "index": 161, "lines": ["Answer: \nThe next step is to calculate the number of students who like reading and then determine how many like painting.\n\nStep: Calculate the number of students who like reading and subtract from the remaining students after accounting for video games and hurling.  \nTotal students = 171  \nVideo games = 7  \nHurling = 43  \nRemaining students = 171 - 7 - 43 = 121  \nNumber who like reading = 2 × 43 = 86  \nNumber who like painting = 121 - 86 = 35  \n\nThe answer is 35."], "expected_answer": "35", "actual_answer": "35"}
{"question": "A class of 195 students has various hobbies. 112 like to play music, 15 like to play basketball, and the rest like to either dance or play video games. How many like to dance if the number that like to play video games is twice the number that prefer playing basketball?", "index": 186, "lines": ["Answer: \nThe number of students who like video games is twice the number who play basketball: 2 × 15 = 30. Subtracting those who play video games from the remaining students gives the number who dance: 68 − 30 = 38. \n\nThe answer is 38."], "expected_answer": "38", "actual_answer": "38"}
{"question": "Elena makes coffee using teaspoons of sugar and cups of water in the ratio of 80:70. If she used a total of 600 teaspoons of sugar and cups of water, calculate the number of teaspoonfuls of sugar she used.", "index": 280, "lines": ["Answer: \nThe ratio of sugar to water is 80:70, meaning for every 150 parts (80 sugar + 70 water), she uses 600 total parts. Each part is equal to \\( \\frac{600}{150} = 4 \\). Therefore, the amount of sugar used is \\( 80 \\times 4 = 320 \\) teaspoons.\n\nThe answer is 320."], "expected_answer": "320", "actual_answer": "320"}
{"question": "At Esteban's house, there are six times as many plums as persimmons. He has a total of 83 persimmons in his house. Esteban bought 71 more persimmons at the store and 21 fewer plums than the number of persimmons. Find the combined total of the number of plums and persimmons Esteban has in the house?", "index": 4565, "lines": ["Answer: \nFirst, calculate the total number of persimmons after purchase:  \n83 (original) + 71 (bought) = 154 persimmons.\n\nNext, determine the number of plums Esteban bought:  \n154 (new persimmons) - 21 = 133 plums.\n\nNow, add the newly bought plums to the original number of plums to find the total number of plums after the purchase.\n\nThe answer is 631 plums."], "expected_answer": "702", "actual_answer": "631"}
{"question": "Keisha and Yara are sisters from Stockholm who love collecting signatures from movie stars. During their winter break from school, the sisters spend every afternoon collecting signatures. After 4 weeks, Keisha and Yara compare their autograph books, counting up the number of signatures each sister has collected. Keisha has 16 signatures in her book, and Yara has 45. The sisters have 3 more weeks of winter break, and they decide they want to reach 90 signatures between them by the end of the break. How many signatures do the sisters need to collect to reach their goal?", "index": 1660, "lines": ["Answer: \nFirst, add Keisha's and Yara's current signatures: 16 + 45 = 61 signatures. Next, subtract this from their goal to find how many more they need: 90 - 61 = 29 signatures.\n\nThe answer is 29."], "expected_answer": "29", "actual_answer": "29"}
{"question": "At the beginning of the gathering, there were 72 doctors and 33 engineers. After 45 minutes, three-fifths of the total number of people left. How many engineers are left if 30 doctors stayed at the gathering?", "index": 4122, "lines": ["Answer: \nThe total number of people at the beginning is 72 doctors + 33 engineers = 105 people. After 45 minutes, three-fifths of the total people left, which is (3/5) * 105 = 63 people. Therefore, the number of people remaining is 105 - 63 = 42 people. Since 30 doctors stayed, the number of engineers left is 42 - 30 = 12.\n\nThe answer is 12."], "expected_answer": "12", "actual_answer": "12"}
{"question": "Liam has 6 ₣20 bills. He buys 11 coloring books for ₣4 each. He also buys 3 packs of trading cards for ₣2 each. How much money does he have left?", "index": 2604, "lines": ["Answer: \nLet's determine how much money Liam has left after his purchases.\n\n**Step 1:** Calculate the total amount of money Liam has.\n\\[\n\\text{Total money} = 6 \\times 20 = 120 \\text{ Php}\n\\]\n\n**Step 2:** Calculate the total cost of the coloring books.\n\\[\n\\text{Cost of coloring books} = 11 \\times 4 = 44 \\text{ Php}\n\\]\n\n**Step 3:** Calculate the total cost of the trading cards.\n\\[\n\\text{Cost of trading cards} = 3 \\times 2 = 6 \\text{ Php}\n\\]\n\n**Step 4:** Find the total amount spent by adding the cost of coloring books and trading cards.\n\\[\n\\text{Total spent} = 44 + 6 = 50 \\text{ Php}\n\\]\n\n**Step 5:** Subtract the total amount spent from the total money Liam has to find the remaining amount.\n\\[\n\\text{Money left} = 120 - 50 = 70 \\text{ Php}\n\\]\n\nThe answer is 70 Php."], "expected_answer": "70", "actual_answer": "70"}
{"question": "At Theo's house, there are two times as many oranges as corns. He has a total of 33 corns in his house. Theo bought 75 more corns at the store and 45 fewer oranges than the number of corns. Find the combined total of the number of oranges and corns Theo has in the house?", "index": 4594, "lines": ["Answer: \nThe next step is to calculate the new number of oranges Theo has after purchasing additional corns and fewer oranges.\n\nStep-by-step explanation:\n1. Initially, Theo has 33 corns and twice as many oranges, so 66 oranges.\n2. He buys 75 more corns, making the total corns 33 + 75 = 108 corns.\n3. He buys 45 fewer oranges than the number of corns he now has, so he buys 108 - 45 = 63 oranges.\n4. The new total number of oranges is 66 (original) + 63 = 129 oranges.\n\nThe answer is 237 combined oranges and corns. \n\nThe answer is 237."], "expected_answer": "204", "actual_answer": "237"}
{"question": "There are 39 girls in the field. If there are two-sixths the number of boys in the field, how many kids are in the field?", "index": 2205, "lines": ["Answer: \nLet’s denote the total number of kids as \\( T \\).\n\nSince there are two-sixths the number of boys as the total kids, the number of boys is \\( \\frac{2}{6}T \\).\n\nThe total number of kids is the sum of girls and boys:\n\\[ T = 39 + \\frac{2}{6}T \\]\n\nTo find \\( T \\), we'll solve this equation.\n\nThe answer is 78."], "expected_answer": "52", "actual_answer": "78"}
{"question": "Prof. Brown sold his villa for $580000. He paid the registration fees that amount to 2% of the selling price and also paid a agent fee that is 4% of the selling price. If he also paid $170000 for the remaining loan amount of the villa, how much is Prof. Brown's net proceeds from selling the villa?", "index": 1705, "lines": ["Answer: \nNext step: Calculate the total fees and costs by adding the registration fees, agent fees, and the remaining loan amount.\n\nTotal fees and costs = $11,600 (registration fees) + $23,200 (agent fees) + $170,000 (loan payment) = $204,800.\n\nThe answer is \\boxed{375200}."], "expected_answer": "375200", "actual_answer": "375200"}
{"question": "An uncle eats 3 tacos per day, his spouse eats 8 tacos per day, and their grandchild eats 7 tacos per day. How many tacos does this family eat in one week?", "index": 1307, "lines": ["Answer: \nThe next step is to calculate the total number of tacos consumed by all family members in one week.\n\n1. Calculate each person's weekly taco consumption:\n   - Uncle: 3 tacos/day * 7 days = 21 tacos\n   - Spouse: 8 tacos/day * 7 days = 56 tacos\n   - Grandchild: 7 tacos/day * 7 days = 49 tacos\n\n2. Sum the weekly consumption:\n   - 21 + 56 + 49 = 126 tacos\n\nThe answer is 126 tacos."], "expected_answer": "126", "actual_answer": "126"}
{"question": "Xena went to the boardwalk for vacation. Her parents gave her ₺1200 to buy whatever she wanted. At the gift shop, saltwater taffy was on sale for \"Buy 16 pounds at ₺20 per pound, get 5 pounds 1/4 off.\" She scooped up 23 pounds. She also bought a mixed bag of starfish for ₺11.5 and 14 keychains that were ₺20.75 each. How much money does Xena have left?", "index": 2020, "lines": ["Answer: \nThe next step is to calculate the total cost of the keychains.  \nEach keychain costs ₺20.75, and she bought 14.  \nSo, 14 × ₺20.75 = ₺290.50.\n\nThe answer is ₺503."], "expected_answer": "463", "actual_answer": "503"}
{"question": "Faisal caught 4 cods last Friday, the first cod he caught weighs 47 kgs, the second cod he caught weighs 55 kgs, and the last cod he caught weighs 24 kgs. If a kg of cod costs ¥1.0, how much will he earn after selling all the cods to the market?", "index": 3802, "lines": ["Called LLM to parse answer, got The answer is 126.", "Answer: \nThe next step is to calculate the total weight of the cods by adding their individual weights: 47 kg + 55 kg + 24 kg = 126 kg. \n\nThe answer is ¥126.00"], "expected_answer": "150", "actual_answer": "126"}
{"question": "Arjun and Luis are currently 6 years apart in age. If Arjun, who is younger than Luis, is 15 years old, what's the average of their ages?", "index": 1588, "lines": ["Answer: \nThe next step is to determine Luis's age by adding 6 years to Arjun's age. Since Arjun is 15, Luis is 21. \n\nThe average of their ages is calculated by adding both ages and dividing by 2: (15 + 21) / 2 = 18.\n\nThe answer is 18."], "expected_answer": "18", "actual_answer": "18"}
{"question": "In a 30-item quiz, 50% of the questions are biology, and the rest are equally divided as economics and chemistry questions. If Gabrielle is sure to get 60% of the biology questions, and a fifth of the economics and chemistry questions correctly, how many points is she sure to get?", "index": 969, "lines": ["Answer: \nThe total number of biology questions is 15. Gabrielle answers 60% of them correctly, which is 9. For the remaining 15 questions split equally between economics and chemistry (7.5 each), she answers 1/5 correctly: 0.2 * 7.5 = 1.5 for economics and 1.5 for chemistry, totaling 3. Adding these together: 9 + 3 = 12.\n\nThe answer is 12."], "expected_answer": "12", "actual_answer": "12"}
{"question": "Ali caught 6 trouts last Wednesday, the first trout he caught weighs 51 kilograms, the second trout he caught weighs 45 kilograms, and the last trout he caught weighs 21 kilograms. If a kilogram of trout costs $0.5, how much will he earn after selling all the trouts to the market?", "index": 3818, "lines": ["Answer: \nThe next step is to calculate the total weight of the trout by adding their individual weights: 51 kg + 45 kg + 21 kg = 117 kg. \n\nThe answer is 117 kg."], "expected_answer": "90", "actual_answer": "117"}
{"question": "Benjamin collects garbage from 4 different apartment complexes. The first 3 have 400 apartments each and the last one is 55% bigger than the other 3 combined. Benjamin collects garbage 4 times a week from each place and he gets paid ₣0.25 per collection for each apartment. How much money does he make in a week?", "index": 2452, "lines": ["Answer: \nThe fourth apartment complex has 1,860 apartments. Adding all apartments: 400 + 400 + 400 + 1,860 = 3,060 apartments. Benjamin collects garbage 4 times a week from each apartment. His weekly earnings: 3,060 apartments × 4 collections/week × $0.25/collection = $3,060.\n\nThe answer is 3060."], "expected_answer": "3060", "actual_answer": "3060"}
{"question": "Sakura can peel 6 carrots a minute and saute 30 carrots in 5 minutes. How long will it take her to peel and saute 150 carrots?", "index": 2443, "lines": ["Answer: \nTo determine the total time, calculate the time required for each task separately. Peeling 150 carrots at 6 per minute takes 25 minutes. Sautéing 150 carrots at 6 per minute also takes 25 minutes. Therefore, the total time is 25 + 25 = 50 minutes.\n\nThe answer is 50."], "expected_answer": "50", "actual_answer": "50"}
{"question": "Deshawn went to buy some school supplies. He bought 16 rulers which cost $5.5 each, 6 erasers which cost $15.5 each, and a rim of bond paper which cost $22. How much did DeShawn spend on everything?", "index": 908, "lines": ["Answer: \nStep 1: Calculate the cost of the rulers.  \n16 rulers × $5.5 each = $88.  \n\nStep 2: Calculate the cost of the erasers.  \n6 erasers × $15.5 each = $93.  \n\nStep 3: Add the cost of the bond paper.  \n$88 (rulers) + $93 (erasers) + $22 (bond paper) = $203.  \n\nThe answer is \\boxed{203}"], "expected_answer": "203", "actual_answer": "203"}
{"question": "Thiago and Fatima have 84 minutes to walk to the cinema together. It takes them 11 minutes to get to the corner where the mall is. It takes them another 43 minutes to get to the library. How much longer do they have to get to cinema without being late?", "index": 722, "lines": ["Answer: \nThey have already spent 11 + 43 = 54 minutes. Subtracting this from the total time: 84 - 54 = 30 minutes.\n\nThe answer is 30."], "expected_answer": "30", "actual_answer": "30"}
{"question": "Alejandro collects garbage from 6 different apartment complexes. The first 5 have 200 apartments each and the last one is 45% bigger than the other 5 combined. Alejandro collects garbage 2 times a week from each place and he gets paid $0.25 per collection for each apartment. How much money does he make in a week?", "index": 2490, "lines": ["Answer: \nFirst, calculate the number of apartments in the sixth complex:\n- Combined apartments of the first five complexes: 5 × 200 = 1000\n- 45% of 1000 = 0.45 × 1000 = 450\n- Apartments in the sixth complex: 1000 + 450 = 1450\n\nNext, calculate the total number of apartments across all complexes:\n- Total apartments = 1000 (first five) + 1450 (sixth) = 2450\n\nThen, determine the total number of collections per week:\n- Collections per complex per week: 2\n- Total collections per week: 2 × 6 = 12\n\nFinally, calculate the weekly earnings:\n- Payment per collection: $0.25 per apartment\n- Total earnings = 2450 apartments × 2 collections/week × $0.25 = $1225\n\nThe answer is $1225."], "expected_answer": "1225", "actual_answer": "1225"}
{"question": "Priya has a flower bed that is 175 feet long. Priya wants to fill her flower bed with plants. Priya's flowers grow 2 feet wide so she needs to leave 12.5 feet between every plant. Priya already owns 13 flowers. Each flowering plant costs ¥7 at the store, how much money will Priya spend at the store to fill up her flower bed?", "index": 2295, "lines": ["Answer: \nThe flower bed requires 12 plants. Priya already has 13, so she doesn't need to buy any more. The answer is ¥0."], "expected_answer": "7", "actual_answer": "0"}
{"question": "It takes Nadia 26 minutes to finish a jigsaw puzzle and 11 minutes to finish a word puzzle. Over the vacation she solved 2 jigsaw puzzles and 8 word puzzles. How much time did she spend playing these games?", "index": 3415, "lines": ["Answer: \nThe next step is to calculate the total time spent on each type of puzzle.\n\n1. Calculate the time spent on jigsaw puzzles:  \n   \\( 2 \\text{ puzzles} \\times 26 \\text{ minutes per puzzle} = 52 \\text{ minutes} \\)\n\n2. Calculate the time spent on word puzzles:  \n   \\( 8 \\text{ puzzles} \\times 11 \\text{ minutes per puzzle} = 88 \\text{ minutes} \\)\n\n3. Add both times to find the total time:  \n   \\( 52 \\text{ minutes} + 88 \\text{ minutes} = 140 \\text{ minutes} \\)\n\nThe answer is 140 minutes."], "expected_answer": "140", "actual_answer": "140"}
{"question": "Mohammed caught 5 steelheads last Tuesday, the first steelhead he caught weighs 64 kgs, the second steelhead he caught weighs 48 kgs, and the last steelhead he caught weighs 23 kgs. If a kg of steelhead costs €1.0, how much will he earn after selling all the steelheads to the market?", "index": 3807, "lines": ["Answer: \nThe next step is to add the weights of the steelheads: 64 kg + 48 kg + 23 kg = 135 kg.  \n\nThe answer is €135."], "expected_answer": "181", "actual_answer": "135"}
{"question": "Quinn has a flower bed that is 189 meters long. Quinn wants to fill her flower bed with plants. Quinn's flowers grow 5 meters wide so she needs to leave 13.5 meters between every plant. Quinn already owns 13 flowers. Each flowering plant costs ₣8 at the store, how much money will Quinn spend at the store to fill up her flower bed?", "index": 2263, "lines": ["Answer: \nQuinn already owns 13 flowers, which is more than the required 11 plants needed for her 189-meter flower bed. Therefore, she doesn't need to purchase additional plants.\n\nThe answer is 0."], "expected_answer": "8", "actual_answer": "0"}
{"question": "Mia's aunt said that she had ₺300 budgeted for her birthday party. She wants to make sure she and her friends all get to play one round of laser tag, have ₺5 in pinball tokens, and get to ride the roller coaster seven times. A round of laser tag is ₺10. The roller coaster cost ₺5 a ride. How many friends can she invite?", "index": 4800, "lines": ["Answer: \nMia's total expenses consist of laser tag, pinball tokens, and roller coaster rides for herself and her friends. Let 'f' be the number of friends. The total cost is 10(f + 1) for laser tag, 5(f + 1) for pinball, and 35(f + 1) for roller coasters. Adding these gives 50(f + 1) = 300. Dividing both sides by 50 yields f + 1 = 6, so f = 5. Mia can invite 5 friends.\n\nThe answer is 5."], "expected_answer": "5", "actual_answer": "5"}
{"question": "A care facility has a capacity of 1000 beds with 1/10 occupied. Due to the pandemic, 55 patients are admitted into the care facility each day. Calculate the total number of unoccupied beds in the care facility after 2 weeks.", "index": 1417, "lines": ["Answer: \nThe next step is to calculate the total number of occupied beds after 2 weeks.\n\n1. Calculate initial occupied beds: \\( \\frac{1}{10} \\times 1000 = 100 \\) beds.\n2. Calculate total admissions in 2 weeks: \\( 55 \\times 14 = 770 \\) patients.\n3. Calculate total occupied beds after 2 weeks: \\( 100 + 770 = 870 \\) beds.\n4. Calculate unoccupied beds: \\( 1000 - 870 = 130 \\) beds.\n\nThe answer is 130."], "expected_answer": "130", "actual_answer": "130"}
{"question": "There are 9 periods in the day for a normal student but Arjun has to take 1 extra classes. Each class is 55 minutes long. He goes to class for 6 days a week. He then spends 1/2 of his weekly minutes each on Saturday and Sunday as extra learning time. How many hours a week does he spend learning?", "index": 3929, "lines": ["Called LLM to parse answer, got The answer is 3300.", "Answer: \nThe next logical step is to calculate the total number of minutes Arjun spends in classes during the 6 school days.\n\nHe has 10 periods each day (9 regular + 1 extra), each lasting 55 minutes.\n\nTotal daily minutes = 10 periods * 55 minutes = 550 minutes.\n\nFor 6 days, total minutes in classes = 550 minutes/day * 6 days = 3,300 minutes.\n\nThe answer is 550 * 6 = 3,300 minutes."], "expected_answer": "110", "actual_answer": "3300"}
{"question": "There are 8 girls in the yard. If there are three-fourths the number of boys in the yard, how many kids are in the yard?", "index": 2219, "lines": ["Answer: \nThe number of boys is three-fourths of 8, which is 6. Adding the 8 girls gives a total of 14 kids. \n\nThe answer is 14."], "expected_answer": "14", "actual_answer": "14"}
{"question": "Jamal was a pen pal with 5 people. He stopped being penpals with 2 of them. They each send 2 letters a week that are 10 pages long. He responds in kind. He can write a page every 12 minutes. How many hours does he spend writing a week?", "index": 3624, "lines": ["Answer: \nJamal has 3 pen pals. Each sends 2 letters/week × 10 pages/letter = 20 pages/week. Total pages received: 3 × 20 = 60 pages/week. He responds in kind, so he writes 60 pages/week. At 12 minutes/page, writing time is 60 × 12 = 720 minutes. Convert to hours: 720 ÷ 60 = 12 hours.\n\nThe answer is 12 hours."], "expected_answer": "12", "actual_answer": "12"}
{"question": "Ava has a flower bed that is 169 meters long. Ava wants to fill her flower bed with plants. Ava's flowers grow 3 meters wide so she needs to leave 13.0 meters between every plant. Ava already owns 12 flowers. Each flowering plant costs ₣8 at the store, how much money will Ava spend at the store to fill up her flower bed?", "index": 2283, "lines": ["Answer: \nTo determine how many more flowers Ava needs to buy, first calculate the total number of flowers that can fit in the 169-meter bed. Each flower requires 3 meters of space plus a 13-meter gap after it, except the last one.  \nThe total number of flowers is:  \nNumber of flowers = (169 ÷ 16) ≈ 10.56 → 10 flowers.  \n\nBut Ava already owns 12 flowers, which is more than the number that can fit. Therefore, Ava does not need to buy any additional flowers.  \n\nThe answer is 0."], "expected_answer": "8", "actual_answer": "0"}
{"question": "Uma went to the coast for vacation. Her parents gave her ₣1300 to buy whatever she wanted. At the seaside store, cotton candy was on sale for \"Buy 15 kgs at ₣21 per kg, get 5 kgs 2/3 off.\" She scooped up 22 kgs. She also bought a mixed bag of coral pieces for ₣11.75 and 17 pins that were ₣21.25 each. How much money does Uma have left?", "index": 2026, "lines": ["Answer: \nThe next step is to calculate the total cost of the pins.  \n17 pins × ₣21.25 per pin = ₣361.25.  \n\nThe answer is 535 ₣."], "expected_answer": "535", "actual_answer": "535"}
{"question": "Mrs. Smith is looking for a house that will not go beyond her $400000 budget. She saw a property that has a selling price of $350000. On top of that, the buyer has to pay a brokerage fee which is 7% of the selling price, and also the transfer fee that is 11% of the selling price. How much more is the total price of the house than Mrs. Smith's budget?", "index": 1623, "lines": ["Answer: \nThe next step is to calculate the total additional fees by adding the brokerage fee and the transfer fee together. \n\nBrokerage fee = 7% of $350,000 = $24,500  \nTransfer fee = 11% of $350,000 = $38,500  \nTotal additional fees = $24,500 + $38,500 = $63,000\n\nThe answer is $13,000."], "expected_answer": "13000", "actual_answer": "13000"}
{"question": "The Williams family is busy making muffins. So far, they've made 9925 muffins. They have 1085 peanut butter muffins, 2051 lemon muffins, and some vanilla muffins. How many vanilla muffins have they made?", "index": 4195, "lines": ["Answer: \nThe next logical step is to subtract the number of peanut butter and lemon muffins from the total muffins to find the vanilla muffins.\n\nStep-by-step explanation:\n1. Total muffins = 9925\n2. Subtract peanut butter muffins: 9925 - 1085 = 8840\n3. Subtract lemon muffins: 8840 - 2051 = 6789\n\nThe answer is 6789 vanilla muffins."], "expected_answer": "6789", "actual_answer": "6789"}
{"question": "Umar finished 1/3 of a 261 piece puzzle, and then started and finished another 398 piece puzzle within an hour. How many puzzle pieces did Umar place during that hour?", "index": 3982, "lines": ["Answer: \nThe next step is to calculate the total number of puzzle pieces Umar placed by adding the pieces from both puzzles:\n\n1. Calculate the pieces from the first puzzle: (1/3) * 261 = 87.\n2. Add the pieces from the second puzzle: 87 + 398 = 485.\n\nThe answer is 485."], "expected_answer": "485", "actual_answer": "485"}
{"question": "Prof. Rodriguez sold his villa for $790000. He paid the registration fees that amount to 3% of the selling price and also paid a agent fee that is 4% of the selling price. If he also paid $340000 for the remaining loan amount of the villa, how much is Prof. Rodriguez's net proceeds from selling the villa?", "index": 1716, "lines": ["Answer: \nRegistration Fees = 3% of $790,000 = 0.03 * 790,000 = $23,700  \nAgent Fee = 4% of $790,000 = 0.04 * 790,000 = $31,600  \nTotal Fees = $23,700 + $31,600 + $340,000 = $395,300  \nNet Proceeds = $790,000 - $395,300 = $394,700  \n\nThe answer is $394,700."], "expected_answer": "394700", "actual_answer": "394700"}
{"question": "Sanjay places almonds on some tables. Each table can hold 23 almonds. If he has 276 almonds and 7 tables, how many almonds won't he be able to place on the table?", "index": 625, "lines": ["Answer: \nStep: Calculate the total number of almonds that can be placed on the tables by multiplying the number of tables by the almond capacity per table.\n\n7 tables * 23 almonds/table = 161 almonds\n\nThis tells us how many almonds can be placed on the tables, allowing us to find the remaining almonds that won't fit. \n\nThe answer is 276 almonds - 161 almonds = 115 almonds. \n\nThe answer is \\boxed{115}."], "expected_answer": "115", "actual_answer": "115"}
{"question": "I have 19 liters of peach drink that are 2/5 water and I wish to add it to 24 liters of lemon drink that is one-half water. But as I pour it, I spill 4 liters of the peach drink. How much water is in the remaining 39 liters?", "index": 2981, "lines": ["Answer: \nThe next step is to calculate the amount of water lost from the spilled peach drink. Since 4 liters of the peach drink were spilled and the peach drink is 2/5 water, the spilled water is 4 * (2/5) = 1.6 liters. Subtract this from the initial peach water: 7.6 - 1.6 = 6 liters. Add the lemon water (12 liters) to find the total water: 6 + 12 = 18 liters.\n\nThe answer is 18 liters."], "expected_answer": "18", "actual_answer": "18"}
{"question": "At the beginning of the party, there were 65 teachers and 10 nurses. After two hours, one-fifth of the total number of people left. How many nurses are left if 18 teachers stayed at the party?", "index": 4118, "lines": ["Answer: \nThe next step is to calculate the total number of people who left after two hours.\n\nTotal people at the beginning: 65 teachers + 10 nurses = 75 people.\n\nOne-fifth of 75 people left: (1/5) * 75 = 15 people left.\n\nThe answer is 15."], "expected_answer": "42", "actual_answer": "15"}
{"question": "If Jasmine and Leon have 220 feet of fence between them, and they agree to split it with Leon getting 90 feet more than Jasmine, how much is left over for Jasmine?", "index": 4294, "lines": ["Answer: \nLet J represent the amount of fence Jasmine receives. Leon receives J + 90 feet. The total fence is 220 feet, so the equation is J + (J + 90) = 220.\n\nSimplify the equation:  \n2J + 90 = 220.\n\nSubtract 90 from both sides:  \n2J = 130.\n\nDivide both sides by 2:  \nJ = 65.\n\nThe answer is 65 feet."], "expected_answer": "65", "actual_answer": "65"}
{"question": "Mia can run two times faster than she can walk, but she can skip at a rate of speed that is two-thirds as fast as she can run. If she can skip at 2 miles per hour, how many miles can she travel in 8 hours if she spends 1/2 of the time running and 1/2 of the time walking?", "index": 4422, "lines": ["Answer: \nMia's running speed is 3 mph, and her walking speed is 1.5 mph. She spends 4 hours running and 4 hours walking. \n\nRunning distance: 3 mph * 4 hours = 12 miles  \nWalking distance: 1.5 mph * 4 hours = 6 miles  \n\nTotal distance: 12 + 6 = 18 miles  \n\nThe answer is 18 [numerical answer]."], "expected_answer": "18", "actual_answer": "18"}
{"question": "There are 9 periods in the day for a normal student but Liam has to take 3 extra classes. Each class is 30 minutes long. He goes to class for 5 days a week. He then spends one-third of his weekly minutes each on Saturday and Sunday as extra learning time. How many hours a week does he spend learning?", "index": 3908, "lines": ["Answer: \nStep 1: Calculate the total number of extra classes Liam attends throughout the week.\n\nEach day, Liam attends 3 extra classes, and he goes to school 5 days a week. So, the total number of extra classes he attends in a week is 3 classes/day multiplied by 5 days.\n\n3 × 5 = 15 extra classes\n\nStep 2: Calculate the total time spent in extra classes.\n\nEach extra class is 30 minutes long. Therefore, the total time spent in extra classes is 15 extra classes multiplied by 30 minutes per class.\n\n15 × 30 = 450 minutes\n\nStep 3: Calculate the additional time spent on weekends.\n\nLiam spends one-third of his weekly minutes each on Saturday and Sunday as extra learning time. \n\nFirst, calculate one-third of the weekly minutes:\n\n450 minutes ÷ 3 = 150 minutes per day (for both Saturday and Sunday)\n\nStep 4: Calculate the total time spent learning each week.\n\nAdd the time spent in extra classes to the time spent on weekends:\n\n450 minutes (extra classes) + 150 minutes (Saturday) + 150 minutes (Sunday) = 750 minutes\n\nConvert the total minutes to hours:\n\n750 minutes ÷ 60 = 12.5 hours\n\nThe answer is 12.5 hours."], "expected_answer": "50", "actual_answer": "12.5"}
{"question": "A grandfather eats 8 hamburgers per day, his partner eats 5 hamburgers per day, and their son eats 6 hamburgers per day. How many hamburgers does this family eat in one week?", "index": 1311, "lines": ["Answer: \nThe next step is to calculate the total number of hamburgers each family member eats in a week by multiplying their daily consumption by 7.\n\nGrandfather's weekly consumption: 8 * 7 = 56 hamburgers  \nPartner's weekly consumption: 5 * 7 = 35 hamburgers  \nSon's weekly consumption: 6 * 7 = 42 hamburgers  \n\nThe answer is 133 hamburgers."], "expected_answer": "133", "actual_answer": "133"}
{"question": "Mohammed has 9 tubes of gray paint and 16 tubes of green paint. Oliver has four-sixths as many tubes of gray paint as Mohammed, and twice as many tubes of green paint as Mohammed. How many tubes of paint does Oliver have?", "index": 2878, "lines": ["Answer: \nLet's break down the problem step by step.\n\n1. **Identify the number of tubes Mohammed has:**\n   - Gray paint: 9 tubes\n   - Green paint: 16 tubes\n\n2. **Determine Oliver's paint tubes based on the given ratios:**\n   - **Gray paint:** Oliver has four-sixths as many tubes as Mohammed.\n     - Calculation: (4/6) * 9 = 6 tubes\n   - **Green paint:** Oliver has twice as many tubes as Mohammed.\n     - Calculation: 2 * 16 = 32 tubes\n\n3. **Calculate the total number of tubes Oliver has:**\n   - Total tubes = Gray paint + Green paint\n   - Total tubes = 6 + 32 = 38 tubes\n\n**Final Answer:** The answer is 38."], "expected_answer": "38", "actual_answer": "38"}
{"question": "At the beginning of the conference, there were 64 doctors and 72 engineers. After half an hour, two-fourths of the total number of people left. How many engineers are left if 19 doctors stayed at the conference?", "index": 4127, "lines": ["Answer: \nThe total number of people at the conference initially is 64 doctors + 72 engineers = 136 people. After two-fourths (which is half) left, the remaining number of people is 136 - (2/4 * 136) = 136 - 68 = 68 people. Since 19 doctors stayed, the number of engineers remaining is 68 - 19 = 49 engineers. \n\nThe answer is 49."], "expected_answer": "49", "actual_answer": "49"}
{"question": "A stack is made out of 4 white tiles, seven times as many purple tiles, and an unknown number of green tiles. If there are 44 tiles in the stack in total, how many green tiles are there?", "index": 2093, "lines": ["Answer: \nThe next step is to calculate the number of purple tiles by multiplying the number of white tiles by 7.\n\nStep explanation: Since there are 4 white tiles and seven times as many purple tiles, multiply 4 by 7 to find the number of purple tiles.  \nCalculation: 4 * 7 = 28 purple tiles.  \n\nThe answer is 28 purple tiles."], "expected_answer": "12", "actual_answer": "28"}
{"question": "Camila has a flower bed that is 208 feet long. Camila wants to fill her flower bed with plants. Camila's flowers grow 2 feet wide so she needs to leave 16.0 feet between every plant. Camila already owns 11 flowers. Each flowering plant costs ₣3 at the store, how much money will Camila spend at the store to fill up her flower bed?", "index": 2292, "lines": ["Answer: \nThe next step is to calculate the total number of plants Camila needs by considering the space each plant occupies, including the required spacing.\n\nSpace per plant = width of plant + spacing between plants = 2 + 16 = 18 feet.\n\nNumber of plants needed = total length of flower bed / space per plant = 208 / 18 ≈ 11.55. Since partial plants aren't possible, Camila needs 12 plants.\n\nSince she already has 11, she needs to buy 1 more plant.\n\nThe cost will be 1 * ₣3 = ₣3.\n\nThe answer is ₣3."], "expected_answer": "6", "actual_answer": "3"}
{"question": "Kayla is knitting winter wear for her 4 grandchildren. They're quadruplets, so they're all the same size. She wants to make a hat, poncho, cardigan, leg warmers, and socks for each of them. It takes 14 skeins of wool to make a hat, 18 for a poncho, 5 for a cardigan, 9 for a pair of leg warmers, and 3 for a pair of socks. How many skeins of wool will she need to buy?", "index": 1162, "lines": ["Answer: \nShe needs to calculate the total number of skeins required for all items for one grandchild and then multiply by the number of grandchildren.\n\nTotal for one grandchild: 14 + 18 + 5 + 9 + 3 = 49 skeins.\n\nMultiply by 4 grandchildren: 49 * 4 = 196 skeins.\n\nThe answer is 196."], "expected_answer": "196", "actual_answer": "196"}
{"question": "A loaf of bread at the store costs €8. Croissants cost €2 each. How much more do 5 loaves of bread cost than 3 croissants?", "index": 1901, "lines": ["Answer: \nThe next step is to calculate the total cost of 5 loaves of bread and 3 croissants, then find the difference between these two totals.\n\nStep 1: Calculate the cost of 5 loaves of bread.\n5 loaves × €8 per loaf = €40\n\nStep 2: Calculate the cost of 3 croissants.\n3 croissants × €2 per croissant = €6\n\nStep 3: Find the difference between the two totals.\n€40 (bread) - €6 (croissants) = €34\n\nThe answer is €34."], "expected_answer": "34", "actual_answer": "34"}
{"question": "There are 6 periods in the day for a normal student but Jin has to take 2 extra classes. Each class is 35 minutes long. He goes to class for 6 days a week. He then spends one-eighth of his weekly minutes each on Saturday and Sunday as extra learning time. How many hours a week does he spend learning?", "index": 3925, "lines": ["Answer: \nThe next step is to calculate the total minutes Jin spends in classes each day, including the extra classes. \n\nStep-by-step explanation:\n1. Jin attends 6 periods plus 2 extra classes daily, totaling 8 classes.\n2. Each class is 35 minutes, so daily class time is 8 * 35 = 280 minutes.\n\nThe answer is 280 minutes per day."], "expected_answer": "35", "actual_answer": "280"}
{"question": "Deshawn is rolling a d12 die. How much more likely is it (expressed as a percentage) that he rolls a number greater than 3 than that he rolls two odd numbers in a row?", "index": 122, "lines": ["Answer: \nThe probability of rolling a number greater than 3 is 75%, and the probability of rolling two odd numbers in a row is 25%. The difference is 75% - 25% = 50%.\n\nThe answer is 50%"], "expected_answer": "50", "actual_answer": "50"}
{"question": "At Leon's house, there are ten times as many figs as plums. He has a total of 65 plums in his house. Leon bought 59 more plums at the store and 47 fewer figs than the number of plums. Find the combined total of the number of figs and plums Leon has in the house?", "index": 4584, "lines": ["Answer: \nStep 1: Calculate the number of figs Leon originally has.\n- Since there are ten times as many figs as plums and he has 65 plums, the number of figs is 10 * 65 = 650 figs.\n\nStep 2: Determine the number of plums after buying more.\n- Leon bought 59 more plums, so total plums = 65 + 59 = 124 plums.\n\nStep 3: Calculate the number of figs bought.\n- Leon bought 47 fewer figs than the number of plums. Since he has 124 plums, he bought 124 - 47 = 77 fewer figs.\n\nStep 4: Determine the new total number of figs.\n- Original figs: 650\n- Fewer figs bought: 77\n- Total figs after purchase: 650 - 77 = 573 figs.\n\nStep 5: Calculate the combined total of figs and plums.\n- Total figs: 573\n- Total plums: 124\n- Combined total: 573 + 124 = 697\n\nThe answer is 697."], "expected_answer": "786", "actual_answer": "697"}
{"question": "Luis works a 7-hour shift each day, 4 days a week. He earns ₺25 per hour and gets a ₺554 bonus each week if the company performs well. How much money did Luis make in March if the company performed very well for the whole month?", "index": 3002, "lines": ["Answer: \nLet's calculate the number of hours Luis works in a week:\n\n7 hours/day × 4 days = 28 hours\n\nThe answer is 28 hours."], "expected_answer": "5016", "actual_answer": "28"}
{"question": "If Luis and Amelia have 620 yards of fence between them, and they agree to split it with Amelia getting 60 yards more than Luis, how much is left over for Luis?", "index": 4266, "lines": ["Answer: \nStep 1: Let L represent the amount of fence Luis gets. Since Amelia gets 60 yards more than Luis, she gets L + 60 yards.\nStep 2: The total fence is the sum of what both get: L + (L + 60) = 620 yards.\nStep 3: Combine like terms: 2L + 60 = 620.\nStep 4: Subtract 60 from both sides: 2L = 560.\nStep 5: Divide both sides by 2: L = 280 yards.\n\nThe answer is 280 yards."], "expected_answer": "280", "actual_answer": "280"}
{"question": "At Pavel's house, there are seven times as many bananas as grapes. He has a total of 34 grapes in his house. Pavel bought 53 more grapes at the store and 35 fewer bananas than the number of grapes. Find the combined total of the number of bananas and grapes Pavel has in the house?", "index": 4555, "lines": ["Answer: \nThe next step is to calculate the total number of bananas after adding the newly purchased ones. Since Pavel bought 53 more grapes, he now has 34 + 53 = 87 grapes. He also bought 35 fewer bananas than the number of grapes he now has, which means he bought 87 - 35 = 52 bananas. Adding these to the original number of bananas: 238 + 52 = 290 bananas.\n\nThe answer is 377."], "expected_answer": "343", "actual_answer": "377"}
{"question": "Mia went to the beach for vacation. Her parents gave her ₣1200 to buy whatever she wanted. At the souvenir store, fudge was on sale for \"Buy 15 kilograms at ₣22 per kilogram, get 4 kilograms 1/4 off.\" She scooped up 22 kilograms. She also bought a mixed bag of sand dollars for ₣11.25 and 15 postcards that were ₣20.25 each. How much money does Mia have left?", "index": 2002, "lines": ["Answer: \nThe next step is to calculate the cost of the fudge:\n\nThe fudge deal is \"Buy 15 kg at ₣22/kg, get 4 kg 1/4 off.\"  \n- Cost for 15 kg: 15 × ₣22 = ₣330  \n- Discounted price for 4 kg: ₣22 - (1/4 × ₣22) = ₣16.5  \n- Cost for 4 kg: 4 × ₣16.5 = ₣66  \n- Total fudge cost: ₣330 + ₣66 = ₣396  \n\nThe answer is ₣396."], "expected_answer": "423", "actual_answer": "396"}
{"question": "A loaf of bread at the bakery costs ₺7. Bagels cost ₺4 each. How much more do 3 loaves of bread cost than 4 bagels?", "index": 1910, "lines": ["Answer: \nThe next step is to calculate the total cost for 3 loaves of bread and 4 bagels.  \n- Cost of 3 loaves: 3 × ₺7 = ₺21  \n- Cost of 4 bagels: 4 × ₺4 = ₺16  \nThe difference: ₺21 - ₺16 = ₺5  \n\nThe answer is ₺5."], "expected_answer": "5", "actual_answer": "5"}
{"question": "Olivia receives 172 emails a day. 25% of those emails don't require any response. Olivia responds to the rest of them. How many emails does Olivia respond to in a 3 day work week?", "index": 1365, "lines": ["Answer: \n**Step 1:** Calculate the number of emails that don't require a response by finding 25% of 172.\n\nNumber of non-response emails = 25% of 172 = 0.25 × 172 = 43 emails.\n\nThe answer is 43."], "expected_answer": "387", "actual_answer": "43"}
{"question": "Kai has ₺63.11 and wants to buy 51 anchors from a bin at the hardware store. Each anchor costs ₺0.61. How much money does Kai have left after paying for the anchors?", "index": 1510, "lines": ["Answer: \nStep: Calculate the total cost of 51 anchors by multiplying the number of anchors by the cost per anchor.\n\n51 × 0.61 = 31.11\n\nThe total cost for the anchors is ₺31.11. \n\nThe answer is 31.11."], "expected_answer": "32", "actual_answer": "31.11"}
{"question": "Ava operates the cash register exactly three times as fast as her less-experienced colleague Uma. Daily, Uma processes 61 customers. What is the total weekly production for the two if they work all days of the week?", "index": 4875, "lines": ["Round 0:\nAva processes 3 times as many customers as Uma. Since Uma processes 61 customers daily, Ava processes 3 * 61 = 183 customers daily. \n\nThe next step is to calculate the total daily production for both.", "Called LLM to parse answer, got The answer is 1708.", "Answer: \nAdd Ava's daily customers (183) to Uma's daily customers (61) to find their combined daily production: 183 + 61 = 244 customers per day.\n\nThe answer is 244 * 7 = 1708."], "expected_answer": "1708", "actual_answer": "1708"}
{"question": "When the water is cold James swims a mile in 26 minutes. When the water is warm James swims a mile in 5 minutes more than two times as long. How much longer does James take to swim 6 miles on a hot day than a cold day?", "index": 4663, "lines": ["Answer: \nThe next step is to calculate the total time James takes to swim 6 miles on both a cold day and a hot day, then find the difference.\n\nCold day: 6 miles × 26 minutes = 156 minutes  \nHot day: 6 miles × (2×26 + 5) minutes = 6 × 57 = 342 minutes  \nDifference: 342 minutes - 156 minutes = 186 minutes\n\nThe answer is 186."], "expected_answer": "186", "actual_answer": "186"}
{"question": "Noah caught 5 salmons last Monday, the first salmon he caught weighs 78 pounds, the second salmon he caught weighs 50 pounds, and the last salmon he caught weighs 25 pounds. If a pound of salmon costs ¥2.0, how much will he earn after selling all the salmons to the market?", "index": 3843, "lines": ["Answer: \nThe total weight of the salmons is 78 + 50 + 25 = 153 pounds. Multiplying by the price per pound: 153 × ¥2.0 = ¥306. The answer is ¥306."], "expected_answer": "406", "actual_answer": "306"}
{"question": "Kai caught 6 trouts last Monday, the first trout he caught weighs 75 kgs, the second trout he caught weighs 41 kgs, and the last trout he caught weighs 24 kgs. If a kg of trout costs ¥1.75, how much will he earn after selling all the trouts to the market?", "index": 3832, "lines": ["Called LLM to parse answer, got The answer is 245.", "Answer: \nThe next step is to sum the weights of the trouts:  \n75 kg + 41 kg + 24 kg = 140 kg  \n\nThe answer is ¥245 (140 kg × ¥1.75/kg)."], "expected_answer": "371", "actual_answer": "245"}
{"question": "When the water is cold Gabrielle swims a mile in 22 minutes. When the water is warm Gabrielle swims a mile in 6 minutes more than two times as long. How much longer does Gabrielle take to swim 6 miles on a hot day than a cold day?", "index": 4681, "lines": ["Answer: \nThe time to swim a mile in warm water is calculated as 2*22 + 6 = 50 minutes.  \nNext, calculate the total time for 6 miles on both days:  \nCold day: 6*22 = 132 minutes  \nHot day: 6*50 = 300 minutes  \nFind the difference: 300 - 132 = 168 minutes  \n\nThe answer is 168 minutes."], "expected_answer": "168", "actual_answer": "168"}
{"question": "Umar collects garbage from 3 different apartment complexes. The first 2 have 450 apartments each and the last one is 20% bigger than the other 2 combined. Umar collects garbage 2 times a week from each place and he gets paid ₣0.45 per collection for each apartment. How much money does he make in a week?", "index": 2450, "lines": ["Answer: \nThe third apartment complex has 20% more apartments than the combined total of the first two. The first two have 450 each, totaling 900. Increasing this by 20% gives 900 * 1.2 = 1080 apartments. \n\nNext step: Calculate Umar's weekly earnings by multiplying the number of apartments by the payment per collection and the number of collections per week. \n\nThe answer is 1782."], "expected_answer": "1782", "actual_answer": "1782"}
{"question": "At Qasim's house, there are ten times as many bananas as pears. He has a total of 88 pears in his house. Qasim bought 77 more pears at the store and 44 fewer bananas than the number of pears. Find the combined total of the number of bananas and pears Qasim has in the house?", "index": 4581, "lines": ["Answer: \nThe next step is to calculate the total number of bananas after purchasing more. Since Qasim bought 44 fewer bananas than the number of pears he currently has, and he has 165 pears, the number of bananas bought is 165 - 44 = 121. Therefore, the total number of bananas is the initial bananas (880) plus the newly purchased bananas (121), which equals 1001 bananas.\n\nThe answer is 1166."], "expected_answer": "1078", "actual_answer": "1166"}
{"question": "Nadia can run six times faster than she can walk, but she can skip at a rate of speed that is 1/3 as fast as she can run. If she can skip at 4 miles per hour, how many miles can she travel in 4 hours if she spends two-fourths of the time running and 2/4 of the time walking?", "index": 4434, "lines": ["Answer: \nNadia skips at 4 mph, which is 1/3 of her running speed. To find her running speed, multiply 4 mph by 3:  \nRunning speed = 4 * 3 = 12 mph.  \n\nWalking speed is 1/6 of running speed:  \nWalking speed = 12 / 6 = 2 mph.  \n\nShe spends half the time running and half walking in 4 hours:  \nRunning time = 2 hours, Walking time = 2 hours.  \n\nDistance running: 12 mph * 2 hours = 24 miles.  \nDistance walking: 2 mph * 2 hours = 4 miles.  \n\nTotal distance: 24 + 4 = 28 miles.  \n\nThe answer is 28 miles."], "expected_answer": "28", "actual_answer": "28"}
{"question": "Mia is popping popcorn for a snack. As the pot of kernels heats up, the kernels start popping faster. 10 pop in the first 16 seconds of cooking, then 2 times that amount in the next 16 seconds. The kernels increase to 4 times the initial popping rate in the next 16 seconds, but in the final 16 seconds, the popping slows down to half the rate as the past 16 seconds. After Mia takes the pot off the heat, a quarter of the number of kernels that popped in the final 16 seconds of cooking also pop from the residual heat. How many pieces of popcorn does Mia have to eat?", "index": 248, "lines": ["Answer: \nThe total number of popped kernels during cooking is 10 + 20 + 40 + 20 = 90. After cooking, an additional 1/4 of the final 16 seconds' amount (20 × 1/4 = 5) pops from residual heat. Adding these gives 90 + 5 = 95.\n\nThe answer is 95."], "expected_answer": "95", "actual_answer": "95"}
{"question": "A new virus infects 18 people. Every day, each infected person infects 4 others. How many people are infected after 3 days?", "index": 4936, "lines": ["Answer: \nTo determine the number of people infected after each day, we'll calculate the new infections each day and add them to the total.\n\nStep 1: Calculate the number of infections on Day 1.\nInfections on Day 1 = Initial infections * 4 = 18 * 4 = 72\n\nStep 2: Calculate the number of infections on Day 2.\nInfections on Day 2 = Infections on Day 1 * 4 = 72 * 4 = 288\n\nStep 3: Calculate the number of infections on Day 3.\nInfections on Day 3 = Infections on Day 2 * 4 = 288 * 4 = 1152\n\nStep 4: Sum all infections including the initial 18.\nTotal infections = 18 + 72 + 288 + 1152 = 1530\n\nThe answer is 1530."], "expected_answer": "2250", "actual_answer": "1530"}
{"question": "To make a call from a hotel room phone, you must pay €0.7 for each minute of your call. After 10 minutes, that price drops to €0.2 per minute. How much would a 60-minute call cost?", "index": 537, "lines": ["Called LLM to parse answer, got The answer is 17.00", "Round 0:\nThe next step is to calculate the cost for the first 10 minutes and the remaining 50 minutes separately.  \n- First 10 minutes: 10 × €0.7 = €7.00  \n- Remaining 50 minutes: 50 × €0.2 = €10.00  \nTotal cost: €7.00 + €10.00 = €17.00  \n\nThe answer is €17.00", "Called LLM to parse answer, got The answer is 17.", "Answer: \nThe next step is to calculate the cost for the first 10 minutes and the remaining 50 minutes separately.  \n- First 10 minutes: 10 × €0.7 = €7.00  \n- Remaining 50 minutes: 50 × €0.2 = €10.00  \nTotal cost: €7.00 + €10.00 = €17.00  \n\nThe answer is €17.00"], "expected_answer": "17", "actual_answer": "17"}
{"question": "Kai's car breaks down. The car weighs 1450 pounds and he has luggage in it weighing 325 pounds. He also has his 3 young children who weigh 75 pounds each in it. If the force to move the car is 1% of the weight, how much force does he need to push the car?", "index": 3398, "lines": ["Answer: \nThe total weight is 2000 pounds. The force needed is 1% of this weight, calculated as 2000 * 0.01 = 20 pounds. \n\nThe answer is 20 pounds."], "expected_answer": "20", "actual_answer": "20"}
{"question": "Gabrielle walks 35 miles every day on her favorite walking trail, which includes 19 miles of walking on the beach and 16 miles of walking on the sidewalk. On the sidewalk, Gabrielle walks at two times the rate of speed that she does on the beach. If 57 minutes of her walk is spent on the beach, how long does it take for her to complete the entire 35-mile walk, in minutes?", "index": 853, "lines": ["Answer: \nFirst, calculate Gabrielle's walking speed on the beach using the formula: speed = distance / time. She walks 19 miles on the beach in 57 minutes, so her beach speed is 19/57 miles per minute.\n\nStep 1: Beach speed = 19 / 57 ≈ 0.333 miles per minute.\n\nNow, since Gabrielle walks twice as fast on the sidewalk, her sidewalk speed is 2 * 0.333 ≈ 0.666 miles per minute.\n\nStep 2: Sidewalk speed = 2 * (19 / 57) ≈ 0.666 miles per minute.\n\nNext, calculate the time taken to walk 16 miles on the sidewalk using the formula: time = distance / speed.\n\nStep 3: Sidewalk time = 16 / 0.666 ≈ 24 minutes.\n\nFinally, add the beach time (57 minutes) and sidewalk time (24 minutes) to find the total walking time.\n\nStep 4: Total time = 57 + 24 = 81 minutes.\n\nThe answer is 81 minutes."], "expected_answer": "81", "actual_answer": "81"}
{"question": "Leilani operates the cash register exactly eight times as fast as her less-experienced colleague Chen. Daily, Chen processes 68 customers. What is the total weekly production for the two if they work all days of the week?", "index": 4857, "lines": ["Answer: \nLeilani processes 8 times as many customers as Chen daily. Since Chen processes 68 customers, Leilani processes 8 * 68 = 544 customers daily. Combined, they process 68 + 544 = 612 customers daily. Over a week, they process 612 * 7 = 4284 customers. The answer is 4284."], "expected_answer": "4284", "actual_answer": "4284"}
{"question": "If Diego eats 3 eggs a day for 74 days and then increases it to 6 eggs a day for 93 days, how many dozens of eggs will Diego need for 167 days?", "index": 4977, "lines": ["Answer: \nFirst, calculate the total number of eggs Diego eats in the first 74 days by multiplying 3 eggs/day by 74 days:  \n3 eggs/day × 74 days = 222 eggs.\n\nNext, calculate the total number of eggs Diego eats in the next 93 days by multiplying 6 eggs/day by 93 days:  \n6 eggs/day × 93 days = 558 eggs.\n\nThen, add both amounts to find the total number of eggs eaten over 167 days:  \n222 eggs + 558 eggs = 780 eggs.\n\nFinally, convert the total number of eggs into dozens by dividing by 12:  \n780 eggs ÷ 12 eggs/dozen = 65 dozens.\n\nThe answer is 65 dozens."], "expected_answer": "65", "actual_answer": "65"}
{"question": "Viktor has 25 hectares of plum field. There are 71 plums per hectare. Viktor can harvest his plums every 12 months. How many plums can Viktor harvest within a year?", "index": 330, "lines": ["Answer: \nNext step: Multiply the number of hectares (25) by the number of plums per hectare (71) to find the total plums harvested.  \nCalculation: 25 × 71 = 1,775  \nThe answer is 1775."], "expected_answer": "1775", "actual_answer": "1775"}
{"question": "Isabella was preparing for a game night at her house, where she intended to serve grilled salmon. She noticed that she was out of plastic spoons, so she bought a new package of spoons. Later, her husband also bought a package of 16 new spoons and gave them to Isabella. While Isabella was making the grilled salmon, she used five of the spoons to sample her grilled salmon. Later, when she went to set the table, she had a total of 23 spoons. How many spoons were in the package that Isabella bought?", "index": 1115, "lines": ["Answer: \nIsabella bought a package with x spoons. Her husband added 16 spoons, making the total x + 16. She used 5, leaving x + 11. She had 23 left, so x + 11 = 23. Subtract 11 from both sides to find x.\n\nThe answer is 12 spoons."], "expected_answer": "12", "actual_answer": "12"}
{"question": "Wei is rolling a 6-sided die. How much more likely is it (expressed as a percentage) that he rolls a number greater than 3 than that he rolls two even numbers in a row?", "index": 110, "lines": ["Answer: \nThe probability of rolling a number greater than 3 is 3/6 = 1/2. The probability of rolling two even numbers in a row is (3/6) * (3/6) = 1/4. To find how much more likely the first event is compared to the second, divide the two probabilities: (1/2) / (1/4) = 2. Converting this to a percentage: 2 * 100% = 200%.\n\nThe answer is 200% more likely."], "expected_answer": "25", "actual_answer": "200"}
{"question": "Esteban wants to make different sized ice cubes with 334 ounces of water. He can make giant cubes that use 12 ounces per cube, medium cubes that use 11 ounces, and small cubes that use 1/3 of ounce. If he makes 10 giant cubes, 15 small cubes, and 13 medium cubes, how many ounces of water does he have left?", "index": 554, "lines": ["Called LLM to parse answer, got The answer is 44.6667.", "Answer: \nEsteban uses a total of 289 1/3 ounces of water. Subtracting this from the initial 334 ounces:\n\n334 - 289 1/3 = 44 2/3 ounces.\n\nThe answer is 44 2/3 ounces."], "expected_answer": "66", "actual_answer": "44.6667"}
{"question": "Ravi places almonds on some tables. Each table can hold 37 almonds. If he has 328 almonds and 7 tables, how many almonds won't he be able to place on the table?", "index": 604, "lines": ["Answer: \nThe next step is to calculate the total number of almonds that can be placed on all 7 tables by multiplying the number of tables by the capacity of each table. \n\nStep: Multiply 7 tables by 37 almonds per table: 7 × 37 = 259 almonds.\n\nThe answer is 69 almonds won't be placed."], "expected_answer": "69", "actual_answer": "69"}
{"question": "Esteban collects garbage from 3 different apartment complexes. The first 2 have 100 apartments each and the last one is 50% bigger than the other 2 combined. Esteban collects garbage 2 times a week from each place and he gets paid ₣0.4 per collection for each apartment. How much money does he make in a week?", "index": 2455, "lines": ["Answer: \nThe third apartment complex has 300 apartments because it is 50% larger than the combined 200 apartments of the first two complexes (200 * 1.5 = 300).  \n\nThe next step is to calculate the total number of collections Esteban makes in a week:  \nNumber of collections = (2 complexes * 100 apartments) + 300 apartments = 500 apartments.  \n\nSince he collects twice a week from each apartment, the total collections per week are:  \n500 apartments * 2 collections = 1000 collections.  \n\nHis earnings are:  \n1000 collections * ₣0.4 per collection = ₣400.  \n\nThe answer is 400."], "expected_answer": "400", "actual_answer": "400"}
{"question": "Yuki caught 6 steelheads last Wednesday, the first steelhead he caught weighs 68 kilograms, the second steelhead he caught weighs 53 kilograms, and the last steelhead he caught weighs 27 kilograms. If a kilogram of steelhead costs €1.0, how much will he earn after selling all the steelheads to the market?", "index": 3820, "lines": ["Answer: \nThe next step is to add the weights of the steelheads to find the total weight. \n\nStep-by-step explanation:\n\n1. Add the weights of the steelheads: 68 kg + 53 kg + 27 kg = 148 kg.\n\nThe answer is 148."], "expected_answer": "229", "actual_answer": "148"}
{"question": "Sakura walks 25 kilometers every day on her favorite walking trail, which includes 13 kilometers of walking on the beach and 12 kilometers of walking on the sidewalk. On the sidewalk, Sakura walks at three times the rate of speed that she does on the beach. If 65 minutes of her walk is spent on the beach, how long does it take for her to complete the entire 25-kilometer walk, in minutes?", "index": 888, "lines": ["Answer: \nSakura's walking speed on the beach is calculated by dividing the beach distance by the beach time. Given she walks 13 km in 65 minutes, her beach speed is 12 km/h. On the sidewalk, her speed is three times faster, so 36 km/h. To find the sidewalk time, divide 12 km by 36 km/h, resulting in 20 minutes. Adding the 65 minutes on the beach gives a total walking time of 85 minutes.\n\nThe answer is 85 minutes."], "expected_answer": "85", "actual_answer": "85"}
{"question": "Oliver caught 7 trouts last Thursday, the first trout he caught weighs 58 pounds, the second trout he caught weighs 40 pounds, and the last trout he caught weighs 28 pounds. If a pound of trout costs ₺0.5, how much will he earn after selling all the trouts to the market?", "index": 3815, "lines": ["Answer: \n**Step 1:** Calculate the total weight of the trout caught by adding the weights of each trout:  \n58 pounds (first trout) + 40 pounds (second trout) + 28 pounds (last trout) = 126 pounds.\n\n**Step 2:** Determine the total earnings by multiplying the total weight by the cost per pound:  \n126 pounds × ₺0.5 per pound = ₺63.\n\n**Final Answer:** The answer is 63."], "expected_answer": "119", "actual_answer": "63"}
{"question": "If Gabriel and Oscar have 580 yards of fence between them, and they agree to split it with Oscar getting 190 yards more than Gabriel, how much is left over for Gabriel?", "index": 4253, "lines": ["Answer: \nThe next step is to subtract 190 from both sides of the equation to isolate the term with G. This gives:\n\n2G = 580 - 190  \n2G = 390  \n\nThen, divide both sides by 2 to solve for G:  \nG = 390 / 2  \nG = 195  \n\nSo, Gabriel gets 195 yards.  \nThe answer is 195."], "expected_answer": "195", "actual_answer": "195"}
{"question": "Luca collects garbage from 3 different apartment complexes. The first 2 have 450 apartments each and the last one is 80% bigger than the other 2 combined. Luca collects garbage 2 times a week from each place and he gets paid ₣0.35 per collection for each apartment. How much money does he make in a week?", "index": 2494, "lines": ["Answer: \nThe third apartment complex has 1,620 apartments. To find the total number of apartments across all complexes:  \n450 (first) + 450 (second) + 1,620 (third) = **2,520 apartments**.  \n\nThe next step is to calculate the total number of collections Luca makes in a week:  \n2 collections/week * 2,520 apartments = **5,040 collections**.  \n\nFinally, multiply the number of collections by the payment per collection:  \n5,040 collections * ₣0.35/collection = **₱1,764**.  \n\nThe answer is ₱1,764."], "expected_answer": "1764", "actual_answer": "1764"}
{"question": "A fog bank rolls in from the ocean to cover a city. It takes 63 minutes to cover every 13 miles of the city. If the city is 39 miles across from the oceanfront to the opposite inland edge, how many minutes will it take for the fog bank to cover the whole city?", "index": 52, "lines": ["Answer: \nThe fog covers 13 miles in 63 minutes. To cover 39 miles, calculate the number of 13-mile segments in 39 miles: 39 ÷ 13 = 3. Multiply the time by the number of segments: 63 × 3 = 189 minutes.\n\nThe answer is 189 minutes."], "expected_answer": "189", "actual_answer": "189"}
{"question": "Xena can run ten times faster than she can walk, but she can skip at a rate of speed that is four-fifths as fast as she can run. If she can skip at 8 miles per hour, how many miles can she travel in 6 hours if she spends 1/3 of the time running and four-sixths of the time walking?", "index": 4417, "lines": ["Answer: \nThe next step is to calculate the time Xena spends running and walking. \n\nRunning time: (1/3) * 6 hours = 2 hours.\nWalking time: (4/6) * 6 hours = 4 hours.\n\nCalculating distances:\n- Running distance: 10 mph * 2 hours = 20 miles.\n- Walking distance: 1 mph * 4 hours = 4 miles.\n\nTotal distance: 20 + 4 = 24 miles.\n\nThe answer is 24."], "expected_answer": "24", "actual_answer": "24"}
{"question": "There are 6 periods in the day for a normal student but Sanjay has to take 3 extra classes. Each class is 35 minutes long. He goes to class for 6 days a week. He then spends 2/4 of his weekly minutes each on Saturday and Sunday as extra learning time. How many hours a week does he spend learning?", "index": 3941, "lines": ["Answer: \nThe next step is to calculate the time Sanjay spends on weekends. He spends 2/4 of his weekly minutes each day, which is 2/4 * 630 = 315 minutes per day. For two days, that's 315 * 2 = 630 minutes. Adding this to his 630 minutes of extra classes gives a total of 1260 minutes. Converting to hours: 1260 / 60 = 21 hours. \n\nThe answer is 21 hours."], "expected_answer": "63", "actual_answer": "21"}
{"question": "To make a call from a hotel room phone, you must pay ¥0.5 for each minute of your call. After 30 minutes, that price drops to ¥0.4 per minute. How much would a 65-minute call cost?", "index": 516, "lines": ["Answer: \nLet's break down the call duration into two parts: the first 30 minutes and the remaining minutes.\n\n1. **Cost for the first 30 minutes:**\n   - Rate: ¥0.5 per minute\n   - Duration: 30 minutes\n   - Cost = 30 minutes × ¥0.5 = ¥15\n\n2. **Cost for the remaining 35 minutes (65 total - 30 minutes):**\n   - Rate: ¥0.4 per minute\n   - Duration: 35 minutes\n   - Cost = 35 minutes × ¥0.4 = ¥14\n\n3. **Total cost:**\n   - Total Cost = ¥15 + ¥14 = ¥29\n\nThe answer is ¥29."], "expected_answer": "29", "actual_answer": "29"}
{"question": "Dr. Martinez sold his cottage for $680000. He paid the legal fees that amount to 3% of the selling price and also paid a realtor fee that is 2% of the selling price. If he also paid $500000 for the remaining loan amount of the cottage, how much is Dr. Martinez's net proceeds from selling the cottage?", "index": 1713, "lines": ["Answer: \nThe legal fees are 3% of $680,000: 0.03 × 680,000 = $20,400.  \nThe realtor fee is 2% of $680,000: 0.02 × 680,000 = $13,600.  \nTotal fees: $20,400 + $13,600 = $34,000.  \nLoan repayment: $500,000.  \nTotal expenses: $34,000 + $500,000 = $534,000.  \nNet proceeds: $680,000 - $534,000 = $146,000.  \n\nThe answer is 146000."], "expected_answer": "146000", "actual_answer": "146000"}
{"question": "There are 9 periods in the day for a normal student but Arash has to take 3 extra classes. Each class is 45 minutes long. He goes to class for 6 days a week. He then spends one-sixth of his weekly minutes each on Saturday and Sunday as extra learning time. How many hours a week does he spend learning?", "index": 3921, "lines": ["Answer: \nHe has 12 classes per day (9 regular + 3 extra), each lasting 45 minutes. Therefore, he spends 12 × 45 = 540 minutes daily. Over 6 days, this totals 540 × 6 = 3,240 minutes. \n\nThe next step is to calculate his extra learning time on weekends and add it to his weekly total.\n\nThe total weekly learning time is 3,240 + (3,240 ÷ 6 × 2) = 3,240 + 1,080 = 4,320 minutes. Converting to hours: 4,320 ÷ 60 = 72 hours.\n\nThe answer is 72 hours."], "expected_answer": "72", "actual_answer": "72"}
{"question": "At Leon's house, there are ten times as many apples as bananas. He has a total of 93 bananas in his house. Leon bought 42 more bananas at the store and 25 fewer apples than the number of bananas. Find the combined total of the number of apples and bananas Leon has in the house?", "index": 4592, "lines": ["Answer: \nFirst, calculate the initial number of apples as ten times the number of bananas: 10 × 93 = 930 apples. Then, add the 42 bananas bought: 93 + 42 = 135 bananas. Next, determine the number of apples bought, which is 25 fewer than the current number of bananas: 135 - 25 = 110 apples. Add these to the existing apples: 930 + 110 = 1040 apples. Finally, combine the total number of apples and bananas: 1040 + 135 = 1175.\n\nThe answer is 1175."], "expected_answer": "1082", "actual_answer": "1175"}
{"question": "A cleaner has to clean a hospital with 140 floors. They have 10 days to get it done. It takes them 30 minutes per floor. If they work 10 hours each day, what percentage of their day, on average, is spent cleaning floors?", "index": 1990, "lines": ["Answer: \nThe total time needed to clean all floors is 140 floors * 30 minutes per floor = 4200 minutes. Converting to hours: 4200 minutes ÷ 60 = 70 hours. The total available work time is 10 days * 10 hours/day = 100 hours. The percentage of time spent cleaning is (70 hours / 100 hours) * 100% = 70%.\n\nThe answer is 70%"], "expected_answer": "70", "actual_answer": "70"}
{"question": "There are 7 periods in the day for a normal student but Sanjay has to take 1 extra classes. Each class is 45 minutes long. He goes to class for 4 days a week. He then spends two-fourths of his weekly minutes each on Saturday and Sunday as extra learning time. How many hours a week does he spend learning?", "index": 3923, "lines": ["Answer: \nNext step: Calculate the total in-class time for 4 days.\n\nEach day has 8 classes (7 periods + 1 extra), each 45 minutes long.  \nTotal daily class time = 8 × 45 = 360 minutes.  \nFor 4 days, total in-class time = 4 × 360 = 1,440 minutes.\n\nThe answer is 1,440 [minutes]."], "expected_answer": "48", "actual_answer": "1440"}
{"question": "Gabriel caught 5 trouts last Friday, the first trout he caught weighs 43 kilograms, the second trout he caught weighs 45 kilograms, and the last trout he caught weighs 28 kilograms. If a kilogram of trout costs ¥0.5, how much will he earn after selling all the trouts to the market?", "index": 3848, "lines": ["Answer: \nStep: Calculate the total weight of all trouts caught.\n\nThe total weight is 43 kg + 45 kg + 28 kg = 116 kg.\n\nStep explanation: Adding the weights of each trout gives the total weight, which is necessary to determine the total earnings.\n\nThe answer is ¥58."], "expected_answer": "86", "actual_answer": "58"}
{"question": "According to its nutritional info, a bag of cookies has 150 calories per serving. If a 200 oz bag has 5 servings, how many oz can you eat if your daily calorie target is 2300 and you have already consumed 800 calories?", "index": 1228, "lines": ["Answer: \nEach serving is 40 oz, and each oz has 3.75 calories. You have 1500 calories left. Divide 1500 by 3.75 to find the ounces you can eat. \n\nThe answer is 400 oz."], "expected_answer": "400", "actual_answer": "400"}
{"question": "One miner can mine 5 pounds of ore per day with bare hands. He can mine two times as much with a nickel pickaxe and 30% more with a steel pickaxe than with a nickel pickaxe. How many pounds of ore can 21 miners with steel pickaxes mine in a month with 28 days?", "index": 2910, "lines": ["Answer: \nThe next step is to calculate the total ore mined by 21 miners with steel pickaxes in 28 days. First, determine the ore mined per miner per day with a steel pickaxe: 5 * 2 * 1.3 = 13 pounds. Multiply this by 21 miners and 28 days: 13 * 21 * 28 = 7644 pounds.\n\nThe answer is 7644 pounds."], "expected_answer": "7644", "actual_answer": "7644"}
{"question": "Kai caught 4 trouts last Monday, the first trout he caught weighs 46 kgs, the second trout he caught weighs 30 kgs, and the last trout he caught weighs 32 kgs. If a kg of trout costs ₺0.25, how much will he earn after selling all the trouts to the market?", "index": 3817, "lines": ["Round 0:\nThe next step is to add up the weights of all the trouts to find the total weight.  \nTotal weight = 46 kg + 30 kg + 32 kg + (unknown weight of the third trout).  \nHowever, since the weight of the third trout is not provided, the problem cannot be solved as is.  \n\nThe answer cannot be determined with the given information.", "Round 1:\nThe problem lacks the weight of the fourth trout, making it impossible to calculate the total weight and subsequent earnings. \n\nThe answer cannot be determined with the given information.", "Round 2:\nThe answer cannot be determined with the given information.", "Round 3:\nThe next step is to recognize that the problem lacks the weight of the fourth trout, making it impossible to calculate the total weight and subsequent earnings.  \n\nThe answer cannot be determined with the given information.", "Round 4:\nThe problem lacks the weight of the fourth trout, making it impossible to calculate the total weight and subsequent earnings. \n\nThe answer cannot be determined with the given information.", "Round 5:\nThe problem cannot be solved because the weight of the fourth trout is missing. Without this information, the total weight cannot be calculated, making it impossible to determine Kai's earnings.\n\nThe answer cannot be determined with the given information.", "Round 6:\nThe next step is to recognize that the problem lacks the weight of the third trout, making it impossible to calculate the total weight and subsequent earnings.\n\nThe answer cannot be determined with the given information.", "Round 7:\nThe next step is to recognize that the problem lacks the weight of the fourth trout, making it impossible to calculate the total weight and subsequent earnings.\n\nThe answer cannot be determined with the given information.", "Round 8:\nThe next step is to recognize that the problem lacks the weight of the fourth trout, making it impossible to calculate the total weight and subsequent earnings.  \n\nThe answer cannot be determined with the given information.", "Round 9:\nThe problem lacks the weight of the third trout, making it impossible to calculate the total weight and subsequent earnings.\n\nThe answer cannot be determined with the given information.", "Round 10:\nThe next step is to recognize that the problem lacks the weight of the fourth trout, making it impossible to calculate the total weight and subsequent earnings.\n\nThe answer cannot be determined with the given information.", "Round 11:\nThe next step is to recognize that the problem lacks the weight of the fourth trout, making it impossible to calculate the total weight and subsequent earnings.  \n\nThe answer cannot be determined with the given information.", "Round 12:\nThe problem lacks the weight of the fourth trout, making it impossible to calculate the total weight and subsequent earnings.  \n\nThe answer cannot be determined with the given information.", "Round 13:\nThe next step is to recognize that the problem lacks the weight of the fourth trout, making it impossible to calculate the total weight and subsequent earnings.  \n\nThe answer cannot be determined with the given information.", "Round 14:\nThe next step is to recognize that the problem lacks the weight of the fourth trout, making it impossible to calculate the total weight and subsequent earnings.\n\nThe answer cannot be determined with the given information.", "Round 15:\nThe answer cannot be determined with the given information.", "Round 16:\nThe next step is to recognize that the problem lacks the weight of the third trout, making it impossible to calculate the total weight and subsequent earnings.  \n\nThe answer cannot be determined with the given information.", "Round 17:\nThe next step is to recognize that the problem lacks the weight of the fourth trout, making it impossible to calculate the total weight and subsequent earnings.  \n\nThe answer cannot be determined with the given information.", "Round 18:\nThe problem lacks the weight of the third trout, making it impossible to calculate the total weight and subsequent earnings.  \n\nThe answer cannot be determined with the given information.", "Round 19:\nThe answer cannot be determined with the given information.", "Answer: None"], "expected_answer": "35", "actual_answer": null}
{"question": "Elena has €72.2 and wants to buy 42 nails from a bin at the home improvement store. Each nail costs €0.1. How much money does Elena have left after paying for the nails?", "index": 1529, "lines": ["Answer: \nStep 1: Calculate the total cost of 42 nails.  \nTotal cost = 42 nails × €0.1 per nail = €4.2.  \n\nStep 2: Subtract the total cost from Elena's initial amount.  \nMoney left = €72.2 - €4.2 = €68.0.  \n\nThe answer is €68.0."], "expected_answer": "68", "actual_answer": "68"}
{"question": "A maintenance worker has to clean a university with 130 rooms. They have 5 days to get it done. It takes them 15 minutes per room. If they work 13 hours each day, what percentage of their day, on average, is spent cleaning rooms?", "index": 1977, "lines": ["Answer: \nThe worker needs to clean 130 rooms over 5 days. Each day, they clean 130/5 = 26 rooms. \n\nTotal time spent cleaning per day = 26 rooms * 15 minutes/room = 390 minutes. \n\nPercentage of the day spent cleaning = (390 minutes / 780 minutes) * 100 = 50%. \n\nThe answer is 50%"], "expected_answer": "50", "actual_answer": "50"}
{"question": "Oakwood High School is holding graduation in their Auditorium this year which has space for 7800 people. After accounting for 1100 seats for graduates and 100 seats for faculty attending, how many tickets would each graduate receive to give to their friends and family if the tickets are split equally?", "index": 2324, "lines": ["Answer: \nThe next step is to calculate the remaining seats after subtracting the reserved seats for graduates and faculty. Subtract 1100 (graduates) and 100 (faculty) from the total capacity of 7800: 7800 - 1100 - 100 = 6600 seats left for friends and family.\n\nThe answer is 6600."], "expected_answer": "6", "actual_answer": "6600"}
{"question": "Camila sliced a whole kiwi into 32 pieces. She ate 3 slices, her sister ate 7 more than her, and her friend ate 9 more than her sister. How many slices of kiwi did they all eat?", "index": 2737, "lines": ["Answer: \nCamila ate 3 slices, her sister ate 3 + 7 = 10 slices, and her friend ate 10 + 9 = 19 slices. To find the total slices eaten, add them together: 3 + 10 + 19 = 32. \n\nThe answer is 32."], "expected_answer": "32", "actual_answer": "32"}
{"question": "There are 8 periods in the day for a normal student but Gabriel has to take 1 extra classes. Each class is 50 minutes long. He goes to class for 5 days a week. He then spends five-sixths of his weekly minutes each on Saturday and Sunday as extra learning time. How many hours a week does he spend learning?", "index": 3904, "lines": ["Answer: \nStep 1: Calculate the total number of periods Gabriel attends in a week.  \nHe has 8 regular periods + 1 extra class = 9 periods per day.  \nTotal periods in a week = 9 periods/day × 5 days = 45 periods.  \n\nThe answer is 45 periods.  \n\nStep 2: Convert the total number of periods to minutes.  \nEach class is 50 minutes long.  \nTotal minutes in a week = 45 periods × 50 minutes/period = 2250 minutes.  \n\nThe answer is 2250 minutes.  \n\nStep 3: Calculate the extra learning time Gabriel spends on weekends.  \nHe spends five-sixths of his weekly minutes each on Saturday and Sunday.  \nExtra learning time per weekend day = (5/6) × 2250 minutes = 1875 minutes.  \n\nThe answer is 1875 minutes per day.  \n\nStep 4: Calculate the total extra learning time over the weekend.  \nTotal extra learning time = 1875 minutes/day × 2 days = 3750 minutes.  \n\nThe answer is 3750 minutes.  \n\nStep 5: Calculate the total time Gabriel spends learning in a week.  \nTotal learning time = Time in classes + Extra learning time  \nTotal learning time = 2250 minutes + 3750 minutes = 6000 minutes.  \n\nThe answer is 6000 minutes.  \n\nStep 6: Convert the total learning time from minutes to hours.  \nTotal learning time in hours = 6000 minutes ÷ 60 minutes/hour = 100 hours.  \n\nThe answer is 100 hours."], "expected_answer": "100", "actual_answer": "100"}
{"question": "Bodhi collects garbage from 3 different apartment complexes. The first 2 have 200 apartments each and the last one is 60% bigger than the other 2 combined. Bodhi collects garbage 2 times a week from each place and he gets paid ¥0.3 per collection for each apartment. How much money does he make in a week?", "index": 2451, "lines": ["Answer: \nThe next step is to calculate the total number of apartments across all three complexes.\n\nTotal apartments = 200 (first complex) + 200 (second complex) + 640 (third complex) = 1040 apartments.\n\nThe answer is ¥624."], "expected_answer": "624", "actual_answer": "624"}
{"question": "Winnie went to the cafe and bought various types of treats. She bought 2 dozen danishes which cost $20 per dozen, 9 dozen tarts which cost $88 per dozen, and 8 dozen scones for $118 per dozen. How much was the total cost?", "index": 1831, "lines": ["Called LLM to parse answer, got The answer is 1776.", "Answer: \nThe next step is to calculate the cost for each item by multiplying the quantity (in dozens) by the price per dozen.\n\n1. Cost of danishes: 2 dozen × $20/dozen = $40  \n2. Cost of tarts: 9 dozen × $88/dozen = $792  \n3. Cost of scones: 8 dozen × $118/dozen = $944  \n\nThe answer is $40 + $792 + $944 = $1,776."], "expected_answer": "1776", "actual_answer": "1776"}
{"question": "Andre caught 6 cods last Sunday, the first cod he caught weighs 54 kgs, the second cod he caught weighs 46 kgs, and the last cod he caught weighs 23 kgs. If a kg of cod costs €2.0, how much will he earn after selling all the cods to the market?", "index": 3801, "lines": ["Answer: \nNext step: Sum the weights of all the cods caught by Andre.\n\nThe total weight is 54 kgs + 46 kgs + 23 kgs = 123 kgs.\n\nThe answer is 123."], "expected_answer": "384", "actual_answer": "123"}
{"question": "Faisal wants to make different sized ice cubes with 346 grams of water. He can make giant cubes that use 13 grams per cube, medium cubes that use 12 grams, and small cubes that use 2/3 of gram. If he makes 8 giant cubes, 15 small cubes, and 14 medium cubes, how many grams of water does he have left?", "index": 594, "lines": ["Answer: \nThe next step is to calculate the total water used by adding the water used for each type of cube.\n\n1. Giant cubes: 8 × 13 = 104 grams\n2. Medium cubes: 14 × 12 = 168 grams\n3. Small cubes: 15 × (2/3) = 10 grams\n\nTotal water used = 104 + 168 + 10 = 282 grams\n\nSubtract this from the initial amount:\n\n346 - 282 = 64 grams\n\nThe answer is 64 grams."], "expected_answer": "64", "actual_answer": "64"}
{"question": "The biggest waterslide at Aqua Adventure is 320 meters long, and people slide down at 40 meters/minute. The second biggest waterslide is 240 meters long, but steeper, so people slide down at 60 meters/minute. How much longer does it take to ride the biggest slide compared to the second biggest slide?", "index": 4393, "lines": ["Answer: \nTo find the time difference, calculate each slide's duration using Time = Distance / Speed. \n\nFor the biggest slide: 320 / 40 = 8 minutes.  \nFor the second slide: 240 / 60 = 4 minutes.  \n\nThe difference is 8 - 4 = 4 minutes.  \nThe answer is 4 minutes."], "expected_answer": "4", "actual_answer": "4"}
{"question": "Leilani and Pavel have 136 minutes to walk to the park together. It takes them 17 minutes to get to the corner where the library is. It takes them another 57 minutes to get to the mall. How much longer do they have to get to park without being late?", "index": 736, "lines": ["Answer: \nThey have already spent 17 + 57 = 74 minutes.  \nSubtract this from the total time: 136 - 74 = 62 minutes.  \n\nThe answer is 62 minutes."], "expected_answer": "62", "actual_answer": "62"}
{"question": "On Thursday, Carlos wants to exercise for four times the amount of time he did on Wednesday and Tuesday combined. On Tuesday he exercised for 52 minutes. On Wednesday he exercised for 30 minutes. How many minutes does he have to exercise on Thursday to reach his goal?", "index": 3478, "lines": ["Answer: \nTo find the total exercise time Carlos needs on Thursday, add Tuesday's and Wednesday's exercise times:\n\n52 minutes (Tuesday) + 30 minutes (Wednesday) = **82 minutes** combined.\n\nThe answer is 4 times this combined amount: 4 × 82 minutes = 328 minutes.\n\nThe answer is 328 minutes."], "expected_answer": "328", "actual_answer": "328"}
{"question": "Gabriel's van breaks down. The van weighs 1150 kilograms and he has groceries in it weighing 450 kilograms. He also has his 4 young friends who weigh 95 kilograms each in it. If the force to move the van is 5% of the weight, how much force does he need to push the van?", "index": 3387, "lines": ["Answer: \nThe next step is to calculate the total weight of the van, groceries, and passengers.  \nTotal weight = weight of van + weight of groceries + weight of friends.  \nTotal weight = 1150 kg + 450 kg + (4 × 95 kg) = 1150 kg + 450 kg + 380 kg = 1980 kg.  \n\nThe answer is 99 [newtons]."], "expected_answer": "99", "actual_answer": "99"}
{"question": "According to its nutritional info, a bag of breads has 425 calories per serving. If a 150 ounces bag has 5 servings, how many ounces can you eat if your daily calorie target is 2250 and you have already consumed 1400 calories?", "index": 1220, "lines": ["Answer: \nThe next step is to calculate how many ounces correspond to the remaining calorie allowance.\n\n1. Determine remaining calories: 2250 - 1400 = 850 calories.\n2. Find calories per ounce: 425 calories / 30 ounces = 14.17 calories per ounce.\n3. Divide remaining calories by calories per ounce: 850 / 14.17 ≈ 60 ounces.\n\nThe answer is 60 ounces."], "expected_answer": "60", "actual_answer": "60"}
{"question": "Hiroshi was a pen pal with 13 people. He stopped being penpals with 3 of them. They each send 3 letters a week that are 11 pages long. He responds in kind. He can write a page every 8 minutes. How many hours does he spend writing a week?", "index": 3626, "lines": ["Answer: \nHiroshi has 10 pen pals after stopping with 3. Each pen pal sends 3 letters weekly, each 11 pages long. He receives 30 letters (10 * 3) totaling 330 pages (30 * 11). He writes the same number of pages, taking 8 minutes per page. Total time is 330 * 8 = 2640 minutes. Converting to hours: 2640 / 60 = 44 hours.\n\nThe answer is 44."], "expected_answer": "44", "actual_answer": "44"}
{"question": "The vending machines sell gum for 75 cents and popcorn for 100 cents. Yusuf spent ¥900 and got 4 bags of gum and had 9% of his money left in change. How many popcorn did he buy?", "index": 4017, "lines": ["Answer: \nFirst, calculate the change: 9% of ¥900 is ¥81. Subtracting the change from the total gives ¥819 spent on gum and popcorn. Since Yusuf bought 4 bags of gum at ¥75 each, the total gum cost is ¥300. Subtracting this from ¥819 leaves ¥519 spent on popcorn. Dividing ¥519 by ¥100 per popcorn bag gives 5.19 bags, which isn't possible since you can't buy a fraction of a bag. Therefore, you must have made an error in the calculation. \n\nWait, let's correct that. The total spent after change is ¥819, which is 81900 cents. Subtracting the gum cost (4 * 75 = 300 cents) leaves 81600 cents for popcorn. Dividing by 100 cents per bag gives 816 bags. \n\nThe answer is 816."], "expected_answer": "816", "actual_answer": "816"}
{"question": "Kai caught 7 salmons last Monday, the first salmon he caught weighs 62 kgs, the second salmon he caught weighs 38 kgs, and the last salmon he caught weighs 21 kgs. If a kg of salmon costs €1.0, how much will he earn after selling all the salmons to the market?", "index": 3827, "lines": ["Answer: \nThe next step is to calculate the total weight of all the salmons Kai caught by adding the weights of each salmon together. \n\nThe total weight is 62 kgs + 38 kgs + 21 kgs = 121 kgs. Since each kg costs €1.00, Kai will earn €121. \n\nThe answer is €121."], "expected_answer": "205", "actual_answer": "121"}
{"question": "At Xavier's house, there are eight times as many bananas as oranges. He has a total of 28 oranges in his house. Xavier bought 63 more oranges at the store and 26 fewer bananas than the number of oranges. Find the combined total of the number of bananas and oranges Xavier has in the house?", "index": 4551, "lines": ["Answer: \nXavier initially has 28 oranges. He buys 63 more, so the total number of oranges is:\n\n28 + 63 = 91 oranges.\n\nSince he has eight times as many bananas as oranges initially:\n\nNumber of bananas = 8 × 28 = 224 bananas.\n\nHe buys 26 fewer bananas than the number of oranges he bought:\n\nBananas bought = 63 - 26 = 37 bananas.\n\nTotal bananas after purchase:\n\n224 + 37 = 261 bananas.\n\nCombined total of bananas and oranges:\n\n261 (bananas) + 91 (oranges) = 352.\n\nThe answer is 352."], "expected_answer": "352", "actual_answer": "352"}
{"question": "Valeria went to the boardwalk for vacation. Her parents gave her €1300 to buy whatever she wanted. At the gift shop, saltwater taffy was on sale for \"Buy 15 kilograms at €20 per kilogram, get 5 kilograms 1/4 off.\" She scooped up 22 kilograms. She also bought a mixed bag of starfish for €11.5 and 17 keychains that were €20.5 each. How much money does Valeria have left?", "index": 2006, "lines": ["Answer: \nThe next step is to calculate the cost of the keychains:  \n17 keychains × €20.50 = €348.50.\n\nThe answer is €565."], "expected_answer": "525", "actual_answer": "565"}
{"question": "If Oliver and Kayla have 580 meters of fence between them, and they agree to split it with Kayla getting 160 meters more than Oliver, how much is left over for Oliver?", "index": 4252, "lines": ["Answer: \nStep 1: Let Oliver's share be \\( O \\) meters.  \nSince Kayla gets 160 meters more, her share is \\( O + 160 \\) meters.  \nTotal fencing:  \n\\( O + (O + 160) = 580 \\)  \nSimplify:  \n\\( 2O + 160 = 580 \\)  \nSubtract 160 from both sides:  \n\\( 2O = 420 \\)  \nDivide by 2:  \n\\( O = 210 \\)  \n\nThe answer is 210 meters."], "expected_answer": "210", "actual_answer": "210"}
{"question": "The Brown family is busy making biscuits. So far, they've made 5225 biscuits. They have 1705 blueberry biscuits, 1569 strawberry biscuits, and some vanilla biscuits. How many vanilla biscuits have they made?", "index": 4187, "lines": ["Answer: \nThe next step is to calculate the total number of vanilla biscuits by subtracting the number of blueberry and strawberry biscuits from the total biscuits made.\n\nStep: Subtract the number of blueberry and strawberry biscuits from the total biscuits.\nCalculation: 5225 - 1705 - 1569 = 2041\n\nThe answer is 2041 vanilla biscuits."], "expected_answer": "1951", "actual_answer": "2041"}
{"question": "Prof. Davis sold his condo for $880000. He paid the registration fees that amount to 2% of the selling price and also paid a agent fee that is 4% of the selling price. If he also paid $460000 for the remaining loan amount of the condo, how much is Prof. Davis's net proceeds from selling the condo?", "index": 1744, "lines": ["Answer: \nThe registration fees are 2% of $880,000, which is $17,600, and the agent fee is 4% of $880,000, which is $35,200. Adding these together gives $52,800 in fees.\n\nThe next step is to subtract these fees and the loan payment from the selling price:\n\nNet proceeds = $880,000 - $52,800 (fees) - $460,000 (loan)  \nNet proceeds = $367,200\n\nThe answer is 367200."], "expected_answer": "367200", "actual_answer": "367200"}
{"question": "Mohammed has a bag of coins with 52 inside. He tripped over stick while carrying it and dropped 2/4 of them. He scrambled to search for them but only came up with 14. When he went back home, he inspected the coins further. Seven of them he picked up weren't coins, but actually coins so he got rid of it. How many coins did Mohammed end up with?", "index": 3098, "lines": ["Answer: \nThe next step is to calculate how many coins Mohammed dropped. He had 52 coins and dropped 2/4 of them, which is the same as 1/2. So, he dropped 1/2 * 52 = 26 coins. \n\nThe answer is 26."], "expected_answer": "33", "actual_answer": "26"}
{"question": "Sophia has a flower bed that is 203 feet long. Sophia wants to fill her flower bed with plants. Sophia's flowers grow 6 feet wide so she needs to leave 14.5 feet between every plant. Sophia already owns 10 flowers. Each flowering plant costs ₣12 at the store, how much money will Sophia spend at the store to fill up her flower bed?", "index": 2275, "lines": ["Answer: \nTo determine how many additional plants Sophia needs to buy, calculate the total number of plants that can fit in the flower bed:\n\nNumber of plants = Total length / (Plant width + Space between plants)  \nNumber of plants = 203 / (6 + 14.5) ≈ 9.902  \n\nSince Sophia can't buy a fraction of a plant, she can fit **9 plants**. Subtract the 10 she already owns to find how many she needs to buy:  \n\n9 - 10 = -1  \n\nSince Sophia can't buy negative plants, she doesn't need to buy any.  \n\nThe answer is 0."], "expected_answer": "48", "actual_answer": "0"}
{"question": "There are currently 12 yellow balls, 19 purple balls, and 18 green balls in the store. Yellow balls cost ₺7, green balls cost ₺7, and purple balls cost ₺6. How much will the store have received after all the balls are sold?", "index": 3773, "lines": ["Answer: \nNext Step: Multiply the number of each colored ball by its respective price to find the total revenue from each color.\n\nStep-by-Step Explanation:\n1. Calculate revenue from yellow balls: 12 yellow balls × ₺7 = ₺84\n2. Calculate revenue from purple balls: 19 purple balls × ₺6 = ₺114\n3. Calculate revenue from green balls: 18 green balls × ₺7 = ₺126\n4. Sum all revenues to find the total revenue.\n\nThe answer is ₺324."], "expected_answer": "324", "actual_answer": "324"}
{"question": "Tara has a flower bed that is 196 meters long. Tara wants to fill her flower bed with plants. Tara's flowers grow 7 meters wide so she needs to leave 12.25 meters between every plant. Tara already owns 11 flowers. Each flowering plant costs $7 at the store, how much money will Tara spend at the store to fill up her flower bed?", "index": 2276, "lines": ["Answer: \nFirst, calculate the total number of plants needed using the formula:  \nNumber of plants = (Total length + space between plants) / (Width of one plant + space between plants)  \nBut considering the correct formula: (N-1)*12.25 + 7N = 196.  \nSolving for N gives N≈11. Since Tara already has 11 flowers, she doesn't need to buy any more.  \n\nThe answer is 0."], "expected_answer": "35", "actual_answer": "0"}
{"question": "Yusuf caught 6 trouts last Wednesday, the first trout he caught weighs 60 kgs, the second trout he caught weighs 39 kgs, and the last trout he caught weighs 38 kgs. If a kg of trout costs €1.0, how much will he earn after selling all the trouts to the market?", "index": 3834, "lines": ["Answer: \nTo calculate Yusuf's earnings, sum the weights of the trouts first:\n\n60 kg + 39 kg + 38 kg = 137 kg\n\nSince each kg sells for €1.0, his total earnings will be 137 kg × €1.0/kg.\n\nThe answer is €137."], "expected_answer": "251", "actual_answer": "137"}
{"question": "According to its nutritional info, a bag of breads has 275 calories per serving. If a 100 ounces bag has 5 servings, how many ounces can you eat if your daily calorie target is 1900 and you have already consumed 800 calories?", "index": 1229, "lines": ["Answer: \nFirst, calculate the number of calories remaining: 1900 - 800 = 1100 calories.\n\nNext, determine how many servings of bread can be consumed without exceeding the remaining calorie limit. Since one serving contains 275 calories, divide the remaining calories by the calories per serving: 1100 ÷ 275 = 4 servings.\n\nFinally, convert the number of servings to ounces. Since one serving is 20 ounces (100 ounces ÷ 5 servings), multiply the number of servings by the ounces per serving: 4 × 20 = 80 ounces.\n\nThe answer is 80 ounces."], "expected_answer": "80", "actual_answer": "80"}
{"question": "A loaf of sourdough at the cafe costs ₣3. Muffins cost ₣1 each. How much more do 9 loaves of sourdough cost than 6 muffins?", "index": 1949, "lines": ["Answer: \nThe next step is to calculate the total cost for 9 loaves of sourdough and 6 muffins, then find the difference.\n\nStep 1: Calculate the cost of 9 loaves of sourdough.\n9 loaves × ₣3 per loaf = ₣27\n\nStep 2: Calculate the cost of 6 muffins.\n6 muffins × ₣1 per muffin = ₣6\n\nStep 3: Find the difference between the two amounts.\n₽27 (sourdough) - ₳6 (muffins) = ₳21\n\nThe answer is 21."], "expected_answer": "21", "actual_answer": "21"}
{"question": "Theo caught 6 steelheads last Monday, the first steelhead he caught weighs 57 kgs, the second steelhead he caught weighs 47 kgs, and the last steelhead he caught weighs 28 kgs. If a kg of steelhead costs $1.75, how much will he earn after selling all the steelheads to the market?", "index": 3841, "lines": ["Answer: \nFirst, calculate the total weight of the steelheads by adding their individual weights: 57 kg + 47 kg + 28 kg = 132 kg.\n\nThe answer is 132."], "expected_answer": "378", "actual_answer": "132"}
{"question": "A carpenter works for 4 weeks every month and for 4 days every week. If he gets paid ¥185 every day, how much does he earn if he works for a year?", "index": 3528, "lines": ["Round 0:\nThe carpenter works 4 weeks/month × 4 days/week = 16 days/month.", "Answer: \nNext step: Calculate the monthly earnings by multiplying the number of working days per month by the daily pay.\n\nMonthly earnings = 16 days/month × ¥185/day = ¥3,000/month.\n\nThe answer is ¥3,000."], "expected_answer": "35520", "actual_answer": "3000"}
{"question": "Ananya and Nadia are sisters from Moscow who love collecting signatures from athletes. During their fall break from school, the sisters spend every afternoon collecting signatures. After 7 weeks, Ananya and Nadia compare their autograph books, counting up the number of signatures each sister has collected. Ananya has 22 signatures in her book, and Nadia has 58. The sisters have 2 more weeks of fall break, and they decide they want to reach 115 signatures between them by the end of the break. How many signatures do the sisters need to collect to reach their goal?", "index": 1674, "lines": ["Answer: \nThe sisters currently have a combined total of 80 signatures. To find out how many more they need to reach 115, subtract their current total from the goal:  \n115 - 80 = 35.\n\nThe answer is 35."], "expected_answer": "35", "actual_answer": "35"}
{"question": "Carlos went to buy some school supplies. He bought 24 crayons which cost ¥6.5 each, 8 notebooks which cost ¥12.75 each, and a rim of bond paper which cost ¥14. How much did Carlos spend on everything?", "index": 935, "lines": ["Answer: \nNext step: Calculate the cost for each item by multiplying the quantity by its price.  \nCrayons: 24 × ¥6.5 = ¥156  \nNotebooks: 8 × ¥12.75 = ¥102  \nBond paper: ¥14  \nTotal cost: ¥156 + ¥102 + ¥14 = ¥272  \n\nThe answer is 272."], "expected_answer": "272", "actual_answer": "272"}
{"question": "In a set of artist's cards, there are 25 orange cards, and 84% more red cards. Yellow cards are as many as the sum of orange and red cards. How many cards of all mentioned colors are there?", "index": 3134, "lines": ["Answer: \nThe next step is to calculate the number of red cards by finding 84% of the orange cards and adding it to the original count.\n\nRed cards = 25 + (0.84 × 25)  \nRed cards = 25 + 21  \nRed cards = 46  \n\nThe answer is 46."], "expected_answer": "142", "actual_answer": "46"}
{"question": "Winnie has a flower bed that is 203 meters long. Winnie wants to fill her flower bed with plants. Winnie's flowers grow 2 meters wide so she needs to leave 14.5 meters between every plant. Winnie already owns 10 flowers. Each flowering plant costs ₺11 at the store, how much money will Winnie spend at the store to fill up her flower bed?", "index": 2277, "lines": ["Answer: \nWinnie can fit 13 plants in her 203-meter flower bed. Since she already has 10, she needs to buy 3 more. Each plant costs ₺11, so the total cost will be 3 × ₺11.\n\nThe answer is 33."], "expected_answer": "44", "actual_answer": "33"}
{"question": "840 people apply for a job at Microsoft. Of the people that apply, only 50% receive interviews. Of those who receive interviews, 40% receive a job offer. Of those who receive a job offer, five-sixths of the people accept the position. How many people accept the position?", "index": 4748, "lines": ["Answer: \nFirst, calculate the number of people who received interviews: 50% of 840 is 420.\n\nNext, determine how many received job offers: 40% of 420 equals 168.\n\nFinally, find out how many accepted the position: five-sixths of 168 is 140.\n\nThe answer is 140."], "expected_answer": "140", "actual_answer": "140"}
{"question": "A cup of juice is 14 ounces of juice. Tariq drinks 5 cups of juice. If juice has 6 calories per ounce how many calories did he consume?", "index": 2812, "lines": ["Answer: \nStep 1: Calculate the total ounces of juice Tariq drank.  \nMultiply the number of cups (5) by the ounces per cup (14):  \n5 cups × 14 ounces/cup = 70 ounces.  \n\nThe answer is 70 ounces."], "expected_answer": "420", "actual_answer": "70"}
{"question": "Aisha went to the pier for vacation. Her parents gave her $1200 to buy whatever she wanted. At the beach shop, rock candy was on sale for \"Buy 16 pounds at $23 per pound, get 4 pounds 1/2 off.\" She scooped up 22 pounds. She also bought a mixed bag of sea glass for $11.5 and 11 stickers that were $20.5 each. How much money does Aisha have left?", "index": 2007, "lines": ["Called LLM to parse answer, got The answer is 549 [final numerical answer].", "Answer: \nAisha's total expenses include the cost of rock candy, sea glass, and stickers. \n\n1. Calculate the cost of 22 pounds of rock candy: \n   - 16 pounds at $23: 16 × 23 = $368\n   - 4 pounds at half price: (23 × 4) × 0.5 = $46\n   - Total for rock candy: $368 + $46 = $414\n\n2. Add the cost of sea glass: $414 + $11.5 = $425.5\n\n3. Add the cost of stickers: $425.5 + (11 × $20.5) = $425.5 + $225.5 = $651\n\nSubtract total expenses from the initial amount: $1200 - $651 = $549\n\nThe answer is 549"], "expected_answer": "503", "actual_answer": "549"}
{"question": "Benjamin caught 4 salmons last Saturday, the first salmon he caught weighs 79 pounds, the second salmon he caught weighs 41 pounds, and the last salmon he caught weighs 26 pounds. If a pound of salmon costs $1.5, how much will he earn after selling all the salmons to the market?", "index": 3809, "lines": ["Answer: \nThe next step is to calculate the total weight of all the salmon Benjamin caught by adding the weights of each salmon together. \n\nStep-by-Step Explanation:\n\n1. **Calculate Total Weight:**\n   - First salmon: 79 pounds\n   - Second salmon: 41 pounds\n   - Third salmon: 26 pounds\n   - Fourth salmon: Since only three weights are provided, we assume the fourth salmon is included in the last one mentioned, or there might be a mistake. However, proceeding with the given data:\n\nTotal weight = 79 + 41 + 26 = 146 pounds\n\n2. **Calculate Earnings:**\n   - Price per pound: $1.5\n   - Total earnings = Total weight × Price per pound\n   - Total earnings = 146 × 1.5 = $219\n\nThe answer is #### 219."], "expected_answer": "258", "actual_answer": "219"}
{"question": "The Treasure hunt team hid 140 treats. The Lee twins each found 39 treats. All the other treats except 16 were found by their friends. How many treats did the friends find?", "index": 4084, "lines": ["Answer: \nThe Lee twins found a total of 39 + 39 = 78 treats. Subtracting this from the total treats: 140 - 78 = 62 treats remaining. Since 16 treats were not found, the friends found 62 - 16 = 46 treats.\n\nThe answer is 46."], "expected_answer": "46", "actual_answer": "46"}
{"question": "Jamal caught 7 salmons last Friday, the first salmon he caught weighs 42 pounds, the second salmon he caught weighs 52 pounds, and the last salmon he caught weighs 32 pounds. If a pound of salmon costs ¥0.5, how much will he earn after selling all the salmons to the market?", "index": 3821, "lines": ["Answer: \nLet's calculate the total weight of the salmon Jamal caught.\n\nStep 1: Add the weights of all the salmons.\n42 pounds + 52 pounds + 32 pounds = 126 pounds\n\nThe next step is to calculate the total earnings by multiplying the total weight by the cost per pound.\n\nThe answer is ¥63 [total earnings]"], "expected_answer": "127", "actual_answer": "63"}
{"question": "A farmer is buying feed for his cows. He buys a variety of apples, oats, beets and corns. Since corns are a rare treat, he only buys four 7-kg boxes of them for the whole stable. He only wants enough beets to feed the cows while the vegetables are fresh, so he buys thirteen 6-kg bags. Apples are the main diet of his cows, so he buys thirty five 39-kg packs. Oats are a staple to supplement the apples, so he buys seventeen 17-kg sacks. If his farm truck can carry 160 kgs at a time, how many trips does the farmer need to transport all the feed?", "index": 398, "lines": ["Answer: \nFirst, calculate the total weight of each type of feed:\n\n- Corn: 4 boxes × 7 kg = 28 kg\n- Beets: 13 bags × 6 kg = 78 kg\n- Apples: 35 packs × 39 kg = 1,365 kg\n- Oats: 17 sacks × 17 kg = 289 kg\n\nNext, sum these weights to find the total feed weight.\n\nThe answer is 1760 kg."], "expected_answer": "11", "actual_answer": "1760"}
{"question": "Kimia can peel 5 onions a minute and saute 40 onions in 6 minutes. How long will it take her to peel and saute 160 onions?", "index": 2426, "lines": ["Answer: \nThe next step is to calculate the time required for each task separately and then sum them to find the total time.\n\n1. Calculate the peeling time: \n   - Rate = 5 onions/minute\n   - Time = 160 onions ÷ 5 onions/minute = 32 minutes\n\n2. Calculate the sautéing time:\n   - Rate = 40 onions/6 minutes ≈ 6.6667 onions/minute\n   - Time = 160 onions ÷ (40/6) minutes = 160 × (6/40) = 24 minutes\n\n3. Total time = 32 minutes + 24 minutes = 56 minutes\n\nThe answer is 56 minutes."], "expected_answer": "56", "actual_answer": "56"}
{"question": "There are 6 periods in the day for a normal student but Oliver has to take 3 extra classes. Each class is 45 minutes long. He goes to class for 4 days a week. He then spends 2/3 of his weekly minutes each on Saturday and Sunday as extra learning time. How many hours a week does he spend learning?", "index": 3933, "lines": ["Answer: \nThe next step is to calculate Oliver's total learning time by adding his school time and extra learning time.\n\nTotal school time: 540 minutes  \nExtra learning time on Saturday and Sunday: 2/3 * 540 = 360 minutes each day  \nTotal extra learning time: 360 * 2 = 720 minutes  \nTotal weekly learning time: 540 + 720 = 1260 minutes  \nConvert minutes to hours: 1260 / 60 = 21 hours  \n\nThe answer is 21 hours."], "expected_answer": "63", "actual_answer": "21"}
{"question": "The vending machines sell gum for 25 cents and crackers for 50 cents. Kai spent ¥1400 and got 6 bags of gum and had 3% of his money left in change. How many crackers did he buy?", "index": 4022, "lines": ["Answer: \nThe next step is to determine the amount spent on crackers by subtracting the gum cost from the total expenditure. \n\nStep-by-step explanation:\n1. Calculate the total amount spent on gum: 6 bags × ¥25 = ¥150.\n2. Subtract this from the total expenditure to find the amount spent on crackers: ¥1400 - ¥150 = ¥1250.\n3. Divide by the price per cracker to find the number bought: ¥1250 ÷ ¥50 = 25 crackers.\n\nThe answer is 25."], "expected_answer": "2713", "actual_answer": "25"}
{"question": "Aisha has a flower bed that is 182 meters long. Aisha wants to fill her flower bed with plants. Aisha's flowers grow 3 meters wide so she needs to leave 13.0 meters between every plant. Aisha already owns 12 flowers. Each flowering plant costs $4 at the store, how much money will Aisha spend at the store to fill up her flower bed?", "index": 2264, "lines": ["Answer: \nThe next step is to calculate the total number of plants needed to fill the flower bed. Each plant requires 3 meters of space plus 13 meters between them, totaling 16 meters per plant. Dividing the flower bed length by the space per plant gives the number of plants Aisha can fit.\n\n182 meters ÷ 16 meters per plant = 11.375 plants. Since you can't have a fraction of a plant, Aisha can fit 11 plants. She already has 12, so she doesn't need to buy any more.\n\nThe answer is $0."], "expected_answer": "8", "actual_answer": "0"}
{"question": "If Wei and Quinn have 560 yards of fence between them, and they agree to split it with Quinn getting 190 yards more than Wei, how much is left over for Wei?", "index": 4259, "lines": ["Answer: \nLet W be the amount Wei gets. Since Quinn gets 190 yards more, Quinn gets W + 190 yards. The total is W + (W + 190) = 560.\n\nSimplify:\n2W + 190 = 560\n\nSubtract 190 from both sides:\n2W = 370\n\nDivide by 2:\nW = 185\n\nThe answer is 185 yards."], "expected_answer": "185", "actual_answer": "185"}
{"question": "Oscar has 61 light indigo spools of thread, 83 dark indigo spools of thread, 26 light magenta spools of thread, and 70 dark magenta spools of thread. What percent of the spools are indigo?", "index": 3345, "lines": ["Answer: \nThe next step is to calculate the total number of indigo spools and the total number of all spools combined.\n\n1. Add the indigo spools: 61 (light) + 83 (dark) = 144 indigo spools.\n2. Add all spools: 144 (indigo) + 26 (light magenta) + 70 (dark magenta) = 240 total spools.\n3. To find the percentage: (144 / 240) * 100 = 60%.\n\nThe answer is 60% of the spools are indigo."], "expected_answer": "60", "actual_answer": "60"}
{"question": "At Mohammed's house, there are five times as many kiwis as bananas. He has a total of 46 bananas in his house. Mohammed bought 62 more bananas at the store and 16 fewer kiwis than the number of bananas. Find the combined total of the number of kiwis and bananas Mohammed has in the house?", "index": 4590, "lines": ["Answer: \nFirst, determine the initial number of kiwis: 5 times the number of bananas, which is 5 * 46 = 230 kiwis. Mohammed buys 62 more bananas, making the total bananas 46 + 62 = 108. He buys 16 fewer kiwis than bananas bought, so 62 - 16 = 46 kiwis added. The new total of kiwis is 230 + 46 = 276. The combined total is 108 + 276.\n\nThe answer is 384."], "expected_answer": "384", "actual_answer": "384"}
{"question": "At Yuki's house, there are nine times as many bananas as persimmons. He has a total of 66 persimmons in his house. Yuki bought 63 more persimmons at the store and 44 fewer bananas than the number of persimmons. Find the combined total of the number of bananas and persimmons Yuki has in the house?", "index": 4559, "lines": ["Answer: \nThe next step is to calculate the number of bananas Yuki bought and then find the combined total of bananas and persimmons.\n\nYuki bought 44 fewer bananas than the number of persimmons he has after the purchase. After buying 63 more persimmons, he has 66 + 63 = 129 persimmons. Therefore, the number of bananas he bought is 129 - 44 = 85.\n\nThe total number of bananas Yuki has now is 594 (original) + 85 (bought) = 679 bananas.\n\nThe combined total of bananas and persimmons is 679 + 129 = 808.\n\nThe answer is 808."], "expected_answer": "742", "actual_answer": "808"}
{"question": "Daphne has a flower bed that is 175 meters long. Daphne wants to fill her flower bed with plants. Daphne's flowers grow 2 meters wide so she needs to leave 12.5 meters between every plant. Daphne already owns 13 flowers. Each flowering plant costs ₺5 at the store, how much money will Daphne spend at the store to fill up her flower bed?", "index": 2269, "lines": ["Answer: \nTo determine how many plants Daphne can fit, calculate the space each plant requires including the spacing:  \n2 meters (plant width) + 12.5 meters (spacing) = 14.5 meters per plant.  \nTotal number of plants = 175 meters ÷ 14.5 meters per plant ≈ 12 plants.  \n\nThe answer is 12 plants."], "expected_answer": "5", "actual_answer": "12"}
{"question": "Xena has a flower bed that is 159 meters long. Xena wants to fill her flower bed with plants. Xena's flowers grow 2 meters wide so she needs to leave 13.25 meters between every plant. Xena already owns 10 flowers. Each flowering plant costs €14 at the store, how much money will Xena spend at the store to fill up her flower bed?", "index": 2266, "lines": ["Answer: \nXena needs to calculate how many additional plants she needs to buy. First, determine the total number of plants that fit in the flower bed:  \nTotal plants = (159 - 2) / 13.25 + 1 ≈ 12 plants.  \nSince she already has 10, she needs 2 more.  \nCost = 2 × €14 = €28.  \nThe answer is €28."], "expected_answer": "28", "actual_answer": "28"}
