{"question": "Valeria is popping popcorn for a snack. As the pan of kernels heats up, the kernels start popping faster. 30 pop in the first 12 seconds of cooking, then 3 times that amount in the next 12 seconds. The kernels increase to 4 times the initial popping rate in the next 12 seconds, but in the final 12 seconds, the popping slows down to half the rate as the past 12 seconds. After Valeria takes the pan off the heat, a quarter of the number of kernels that popped in the final 12 seconds of cooking also pop from the residual heat. How many pieces of popcorn does Valeria have to eat?", "index": 237, "lines": ["Answer: \nThe next step is to calculate the number of popcorns popped in each subsequent 12-second interval.\n\nStep 2: In the next 12 seconds, the popping rate triples the initial amount.  \nCalculation: 30 kernels × 3 = 90 kernels.\n\nThe answer is 90."], "expected_answer": "315", "actual_answer": "90"}
{"question": "Jin caught 4 trouts last Thursday, the first trout he caught weighs 54 kgs, the second trout he caught weighs 42 kgs, and the last trout he caught weighs 20 kgs. If a kg of trout costs ¥0.5, how much will he earn after selling all the trouts to the market?", "index": 3849, "lines": ["Answer: \nStep 1: Calculate the total weight of the trouts caught.\n\nTotal weight = 54 kg + 42 kg + 20 kg = 116 kg\n\nThe answer is 116 kg.\n\nStep 2: Determine the total earnings by multiplying the total weight by the cost per kg.\n\nTotal earnings = 116 kg * ¥0.5/kg = ¥58\n\nThe answer is ¥58."], "expected_answer": "68", "actual_answer": "58"}
{"question": "Ravi finished three-sixths of a 194 piece puzzle, and then started and finished another 354 piece puzzle within an hour. How many puzzle pieces did Ravi place during that hour?", "index": 3987, "lines": ["Answer: \nFirst, calculate the number of pieces from the first puzzle:  \nThree-sixths of 194 pieces is (3/6) * 194 = 97 pieces.\n\nNext, add the pieces from the second puzzle:  \n97 pieces + 354 pieces = 451 pieces.\n\nThe answer is 451."], "expected_answer": "451", "actual_answer": "451"}
{"question": "Alejandro has a bag of buttons with 24 inside. He tripped over toy while carrying it and dropped two-thirds of them. He scrambled to search for them but only came up with 14. When he went back home, he inspected the buttons further. Two of them he picked up weren't buttons, but actually pebbles so he got rid of it. How many buttons did Alejandro end up with?", "index": 3063, "lines": ["Answer: \nAlejandro starts with 24 buttons. He drops two-thirds of them, which is (2/3)*24 = 16 buttons. After dropping, he has 24 - 16 = 8 buttons left. He finds 14 buttons, so adding those gives 8 + 14 = 22 buttons. However, 2 of these are pebbles, so he removes them, leaving him with 22 - 2 = 20 buttons.\n\nThe answer is 20."], "expected_answer": "20", "actual_answer": "20"}
{"question": "A pyramid is made out of 2 green cubes, seven times as many orange cubes, and an unknown number of purple cubes. If there are 39 cubes in the pyramid in total, how many purple cubes are there?", "index": 2067, "lines": ["Answer: \nThe next step is to calculate the number of orange cubes by multiplying the number of green cubes by 7: 2 × 7 = 14 orange cubes.\n\nThe answer is 23."], "expected_answer": "23", "actual_answer": "23"}
{"question": "Olga has a flower bed that is 168 feet long. Olga wants to fill her flower bed with plants. Olga's flowers grow 4 feet wide so she needs to leave 14.0 feet between every plant. Olga already owns 10 flowers. Each flowering plant costs ₺14 at the store, how much money will Olga spend at the store to fill up her flower bed?", "index": 2281, "lines": ["Answer: \nThe next step is to calculate how many plants Olga needs to fill her flower bed. \n\nThe total length of the flower bed is 168 feet. Each plant, including the space between them, requires 4 feet for the plant and 14 feet for spacing, totaling 18 feet per plant. \n\nNumber of plants needed = Total length / Space per plant  \nNumber of plants = 168 feet / 18 feet per plant  \nNumber of plants = 9.333...\n\nSince Olga can't have a fraction of a plant, she'll need 10 plants.\n\nBut Olga already owns 10 flowers, so she doesn't need to buy any more.\n\nThe answer is 0."], "expected_answer": "28", "actual_answer": "0"}
{"question": "Jamal has ¥71.19 and wants to buy 31 nuts from a bin at the hardware store. Each nut costs ¥0.49. How much money does Jamal have left after paying for the nuts?", "index": 1524, "lines": ["Round 0:\nStep: Calculate the total cost of 31 nuts.\n\n31 nuts × ¥0.49 per nut = ¥15.19\n\nThis provides the total amount Jamal needs to pay for the nuts.", "Answer: \nStep: Subtract the total cost of the nuts from Jamal's initial amount of money.\n\n¥71.19 - ¥15.19 = ¥56.00\n\nThe answer is ¥56.00."], "expected_answer": "56", "actual_answer": "56"}
{"question": "Carlos goes to the store to buy some tea. The normal brand of tea he buys costs ₺4 per kilogram. He had to buy a more expensive brand that costs 25% more since his favorite brand was sold out. He decides to buy a week's worth of tea and he uses 1 kilogram of tea per day. He also decided to buy himself a muffin for ₺1. How much did everything cost?", "index": 2129, "lines": ["Answer: \nNext step: Calculate the new price of the tea, which is 25% more than ₺4 per kilogram.\n\nThe new price of tea is 4 + (0.25 × 4) = 5. \n\nThe answer is 36."], "expected_answer": "36", "actual_answer": "36"}
{"question": "A juggler can juggle 200 balls. A fifth of the balls are tennis balls, and 1/2 of the tennis balls are teal. How many teal tennis balls are there?", "index": 430, "lines": ["Answer: \nThe next step is to calculate how many tennis balls are teal by finding half of the total tennis balls.\n\nStep-by-step explanation:\n\n1. Total balls = 200\n2. Fraction of tennis balls = 1/5\n3. Number of tennis balls = 200 × (1/5) = 40\n4. Fraction of teal tennis balls = 1/2\n5. Number of teal tennis balls = 40 × (1/2) = 20\n\nThe answer is 20."], "expected_answer": "20", "actual_answer": "20"}
{"question": "A clinic has a capacity of 1700 rooms with 2/5 occupied. Due to the natural disaster, 20 patients are admitted into the clinic each day. Calculate the total number of unoccupied rooms in the clinic after 2 weeks.", "index": 1434, "lines": ["Answer: \nThe next step is to calculate the number of occupied rooms initially and then add the number of new patients admitted over two weeks.\n\n1. Calculate initial occupied rooms:\n   \\( \\frac{2}{5} \\times 1700 = 680 \\) rooms.\n\n2. Calculate total new patients admitted in two weeks:\n   \\( 20 \\, \\text{patients/day} \\times 14 \\, \\text{days} = 280 \\) patients.\n\n3. Find total occupied rooms after two weeks:\n   \\( 680 + 280 = 960 \\) rooms.\n\n4. Subtract from total capacity to find unoccupied rooms:\n   \\( 1700 - 960 = 740 \\) rooms.\n\nThe answer is 740."], "expected_answer": "740", "actual_answer": "740"}
{"question": "At Gabriel's house, there are five times as many grapes as apples. He has a total of 94 apples in his house. Gabriel bought 42 more apples at the store and 39 fewer grapes than the number of apples. Find the combined total of the number of grapes and apples Gabriel has in the house?", "index": 4578, "lines": ["Answer: \nLet's break down the problem step by step.\n\n1. **Initial Count of Apples and Grapes:**\n   - Gabriel has 94 apples.\n   - The number of grapes is five times the number of apples: \n     \\[\n     5 \\times 94 = 470 \\text{ grapes}\n     \\]\n\n2. **After Buying More Apples:**\n   - Gabriel buys 42 more apples.\n   - Total apples now:\n     \\[\n     94 + 42 = 136 \\text{ apples}\n     \\]\n\n3. **Adjusting the Number of Grapes:**\n   - Gabriel buys 39 fewer grapes than the new number of apples.\n   - Number of grapes now:\n     \\[\n     136 - 39 = 97 \\text{ grapes}\n     \\]\n\n4. **Calculating the Combined Total:**\n   - Add the total number of apples and grapes:\n     \\[\n     136 + 97 = 233\n     \\]\n\n**The answer is 233.**"], "expected_answer": "609", "actual_answer": "233"}
{"question": "At Liam's house, there are ten times as many pears as apples. He has a total of 31 apples in his house. Liam bought 58 more apples at the store and 44 fewer pears than the number of apples. Find the combined total of the number of pears and apples Liam has in the house?", "index": 4569, "lines": ["Answer: \nLiam initially has 31 apples. Since there are ten times as many pears as apples, the number of pears is calculated by multiplying the number of apples by 10: 31 apples × 10 = 310 pears.\n\nAfter buying 58 more apples, the total number of apples becomes: 31 + 58 = 89 apples.\n\nLiam also bought 44 fewer pears than the number of apples he had before the purchase. Since he initially had 31 apples, he bought 31 - 44 = -13 pears, which doesn't make sense in this context. Therefore, it's likely that the number of pears bought is 44 fewer than the number of apples after the purchase, which is 89 - 44 = 45 pears.\n\nThe total number of pears after the purchase is: 310 - 45 = 265 pears.\n\nThe combined total of apples and pears is: 89 apples + 265 pears = 354 fruits.\n\nThe answer is 354."], "expected_answer": "413", "actual_answer": "354"}
{"question": "If Haruka and Liam have 220 meters of fence between them, and they agree to split it with Liam getting 110 meters more than Haruka, how much is left over for Haruka?", "index": 4277, "lines": ["Answer: \nThe next step is to set up an equation based on the given conditions. Let Haruka's share be \\( H \\) meters. Then, Liam's share is \\( H + 110 \\). Together, their shares add up to 220 meters:\n\n\\[ H + (H + 110) = 220 \\]\n\nSimplifying:\n\n\\[ 2H + 110 = 220 \\]\n\nSubtracting 110 from both sides:\n\n\\[ 2H = 110 \\]\n\nDividing by 2:\n\n\\[ H = 55 \\]\n\nThe answer is 55 meters."], "expected_answer": "55", "actual_answer": "55"}
{"question": "James's truck breaks down. The truck weighs 1350 pounds and he has equipment in it weighing 400 pounds. He also has his 2 young colleagues who weigh 85 pounds each in it. If the force to move the truck is 5% of the weight, how much force does he need to push the truck?", "index": 3389, "lines": ["Answer: \nThe total weight of the truck, equipment, and two colleagues is 1920 pounds. The force needed is 5% of this weight.  \n\nForce = 0.05 × 1920 = 96 pounds  \n\nThe answer is 96."], "expected_answer": "96", "actual_answer": "96"}
{"question": "Oscar caught 7 steelheads last Sunday, the first steelhead he caught weighs 56 pounds, the second steelhead he caught weighs 57 pounds, and the last steelhead he caught weighs 27 pounds. If a pound of steelhead costs $2.25, how much will he earn after selling all the steelheads to the market?", "index": 3826, "lines": ["Answer: \nThe next step is to calculate the total weight of all steelheads and then multiply by the price per pound. Total weight is 364 pounds, so earnings are 364 * $2.25 = $819.\n\nThe answer is 819."], "expected_answer": "558", "actual_answer": "819"}
{"question": "Kayla has a flower bed that is 216 feet long. Kayla wants to fill her flower bed with plants. Kayla's flowers grow 4 feet wide so she needs to leave 13.5 feet between every plant. Kayla already owns 10 flowers. Each flowering plant costs ₣7 at the store, how much money will Kayla spend at the store to fill up her flower bed?", "index": 2280, "lines": ["Answer: \nKayla can fit 13 plants in her 216-foot bed. She already has 10, so she needs 3 more. Each costs €7, so 3 × €7 = €21.\n\nThe answer is €21."], "expected_answer": "42", "actual_answer": "21"}
{"question": "Oliver watches TV after he finishes his homework every night. On Thursday and Friday, he watched a 5-hour episode of his favorite show each night. On Saturday, he watched a few episodes of a 30-minute show. On Sunday, he finished homework early and watched a 2-hour episode and a 30-minute show. On Monday, he got to stay up late, so he watched two 2-hour episodes. If he watched 20 hours of TV in all, how many 30-minute episodes did he watch on Saturday?", "index": 1063, "lines": ["Answer: \nThe next step is to calculate the total hours Oliver spent watching TV and set up an equation to solve for the number of 30-minute episodes watched on Saturday.\n\nTotal TV time = 5 (Thursday) + 5 (Friday) + 0.5x (Saturday) + 2.5 (Sunday) + 4 (Monday) = 20  \n16.5 + 0.5x = 20  \n0.5x = 3.5  \nx = 7\n\nThe answer is 7."], "expected_answer": "7", "actual_answer": "7"}
{"question": "A juggler can juggle 960 balls. 1/2 of the balls are tennis balls, and a third of the tennis balls are yellow. How many yellow tennis balls are there?", "index": 449, "lines": ["Answer: \nThe next step is to calculate the number of yellow tennis balls by finding one-third of the total tennis balls:\n- Total tennis balls = 960 ÷ 2 = 480\n- Yellow tennis balls = 480 ÷ 3 = 160\nThe answer is 160."], "expected_answer": "160", "actual_answer": "160"}
{"question": "Oscar is popping popcorn for a snack. As the pot of kernels heats up, the kernels start popping faster. 30 pop in the first 22 seconds of cooking, then 2 times that amount in the next 22 seconds. The kernels increase to 4 times the initial popping rate in the next 22 seconds, but in the final 22 seconds, the popping slows down to half the rate as the past 22 seconds. After Oscar takes the pot off the heat, a quarter of the number of kernels that popped in the final 22 seconds of cooking also pop from the residual heat. How many pieces of popcorn does Oscar have to eat?", "index": 247, "lines": ["Answer: \nThe answer is 285."], "expected_answer": "285", "actual_answer": "285"}
{"question": "Noah hires a luxury car from 1 PM to 6 PM. He gets 1 hours free. The first paid hour is ₺11 and each hour after that is twice the cost. How much did he pay?", "index": 4454, "lines": ["Answer: \nNoah rented the car for 5 hours but got 1 hour free, so he paid for 4 hours. The first hour costs ₺11, and each subsequent hour is twice the previous cost. Therefore, the cost for each hour is:\n\n1st hour: ₺11  \n2nd hour: 2 * ₺11 = ₺22  \n3rd hour: 2 * ₺22 = ₺44  \n4th hour: 2 * ₺44 = ₺88  \n\nAdding them up: ₺11 + ₺22 + ₺44 + ₺88 = ₺165\n\nThe answer is ₺165."], "expected_answer": "77", "actual_answer": "165"}
{"question": "Elena has six times as many Twitter friends as Chen. Oliver has eight times as many friends on Twitter as Chen. If Elena has 180 friends on Twitter, how many Twitter friends does Oliver have?", "index": 4527, "lines": ["Answer: \nThe next step is to determine how many Twitter friends Chen has. Since Elena has six times as many friends as Chen and Elena has 180 friends, we can set up the equation: 6C = 180, where C is Chen's number of friends. Solving for C gives C = 180 / 6 = 30.\n\nThe answer is 30."], "expected_answer": "240", "actual_answer": "30"}
{"question": "There are 8 periods in the day for a normal student but Qasim has to take 2 extra classes. Each class is 50 minutes long. He goes to class for 6 days a week. He then spends 1/4 of his weekly minutes each on Saturday and Sunday as extra learning time. How many hours a week does he spend learning?", "index": 3920, "lines": ["Answer: \nLet's start by calculating the total number of classes Qasim attends each week.\n\n1. **Determine the number of classes per day:**\n   - Qasim has 8 periods per day.\n   - He takes 2 extra classes.\n   - Total classes per day = 8 + 2 = 10 classes.\n\n2. **Calculate the total number of classes per week:**\n   - He attends classes 6 days a week.\n   - Total classes per week = 10 classes/day × 6 days = 60 classes.\n\n3. **Find the total class time in minutes per week:**\n   - Each class is 50 minutes long.\n   - Total class time per week = 60 classes × 50 minutes/class = 3000 minutes.\n\n4. **Calculate extra learning time for Saturday and Sunday:**\n   - He spends 1/4 of his weekly minutes on each of these days.\n   - Total extra time = 2 days × (1/4 × 3000 minutes) = 2 × 750 = 1500 minutes.\n\n5. **Add up all learning time in minutes:**\n   - Total weekly learning time = 3000 minutes + 1500 minutes = 4500 minutes.\n\n6. **Convert total minutes to hours:**\n   - There are 60 minutes in an hour.\n   - Total weekly learning time = 4500 minutes ÷ 60 minutes/hour = 75 hours.\n\n**Answer:** The answer is 75 hours."], "expected_answer": "75", "actual_answer": "75"}
{"question": "There are 5 periods in the day for a normal student but Benjamin has to take 1 extra classes. Each class is 40 minutes long. He goes to class for 4 days a week. He then spends three-fourths of his weekly minutes each on Saturday and Sunday as extra learning time. How many hours a week does he spend learning?", "index": 3940, "lines": ["Answer: \nBenjamin attends 6 classes per day (5 periods + 1 extra) for 4 days. Each class is 40 minutes, so daily time is 6 * 40 = 240 minutes. Weekly class time is 240 * 4 = 960 minutes. He spends three-fourths of 960 minutes on extra learning over the weekend: (3/4) * 960 = 720 minutes. Total weekly learning time is 960 + 720 = 1680 minutes, which is 28 hours.\n\nThe answer is 28 hours."], "expected_answer": "40", "actual_answer": "28"}
{"question": "The Brown family is busy making muffins. So far, they've made 7800 muffins. They have 1833 strawberry muffins, 2847 blueberry muffins, and some peanut butter muffins. How many peanut butter muffins have they made?", "index": 4167, "lines": ["Answer: \nThe next step is to subtract the total of strawberry and blueberry muffins from the overall total to find the number of peanut butter muffins.\n\nStep-by-step explanation:\n1. Add strawberry and blueberry muffins: 1833 + 2847 = 4680.\n2. Subtract this sum from the total muffins: 7800 - 4680 = 3120.\n\nThe answer is 3120."], "expected_answer": "3120", "actual_answer": "3120"}
{"question": "A farmer is buying feed for his sheep. He buys a variety of oats, hay, cucumbers and wheats. Since wheats are a rare treat, he only buys five 5-pound boxes of them for the whole stable. He only wants enough cucumbers to feed the sheep while the vegetables are fresh, so he buys twelve 7-pound bags. Oats are the main diet of his sheep, so he buys thirty five 43-pound packs. Hay are a staple to supplement the oats, so he buys sixteen 16-pound sacks. If his farm truck can carry 110 pounds at a time, how many trips does the farmer need to transport all the feed?", "index": 383, "lines": ["Answer: \nThe next step is to calculate the total weight of each type of feed and then sum them up to find the total weight to be transported.\n\n1. **Calculate the total weight of each feed:**\n   - Wheat: \\(5 \\text{ boxes} \\times 5 \\text{ pounds/box} = 25 \\text{ pounds}\\)\n   - Cucumbers: \\(12 \\text{ bags} \\times 7 \\text{ pounds/bag} = 84 \\text{ pounds}\\)\n   - Oats: \\(35 \\text{ packs} \\times 43 \\text{ pounds/pack} = 1505 \\text{ pounds}\\)\n   - Hay: \\(16 \\text{ sacks} \\times 16 \\text{ pounds/sack} = 256 \\text{ pounds}\\)\n\n2. **Sum the weights to find the total weight:**\n   \\[\n   25 + 84 + 1505 + 256 = 1870 \\text{ pounds}\n   \\]\n\n3. **Determine the number of trips by dividing the total weight by the truck's capacity:**\n   \\[\n   \\frac{1870 \\text{ pounds}}{110 \\text{ pounds/trip}} = 17 \\text{ trips}\n   \\]\n\n4. **Since there is no remainder, the farmer needs exactly 17 trips.**\n\nThe answer is 17 trips.  \n**The answer is 17.**"], "expected_answer": "17", "actual_answer": "17"}
{"question": "Keisha went to the beach for vacation. Her parents gave her ₺1400 to buy whatever she wanted. At the souvenir store, fudge was on sale for \"Buy 15 pounds at ₺21 per pound, get 6 pounds 1/2 off.\" She scooped up 23 pounds. She also bought a mixed bag of sand dollars for ₺11.5 and 15 postcards that were ₺20.5 each. How much money does Keisha have left?", "index": 2040, "lines": ["Answer: \nNext step: Calculate the total cost for the 23 pounds of fudge by applying the \"Buy 15 pounds at ₺21 per pound, get 6 pounds 1/2 off\" deal.\n\nStep-by-step explanation:\n- First 15 pounds: 15 * ₺21 = ₺315.\n- Next 6 pounds: 6 * (₱21 / 2) = 6 * ₺10.5 = ₺63.\n- Total fudge cost: ₺315 + ₺63 = ₺378.\n\nThe answer is 378."], "expected_answer": "661", "actual_answer": "378"}
{"question": "A new infection infects 20 people. Every day, each infected person infects 4 others. How many people are infected after 4 days?", "index": 4920, "lines": ["Answer: \nThe next step is to calculate the number of new infections on day 4 by multiplying the infections from day 3 by 4 and adding it to the total from day 3.\n\nStep-by-step:\nDay 3 infections: 1,280  \nDay 4 new infections: 1,280 × 4 = 5,120  \nTotal infections after day 4: 1,700 + 5,120 = 6,820\n\nThe answer is 6820."], "expected_answer": "12500", "actual_answer": "6820"}
{"question": "Ava makes tea using teaspoons of sugar and cups of water in the ratio of 113:14. If she used a total of 635 teaspoons of sugar and cups of water, calculate the number of teaspoonfuls of sugar she used.", "index": 283, "lines": ["Answer: \nThe ratio of sugar to water is 113:14, so the total parts are 113 + 14 = 127 parts. Each part equals 635 ÷ 127 = 5 units. Sugar used = 113 × 5 = 565 teaspoons.\n\nThe answer is 565."], "expected_answer": "565", "actual_answer": "565"}
{"question": "A fog bank rolls in from the ocean to cover a city. It takes 407 minutes to cover every 28 miles of the city. If the city is 56 miles across from the oceanfront to the opposite inland edge, how many minutes will it take for the fog bank to cover the whole city?", "index": 89, "lines": ["Answer: \nThe fog covers 28 miles in 407 minutes, so the rate is 407 minutes per 28 miles. To find the time to cover 56 miles:  \nTime = (407 minutes / 28 miles) * 56 miles = 814 minutes.  \n\nThe answer is 814 minutes."], "expected_answer": "814", "actual_answer": "814"}
{"question": "At Esteban's house, there are six times as many plums as persimmons. He has a total of 83 persimmons in his house. Esteban bought 71 more persimmons at the store and 21 fewer plums than the number of persimmons. Find the combined total of the number of plums and persimmons Esteban has in the house?", "index": 4565, "lines": ["Answer: \nEsteban initially has 83 persimmons and six times as many plums, which is 6 * 83 = 498 plums. He buys 71 more persimmons, making the total persimmons 83 + 71 = 154. He also buys 21 fewer plums than the new number of persimmons, so he buys 154 - 21 = 133 plums. The total number of plums now is 498 + 133 = 631. \n\nThe next step is to find the combined total of plums and persimmons: 631 + 154.\n\nThe answer is 785."], "expected_answer": "702", "actual_answer": "785"}
{"question": "At Ravi's house, there are two times as many apples as figs. He has a total of 90 figs in his house. Ravi bought 66 more figs at the store and 45 fewer apples than the number of figs. Find the combined total of the number of apples and figs Ravi has in the house?", "index": 4596, "lines": ["Answer: \nNext step: Calculate the new number of figs after buying 66 more: 90 + 66 = 156 figs.\n\nThe answer is 447 apples and figs combined."], "expected_answer": "357", "actual_answer": "447"}
{"question": "Kai caught 4 trouts last Monday, the first trout he caught weighs 46 kgs, the second trout he caught weighs 30 kgs, and the last trout he caught weighs 32 kgs. If a kg of trout costs ₺0.25, how much will he earn after selling all the trouts to the market?", "index": 3817, "lines": ["Answer: \nThe next step is to calculate the total weight of all the trouts caught by Kai. Adding the weights together: 46 kg + 30 kg + 32 kg + 32 kg = 140 kg.\n\nThe answer is 140 kg."], "expected_answer": "35", "actual_answer": "140"}
{"question": "Keisha is required to submit a 246-page assignment. She already finished writing 2/4 of the assignment. How many pages does she have left to write?", "index": 3867, "lines": ["Answer: \nSince 2/4 is equivalent to 1/2, Keisha has written half of the assignment.  \nThe next step is to calculate half of the total pages:  \n246 pages ÷ 2 = 123 pages.  \n\nThe answer is 123 pages."], "expected_answer": "123", "actual_answer": "123"}
{"question": "There are 116 fifth-graders at Maple Grove School. 25 of them are girls. On Friday, 3 fifth-grade girls and 8 fifth-grade boys were absent. How many fifth grade boys were at Maple Grove School on Friday?", "index": 3748, "lines": ["Answer: \nThe total number of fifth-grade boys is 91. On Friday, 8 boys were absent, so the number of boys present is 91 - 8 = 83. \n\nThe answer is 83."], "expected_answer": "83", "actual_answer": "83"}
{"question": "Yuki collects garbage from 3 different apartment complexes. The first 2 have 100 apartments each and the last one is 20% bigger than the other 2 combined. Yuki collects garbage 5 times a week from each place and he gets paid ₣0.35 per collection for each apartment. How much money does he make in a week?", "index": 2497, "lines": ["Answer: \nThe third apartment complex has 240 apartments. Yuki collects garbage 5 times a week from each complex, earning $0.35 per collection per apartment. \n\nFor the first two complexes with 100 apartments each:\n- Each complex: 100 apartments * 5 collections/week * $0.35 = $175/week\n- Combined: 2 * $175 = $350/week\n\nFor the third complex:\n- 240 apartments * 5 collections/week * $0.35 = $420/week\n\nTotal weekly earnings: $350 + $420 = $770.\n\nThe answer is 770."], "expected_answer": "770", "actual_answer": "770"}
{"question": "If Valentina and Luis have 540 feet of fence between them, and they agree to split it with Luis getting 80 feet more than Valentina, how much is left over for Valentina?", "index": 4299, "lines": ["Answer: \nLet V be the amount Valentina gets. Luis gets V + 80. Together, V + (V + 80) = 540. Simplify to 2V + 80 = 540. Subtract 80 from both sides: 2V = 460. Divide by 2: V = 230.\n\nThe answer is 230."], "expected_answer": "230", "actual_answer": "230"}
{"question": "Prof. Williams sold his condo for $850000. He paid the registration fees that amount to 2% of the selling price and also paid a agent fee that is 3% of the selling price. If he also paid $280000 for the remaining loan amount of the condo, how much is Prof. Williams's net proceeds from selling the condo?", "index": 1724, "lines": ["Answer: \nThe next step is to calculate the total fees and expenses by adding the registration fees, agent fee, and loan amount, then subtract this total from the selling price to find the net proceeds.\n\nNet proceeds = $850,000 - ($17,000 + $25,500 + $280,000) = $527,500.\n\nThe answer is #### 527500."], "expected_answer": "527500", "actual_answer": "527500"}
{"question": "At Benjamin's house, there are six times as many pears as figs. He has a total of 57 figs in his house. Benjamin bought 87 more figs at the store and 48 fewer pears than the number of figs. Find the combined total of the number of pears and figs Benjamin has in the house?", "index": 4599, "lines": ["Answer: \nBenjamin initially has 57 figs and 6 times as many pears, which is 6 × 57 = 342 pears. After purchasing 87 more figs, he has 57 + 87 = 144 figs. He also buys 48 fewer pears than the new number of figs, so he buys 144 - 48 = 96 pears. Adding these to the original pears, the total number of pears is 342 + 96 = 438. The combined total of pears and figs is 438 + 144 = 582.\n\nThe answer is 582."], "expected_answer": "525", "actual_answer": "582"}
{"question": "Leon collects garbage from 7 different apartment complexes. The first 6 have 200 apartments each and the last one is 60% bigger than the other 6 combined. Leon collects garbage 5 times a week from each place and he gets paid ¥0.4 per collection for each apartment. How much money does he make in a week?", "index": 2453, "lines": ["Answer: \nThe seventh apartment complex has 1920 apartments. The next step is to calculate Leon's earnings from each complex and sum them.\n\nThe answer is ¥124,800."], "expected_answer": "6240", "actual_answer": "124800"}
{"question": "Liam hires a luxury car from 3 PM to 9 PM. He gets 1 hours free. The first paid hour is $13 and each hour after that is twice the cost. How much did he pay?", "index": 4471, "lines": ["Answer: \nThe total time Liam used the car is from 3 PM to 9 PM, which is 6 hours. Since he gets 1 hour free, he needs to pay for 5 hours. The first hour costs $13, and each additional hour is twice that rate, which is $26. \n\nCalculating the cost:\n- First hour: $13\n- Next 4 hours: 4 * $26 = $104\n- Total cost: $13 + $104 = $117\n\nThe answer is $117."], "expected_answer": "117", "actual_answer": "117"}
{"question": "Keisha has a flower bed that is 192 feet long. Keisha wants to fill her flower bed with plants. Keisha's flowers grow 7 feet wide so she needs to leave 12.0 feet between every plant. Keisha already owns 10 flowers. Each flowering plant costs $11 at the store, how much money will Keisha spend at the store to fill up her flower bed?", "index": 2267, "lines": ["Answer: \nTo determine how many plants Keisha needs, calculate the space each plant requires: 7 feet (width) + 12 feet (space) = 19 feet per plant. Divide the total bed length by this space: 192 ÷ 19 ≈ 10.105. Since she can't have a fraction of a plant, round up to 11 plants. She already has 10, so she needs to buy 1 more.\n\nThe answer is 11 feet."], "expected_answer": "66", "actual_answer": "11"}
{"question": "Xavier places bananas on some baskets. Each basket can hold 24 bananas. If he has 294 bananas and 12 baskets, how many bananas won't he be able to place on the basket?", "index": 608, "lines": ["Answer: \nStep: Calculate the total number of bananas that can be placed in the baskets by multiplying the number of bananas per basket by the number of baskets.\n\nTotal bananas that can be placed = 24 bananas/basket × 12 baskets = 288 bananas\n\nThe answer is 288 bananas."], "expected_answer": "6", "actual_answer": "288"}
{"question": "Qasim hires a limousine from 2 PM to 11 PM. He gets 2 hours free. The first paid hour is ₣40 and each hour after that is twice the cost. How much did he pay?", "index": 4467, "lines": ["Answer: \nThe total time is 9 hours, minus 2 free hours, leaving 7 paid hours. The first paid hour costs ₣40, and each subsequent hour costs twice the initial rate, which is ₣80. Therefore, the cost is calculated as 40 + 6*80.\n\nThe answer is 520."], "expected_answer": "520", "actual_answer": "520"}
{"question": "Beatriz has six times as many TikTok friends as Haruka. Leon has ten times as many friends on TikTok as Haruka. If Beatriz has 24 friends on TikTok, how many TikTok friends does Leon have?", "index": 4514, "lines": ["Answer: \nThe next step is to calculate Leon's friends by multiplying Haruka's friends by 10: Leon = 10 × 4 = 40.\n\nThe answer is 40."], "expected_answer": "40", "actual_answer": "40"}
{"question": "A lasagna has 36 servings. If Ava can eat 3 servings a day while Yuki can eat five times as much, how many days will the lasagna last?", "index": 1890, "lines": ["Answer: \nYuki eats 5 times as much as Ava, so Yuki eats 5 * 3 = 15 servings per day. Together, they eat 3 + 15 = 18 servings per day. \n\nThe answer is 2 days."], "expected_answer": "2", "actual_answer": "2"}
{"question": "There are 24 girls in the park. If there are 1/2 the number of boys in the park, how many kids are in the park?", "index": 2214, "lines": ["Answer: \nThe number of boys is half of the girls, so boys = 24 / 2 = 12. The total number of kids is girls + boys = 24 + 12 = 36.\n\nThe answer is 36."], "expected_answer": "36", "actual_answer": "36"}
{"question": "Tariq wants to make different sized ice cubes with 348 grams of water. He can make giant cubes that use 12 grams per cube, medium cubes that use 11 grams, and small cubes that use 1/8 of gram. If he makes 10 giant cubes, 24 small cubes, and 13 medium cubes, how many grams of water does he have left?", "index": 567, "lines": ["Called LLM to parse answer, got The answer is 82.", "Answer: \nTariq uses water as follows:\n- Giant cubes: 10 × 12g = 120g\n- Medium cubes: 13 × 11g = 143g\n- Small cubes: 24 × (1/8)g = 3g\n\nTotal water used = 120g + 143g + 3g = 266g\n\nThe answer is 348g - 266g = 82g left."], "expected_answer": "82", "actual_answer": "82"}
{"question": "Ava has a flower bed that is 169 meters long. Ava wants to fill her flower bed with plants. Ava's flowers grow 3 meters wide so she needs to leave 13.0 meters between every plant. Ava already owns 12 flowers. Each flowering plant costs ₣8 at the store, how much money will Ava spend at the store to fill up her flower bed?", "index": 2283, "lines": ["Answer: \nTo determine how many additional plants Ava needs, calculate the total number of plants that fit in 169 meters considering each plant takes 3 meters and requires 13 meters between them. Using the formula:  \nTotal plants = 1 + (169 - 3) / (3 + 13) = 13 plants.  \nAva already has 12 flowers, so she needs to buy 1 more plant.  \n\nThe answer is 8 euros."], "expected_answer": "8", "actual_answer": "8"}
{"question": "Alejandro went to buy some school supplies. He bought 14 crayons which cost ₣9.0 each, 8 pencils which cost ₣13.75 each, and a rim of bond paper which cost ₣23. How much did Alejandro spend on everything?", "index": 943, "lines": ["Round 0:\nCalculate the total cost for each item:\n\n1. Crayons: 14 × ₣9.00 = ₣126.00  \n2. Pencils: 8 × ₣13.75 = ₣110.00  \n3. Bond paper: ₣23.00  \n\nNext, add these amounts together to find the total expenditure.", "Answer: \nThe next step is to sum the totals of each item:  \nTotal expenditure = ₣126.00 + ₣110.00 + ₣23.00 = ₣259.00  \n\nThe answer is 259 [numerical answer]."], "expected_answer": "259", "actual_answer": "259"}
{"question": "Elena makes coffee using teaspoons of sugar and cups of water in the ratio of 80:70. If she used a total of 600 teaspoons of sugar and cups of water, calculate the number of teaspoonfuls of sugar she used.", "index": 280, "lines": ["Answer: \nThe next step is to set up the equation based on the ratio and total amount used.\n\nStep 2: Let the number of sugar be \\(80x\\) and water be \\(70x\\).  \nTotal: \\(80x + 70x = 150x = 600\\)  \nThus, \\(x = 4\\)  \n\nThe answer is 320."], "expected_answer": "320", "actual_answer": "320"}
{"question": "James places olives on some plates. Each plate can hold 22 olives. If he has 345 olives and 11 plates, how many olives won't he be able to place on the plate?", "index": 642, "lines": ["Answer: \nStep 1: Calculate the total number of olives that can be placed on the plates by multiplying the number of plates by the capacity per plate.\n\\[\n11 \\text{ plates} \\times 22 \\text{ olives/plate} = 242 \\text{ olives}\n\\]\n\nStep 2: Subtract the total number of olives that can be placed on the plates from the total number of olives James has to find out how many olives won't fit.\n\\[\n345 \\text{ olives} - 242 \\text{ olives} = 103 \\text{ olives}\n\\]\n\nThe answer is 103 olives."], "expected_answer": "103", "actual_answer": "103"}
{"question": "A class of 195 students has various hobbies. 112 like to play music, 15 like to play basketball, and the rest like to either dance or play video games. How many like to dance if the number that like to play video games is twice the number that prefer playing basketball?", "index": 186, "lines": ["Answer: \nThe total number of students is 195. Subtract those who like music (112) and basketball (15) to find the remaining students who like dancing or video games: 195 - 112 - 15 = 68 students. Since the number of students who like video games is twice the number who like basketball (15 * 2 = 30), subtract this from the remaining students to find those who like dancing: 68 - 30 = 38.\n\nThe answer is 38."], "expected_answer": "38", "actual_answer": "38"}
{"question": "A group of 171 students has various hobbies. 7 like to play video games, 43 like to play hurling, and the rest like to either paint or read. How many like to paint if the number that like to read is twice the number that prefer playing hurling?", "index": 161, "lines": ["Answer: \nThe total number of students is 171. Subtract the number of students who like video games (7) and hurling (43) to find those who like painting or reading: 171 - 7 - 43 = 121. Since the number who like reading is twice those who like hurling, calculate 2 × 43 = 86. Subtract the number who like reading from the remaining group: 121 - 86 = 35. \n\nThe answer is 35 students like to paint."], "expected_answer": "35", "actual_answer": "35"}
{"question": "Liam has 6 ₣20 bills. He buys 11 coloring books for ₣4 each. He also buys 3 packs of trading cards for ₣2 each. How much money does he have left?", "index": 2604, "lines": ["Answer: \nStep 1: Calculate the total money Liam has.\n\\[\n6 \\times 20 = 120 \\text{ pesos}\n\\]\n\nThe answer is 120."], "expected_answer": "70", "actual_answer": "120"}
{"question": "Keisha and Yara are sisters from Stockholm who love collecting signatures from movie stars. During their winter break from school, the sisters spend every afternoon collecting signatures. After 4 weeks, Keisha and Yara compare their autograph books, counting up the number of signatures each sister has collected. Keisha has 16 signatures in her book, and Yara has 45. The sisters have 3 more weeks of winter break, and they decide they want to reach 90 signatures between them by the end of the break. How many signatures do the sisters need to collect to reach their goal?", "index": 1660, "lines": ["Answer: \nThe next step is to calculate the total number of signatures Keisha and Yara currently have together and then determine how many more signatures are needed to reach their goal of 90.\n\nStep-by-step explanation:\n1. Add Keisha's and Yara's current signatures: 16 + 45 = 61.\n2. Subtract the current total from the goal: 90 - 61 = 29.\n\nThe answer is 29."], "expected_answer": "29", "actual_answer": "29"}
{"question": "At the beginning of the gathering, there were 72 doctors and 33 engineers. After 45 minutes, three-fifths of the total number of people left. How many engineers are left if 30 doctors stayed at the gathering?", "index": 4122, "lines": ["Answer: \nThe total number of people initially is 72 doctors + 33 engineers = 105 people. After 45 minutes, 3/5 of 105 left, which is 63 people. Since 30 doctors remained, 72 - 30 = 42 doctors left. Therefore, all 63 people who left were doctors, and no engineers left. \n\nThe number of engineers left is 33.\n\nThe answer is 33."], "expected_answer": "12", "actual_answer": "33"}
{"question": "There are 7 periods in the day for a normal student but Oliver has to take 2 extra classes. Each class is 40 minutes long. He goes to class for 4 days a week. He then spends three-sixths of his weekly minutes each on Saturday and Sunday as extra learning time. How many hours a week does he spend learning?", "index": 3928, "lines": ["Called LLM to parse answer, got The answer is 10.67.", "Answer: \nThe next step is to calculate the extra learning time Oliver spends on weekends. He dedicates three-sixths (half) of his weekly extra class minutes (320 minutes) to each of Saturday and Sunday. \n\n- Weekend learning time per day: \\( \\frac{3}{6} \\times 320 = 160 \\) minutes.\n- Total weekend learning time: \\( 160 \\times 2 = 320 \\) minutes.\n\nThe answer is 10 2/3 hours (or 10.67 hours)."], "expected_answer": "48", "actual_answer": "10.67"}
{"question": "At the beginning of the party, there were 65 teachers and 10 nurses. After two hours, one-fifth of the total number of people left. How many nurses are left if 18 teachers stayed at the party?", "index": 4118, "lines": ["Answer: \nTotal number of people at the beginning: 65 teachers + 10 nurses = 75 people.  \nNumber of people who left: \\( \\frac{1}{5} \\times 75 = 15 \\).  \nRemaining people: \\( 75 - 15 = 60 \\).  \nNumber of teachers remaining: 18.  \nNumber of nurses remaining: \\( 60 - 18 = 42 \\).  \n\nThe answer is 42."], "expected_answer": "42", "actual_answer": "42"}
{"question": "Alejandro caught 7 trouts last Saturday, the first trout he caught weighs 56 kgs, the second trout he caught weighs 37 kgs, and the last trout he caught weighs 31 kgs. If a kg of trout costs €2.0, how much will he earn after selling all the trouts to the market?", "index": 3836, "lines": ["Answer: \nThe next step is to sum the weights of the trouts: 56 kg + 37 kg + 31 kg = 124 kg. Then, multiply by the price per kg: 124 kg × €2.0/kg = €248.\n\nThe answer is €248."], "expected_answer": "496", "actual_answer": "248"}
{"question": "An uncle eats 3 tacos per day, his spouse eats 8 tacos per day, and their grandchild eats 7 tacos per day. How many tacos does this family eat in one week?", "index": 1307, "lines": ["Answer: \nFirst, determine the number of tacos each family member consumes in a week by multiplying their daily consumption by 7. Then, sum these amounts to find the total weekly consumption.\n\nThe answer is 126 tacos."], "expected_answer": "126", "actual_answer": "126"}
{"question": "There are 39 girls in the field. If there are two-sixths the number of boys in the field, how many kids are in the field?", "index": 2205, "lines": ["Answer: \nThe problem states there are 39 girls in the field and the number of boys is two-sixths of the number of girls. \n\nStep-by-step explanation:\n\n1. **Identify the number of girls:** There are 39 girls in the field.\n\n2. **Determine the fraction of boys relative to girls:** The number of boys is two-sixths (which simplifies to one-third) the number of girls.\n\n3. **Calculate the number of boys:**\n   \\[\n   \\text{Number of boys} = \\frac{1}{3} \\times 39 = 13\n   \\]\n\n4. **Find the total number of kids:**\n   \\[\n   \\text{Total kids} = \\text{Number of girls} + \\text{Number of boys} = 39 + 13 = 52\n   \\]\n\nThe answer is 52."], "expected_answer": "52", "actual_answer": "52"}
{"question": "Prof. Brown sold his villa for $580000. He paid the registration fees that amount to 2% of the selling price and also paid a agent fee that is 4% of the selling price. If he also paid $170000 for the remaining loan amount of the villa, how much is Prof. Brown's net proceeds from selling the villa?", "index": 1705, "lines": ["Answer: \nFirst, calculate the total fees: registration fee is 2% of $580,000 = $11,600, and agent fee is 4% of $580,000 = $23,200. Total fees = $11,600 + $23,200 = $34,800. \n\nNext, add the loan payment of $170,000 to the total fees: $34,800 + $170,000 = $204,800. \n\nFinally, subtract the total expenses ($204,800) from the selling price ($580,000) to find the net proceeds: $580,000 - $204,800 = $375,200.\n\nThe answer is 375200."], "expected_answer": "375200", "actual_answer": "375200"}
{"question": "Arjun and Luis are currently 6 years apart in age. If Arjun, who is younger than Luis, is 15 years old, what's the average of their ages?", "index": 1588, "lines": ["Answer: \nLuis is 6 years older than Arjun, so Luis's age is 15 + 6 = 21. The average of their ages is (15 + 21) / 2 = 18. \n\nThe answer is 18."], "expected_answer": "18", "actual_answer": "18"}
{"question": "At Theo's house, there are two times as many oranges as corns. He has a total of 33 corns in his house. Theo bought 75 more corns at the store and 45 fewer oranges than the number of corns. Find the combined total of the number of oranges and corns Theo has in the house?", "index": 4594, "lines": ["Answer: \nThe next logical step is to find the number of oranges Theo bought. Since he bought 45 fewer oranges than the number of corns after purchase, which is 108, the number of oranges bought is 108 - 45 = 63. \n\nThe answer is 237."], "expected_answer": "204", "actual_answer": "237"}
{"question": "In a 30-item quiz, 50% of the questions are biology, and the rest are equally divided as economics and chemistry questions. If Gabrielle is sure to get 60% of the biology questions, and a fifth of the economics and chemistry questions correctly, how many points is she sure to get?", "index": 969, "lines": ["Answer: \nFirst, calculate the number of biology, economics, and chemistry questions. 50% of 30 is 15 biology questions, leaving 15 for economics and chemistry, which are equally divided into 7.5 each.\n\nNext, determine the points from each category:\n- Biology: 60% of 15 = 9 points\n- Economics: 1/5 of 7.5 = 1.5 points\n- Chemistry: 1/5 of 7.5 = 1.5 points\n\nTotal points = 9 + 1.5 + 1.5 = **12**\n\nThe answer is **12**."], "expected_answer": "12", "actual_answer": "12"}
{"question": "Benjamin collects garbage from 4 different apartment complexes. The first 3 have 400 apartments each and the last one is 55% bigger than the other 3 combined. Benjamin collects garbage 4 times a week from each place and he gets paid ₣0.25 per collection for each apartment. How much money does he make in a week?", "index": 2452, "lines": ["Answer: \nBenjamin collects garbage 4 times a week from each of the 4 complexes. The first 3 complexes have 400 apartments each, totaling 1,200 apartments. The fourth complex is 55% larger than the combined 1,200 apartments, which is 1,200 + (0.55 * 1,200) = 1,860 apartments. The total number of apartments is 1,200 + 1,860 = 3,060. He collects garbage 4 times a week, so the total collections per week are 4 * 4 = 16. He is paid $0.25 per collection per apartment. Therefore, his weekly earnings are 16 * 3,060 * $0.25.\n\nThe answer is $12,240."], "expected_answer": "3060", "actual_answer": "12240"}
{"question": "Sakura can peel 6 carrots a minute and saute 30 carrots in 5 minutes. How long will it take her to peel and saute 150 carrots?", "index": 2443, "lines": ["Answer: \nThe next step is to calculate the time required for each task separately and then sum them up.\n\nStep 3: Calculate the time needed for peeling and sautéing separately.\n\n- Peeling: 150 carrots / 6 carrots per minute = 25 minutes\n- Sautéing: 150 carrots / 30 carrots per 5 minutes = 25 minutes\n\nThe answer is 50 minutes."], "expected_answer": "50", "actual_answer": "50"}
{"question": "Thiago and Fatima have 84 minutes to walk to the cinema together. It takes them 11 minutes to get to the corner where the mall is. It takes them another 43 minutes to get to the library. How much longer do they have to get to cinema without being late?", "index": 722, "lines": ["Answer: \nThe next step is to calculate the total time already spent, which is 11 minutes to the mall plus 43 minutes to the library, totaling 54 minutes. Subtract this from the available 84 minutes: 84 - 54 = 30 minutes.\n\nThe answer is 30."], "expected_answer": "30", "actual_answer": "30"}
{"question": "Deshawn went to buy some school supplies. He bought 16 rulers which cost $5.5 each, 6 erasers which cost $15.5 each, and a rim of bond paper which cost $22. How much did DeShawn spend on everything?", "index": 908, "lines": ["Answer: \nThe next step is to calculate the total cost for each item and then sum them up.  \n- Cost of rulers: \\(16 \\times \\$5.5 = \\$88\\)  \n- Cost of erasers: \\(6 \\times \\$15.5 = \\$93\\)  \n- Cost of bond paper: \\$22  \nTotal spent: \\$88 + \\$93 + \\$22 = \\$203  \n\nThe answer is 203."], "expected_answer": "203", "actual_answer": "203"}
{"question": "Ali caught 6 trouts last Wednesday, the first trout he caught weighs 51 kilograms, the second trout he caught weighs 45 kilograms, and the last trout he caught weighs 21 kilograms. If a kilogram of trout costs $0.5, how much will he earn after selling all the trouts to the market?", "index": 3818, "lines": ["Answer: \nThe total weight of the trouts is calculated by adding their individual weights: 51 kg + 45 kg + 21 kg = 117 kg. Since each kilogram sells for $0.5, the earnings are 117 kg * $0.5/kg = $58.5.\n\nThe answer is 58.5."], "expected_answer": "90", "actual_answer": "58.5"}
{"question": "Mohammed caught 5 steelheads last Tuesday, the first steelhead he caught weighs 64 kgs, the second steelhead he caught weighs 48 kgs, and the last steelhead he caught weighs 23 kgs. If a kg of steelhead costs €1.0, how much will he earn after selling all the steelheads to the market?", "index": 3807, "lines": ["Called LLM to parse answer, got The answer is #### 135.00.", "Answer: \nTotal weight of steelheads = 64 kg + 48 kg + 23 kg = 135 kg  \nEarnings = Total weight × Price per kg = 135 kg × €1.00/kg = €135.00  \n\nThe answer is €135.00"], "expected_answer": "181", "actual_answer": "135"}
{"question": "Faisal caught 4 cods last Friday, the first cod he caught weighs 47 kgs, the second cod he caught weighs 55 kgs, and the last cod he caught weighs 24 kgs. If a kg of cod costs ¥1.0, how much will he earn after selling all the cods to the market?", "index": 3802, "lines": ["Answer: \nThe next step is to calculate the total weight of all the cods caught by Faisal and then multiply by the cost per kilogram to find his earnings.\n\nStep-by-step explanation:\n\n1. Sum the weights of the cods: 47 kg + 55 kg + 24 kg = 126 kg.\n2. Multiply the total weight by the cost per kilogram: 126 kg * ¥1.0/kg = ¥126.\n\nThe answer is ¥126."], "expected_answer": "150", "actual_answer": "126"}
{"question": "It takes Nadia 26 minutes to finish a jigsaw puzzle and 11 minutes to finish a word puzzle. Over the vacation she solved 2 jigsaw puzzles and 8 word puzzles. How much time did she spend playing these games?", "index": 3415, "lines": ["Answer: \nStep 1: Calculate the total time spent on jigsaw puzzles by multiplying the time per puzzle by the number solved: 26 minutes/puzzle × 2 puzzles = 52 minutes.  \nStep 2: Calculate the total time spent on word puzzles by multiplying the time per puzzle by the number solved: 11 minutes/puzzle × 8 puzzles = 88 minutes.  \nStep 3: Add the times from steps 1 and 2 to find the total time spent: 52 minutes + 88 minutes = 140 minutes.  \n\nThe answer is 140 minutes."], "expected_answer": "140", "actual_answer": "140"}
{"question": "Quinn has a flower bed that is 189 meters long. Quinn wants to fill her flower bed with plants. Quinn's flowers grow 5 meters wide so she needs to leave 13.5 meters between every plant. Quinn already owns 13 flowers. Each flowering plant costs ₣8 at the store, how much money will Quinn spend at the store to fill up her flower bed?", "index": 2263, "lines": ["Answer: \nQuinn needs to determine how many plants she needs to fill her 189-meter bed. Each plant plus the required spacing (5 meters + 13.5 meters) takes up 18.5 meters. The number of plants is calculated by dividing the total length by the space per plant, but Quinn already owns 13 flowers. \n\nStep-by-step calculation:\n1. Total space per plant including spacing: 5 + 13.5 = 18.5 meters.\n2. Total number of plants needed: 189 / 18.5 ≈ 10.21, which rounds up to 11 plants.\n3. Since Quinn already has 13 plants, she doesn’t need to buy any more.\n\nThe answer is 0."], "expected_answer": "8", "actual_answer": "0"}
{"question": "Alejandro collects garbage from 6 different apartment complexes. The first 5 have 200 apartments each and the last one is 45% bigger than the other 5 combined. Alejandro collects garbage 2 times a week from each place and he gets paid $0.25 per collection for each apartment. How much money does he make in a week?", "index": 2490, "lines": ["Answer: \nThe total number of apartments across all complexes is calculated by adding the first five (5 × 200 = 1000) and the sixth, which is 45% larger than the combined first five (1000 × 1.45 = 1450). Combining these gives 2450 apartments.\n\nThe total number of collections per week is 2 collections per complex × 6 complexes = 12 collections. Each collection covers all apartments in that complex, so the total collections are 2 × (200 × 5 + 1450) = 4900 apartment collections.\n\nAlejandro is paid $0.25 per collection, so his weekly earnings are 4900 × $0.25 = $1225.\n\nThe answer is $1225."], "expected_answer": "1225", "actual_answer": "1225"}
{"question": "Uma went to the coast for vacation. Her parents gave her ₣1300 to buy whatever she wanted. At the seaside store, cotton candy was on sale for \"Buy 15 kgs at ₣21 per kg, get 5 kgs 2/3 off.\" She scooped up 22 kgs. She also bought a mixed bag of coral pieces for ₣11.75 and 17 pins that were ₣21.25 each. How much money does Uma have left?", "index": 2026, "lines": ["Answer: \nThe answer is 535."], "expected_answer": "535", "actual_answer": "535"}
{"question": "There are 8 girls in the yard. If there are three-fourths the number of boys in the yard, how many kids are in the yard?", "index": 2219, "lines": ["Answer: \nThe number of girls is 8, which is three-fourths the number of boys. To find the number of boys, divide both sides by (3/4):\n\nBoys = 8 ÷ (3/4) = 8 × (4/3) = 32/3 ≈ 10.67\n\nSince the number of boys should be a whole number, this suggests a possible error in the problem statement. Assuming the problem is correct, the total number of kids would be:\n\nGirls + Boys = 8 + 32/3 = 56/3 ≈ 18.67\n\nHowever, since the total must be a whole number, there might be an inconsistency in the given information. Based on the calculations, the total number of kids is approximately 19.\n\nThe answer is 19."], "expected_answer": "14", "actual_answer": "19"}
{"question": "A care facility has a capacity of 1000 beds with 1/10 occupied. Due to the pandemic, 55 patients are admitted into the care facility each day. Calculate the total number of unoccupied beds in the care facility after 2 weeks.", "index": 1417, "lines": ["Answer: \nStep 1: Calculate initial occupied beds:\n1/10 of 1000 beds = 100 beds.\n\nStep 2: Determine initial unoccupied beds:\n1000 beds - 100 occupied beds = 900 unoccupied beds.\n\nStep 3: Calculate total patients admitted in 2 weeks:\n55 patients/day * 14 days = 770 patients.\n\nStep 4: Find total occupied beds after 2 weeks:\n100 initial + 770 admitted = 870 occupied beds.\n\nStep 5: Calculate unoccupied beds after 2 weeks:\n1000 total - 870 occupied = 130 unoccupied beds.\n\nThe answer is 130."], "expected_answer": "130", "actual_answer": "130"}
{"question": "Xena went to the boardwalk for vacation. Her parents gave her ₺1200 to buy whatever she wanted. At the gift shop, saltwater taffy was on sale for \"Buy 16 pounds at ₺20 per pound, get 5 pounds 1/4 off.\" She scooped up 23 pounds. She also bought a mixed bag of starfish for ₺11.5 and 14 keychains that were ₺20.75 each. How much money does Xena have left?", "index": 2020, "lines": ["Round 0:\nLet's calculate the cost of the keychains.  \n14 keychains × ₺20.75 each = ₺290.50", "Round 1:\nThe next step is to calculate the cost of the saltwater taffy.  \nShe bought 23 pounds. The first 16 pounds cost 16 × ₺20 = ₺320. The next 5 pounds are 1/4 off, so 5 × ₺20 × 0.75 = ₺75. The remaining 2 pounds cost 2 × ₺20 = ₺40.  \nTotal taffy cost = ₺320 + ₺75 + ₺40 = ₺435.", "Answer: \nThe next step is to calculate the total amount spent by adding the costs of the keychains, saltwater taffy, and the starfish.\n\nTotal spent = ₺290.50 (keychains) + ₺435 (taffy) + ₺11.50 (starfish) = ₺737.00  \nThe answer is 1200 - 737 = ₺463.00. The answer is ₺463."], "expected_answer": "463", "actual_answer": "463"}
{"question": "The Williams family is busy making muffins. So far, they've made 9925 muffins. They have 1085 peanut butter muffins, 2051 lemon muffins, and some vanilla muffins. How many vanilla muffins have they made?", "index": 4195, "lines": ["Answer: \nNext step: Subtract the number of peanut butter and lemon muffins from the total muffins to find the vanilla muffins.\n\nCalculation: 9925 - 1085 - 2051 = 6809.\n\nThe answer is 6809."], "expected_answer": "6789", "actual_answer": "6809"}
{"question": "There are 9 periods in the day for a normal student but Arjun has to take 1 extra classes. Each class is 55 minutes long. He goes to class for 6 days a week. He then spends 1/2 of his weekly minutes each on Saturday and Sunday as extra learning time. How many hours a week does he spend learning?", "index": 3929, "lines": ["Answer: \nThe total number of periods Arjun attends in a week is 10 periods/day * 6 days = 60 periods. Each period is 55 minutes, so 60 periods * 55 minutes/period = 3300 minutes. He spends an additional 1/2 of his weekly class minutes on Saturday and Sunday, which is (3300 / 2) * 2 = 3300 minutes. Adding this to his class time: 3300 + 3300 = 6600 minutes. \n\nThe answer is 110 hours."], "expected_answer": "110", "actual_answer": "110"}
{"question": "Mia's aunt said that she had ₺300 budgeted for her birthday party. She wants to make sure she and her friends all get to play one round of laser tag, have ₺5 in pinball tokens, and get to ride the roller coaster seven times. A round of laser tag is ₺10. The roller coaster cost ₺5 a ride. How many friends can she invite?", "index": 4800, "lines": ["Answer: \nThe next step is to set up an equation based on the total costs. The total cost for laser tag, pinball tokens, and roller coaster rides should not exceed ₺300. \n\nTotal cost = (10 + 5)*(f + 1) + 35 = 15(f + 1) + 35 = 300. \n\nThe answer is 16 friends.\n\nStep-by-step explanation:\n1. Calculate the cost per person for laser tag and pinball: ₺10 + ₺5 = ₺15 per person.\n2. Multiply by the number of people (Mia + f friends): 15*(f + 1).\n3. Add the roller coaster cost: 15(f + 1) + 35.\n4. Set the total equal to the budget: 15(f + 1) + 35 = 300.\n5. Solve for f: 15(f + 1) = 265 → f + 1 = 17.666 → f = 16.666. Since only whole friends can be invited, Mia can invite 16 friends.\n\nThe answer is 16 friends."], "expected_answer": "5", "actual_answer": "16"}
{"question": "I have 19 liters of peach drink that are 2/5 water and I wish to add it to 24 liters of lemon drink that is one-half water. But as I pour it, I spill 4 liters of the peach drink. How much water is in the remaining 39 liters?", "index": 2981, "lines": ["Answer: \nStep 1: Calculate the remaining peach drink after spilling 4 liters.  \nRemaining peach drink = 19 liters - 4 liters = 15 liters.\n\nThe answer is 18 liters."], "expected_answer": "18", "actual_answer": "18"}
{"question": "If Jasmine and Leon have 220 feet of fence between them, and they agree to split it with Leon getting 90 feet more than Jasmine, how much is left over for Jasmine?", "index": 4294, "lines": ["Answer: \nLet J be the amount of fence Jasmine gets. Leon gets J + 90 feet.\n\nStep 2: Set up the equation J + (J + 90) = 220.\n\nThe answer is 65 feet left for Jasmine."], "expected_answer": "65", "actual_answer": "65"}
{"question": "Mrs. Smith is looking for a house that will not go beyond her $400000 budget. She saw a property that has a selling price of $350000. On top of that, the buyer has to pay a brokerage fee which is 7% of the selling price, and also the transfer fee that is 11% of the selling price. How much more is the total price of the house than Mrs. Smith's budget?", "index": 1623, "lines": ["Answer: \nThe next step is to calculate the total additional fees and then find out how much the total price exceeds the budget.\n\nStep 1: Calculate the brokerage fee and transfer fee.\nBrokerage Fee = 7% of $350,000 = $24,500\nTransfer Fee = 11% of $350,000 = $38,500\n\nStep 2: Add the fees to the selling price to find the total price.\nTotal Price = $350,000 + $24,500 + $38,500 = $413,000\n\nStep 3: Subtract the budget from the total price to find the excess.\nExcess Amount = $413,000 - $400,000 = $13,000\n\nThe answer is $13,000."], "expected_answer": "13000", "actual_answer": "13000"}
{"question": "A grandfather eats 8 hamburgers per day, his partner eats 5 hamburgers per day, and their son eats 6 hamburgers per day. How many hamburgers does this family eat in one week?", "index": 1311, "lines": ["Answer: \nLet's calculate the total number of hamburgers eaten by the family each day:\n\n- Grandfather: 8 hamburgers\n- Partner: 5 hamburgers\n- Son: 6 hamburgers\n\nTotal per day = 8 + 5 + 6 = 19 hamburgers\n\nNow, to find the total for one week (7 days):\n\nTotal in one week = 19 hamburgers/day × 7 days = 133 hamburgers\n\nThe answer is 133."], "expected_answer": "133", "actual_answer": "133"}
{"question": "Jamal was a pen pal with 5 people. He stopped being penpals with 2 of them. They each send 2 letters a week that are 10 pages long. He responds in kind. He can write a page every 12 minutes. How many hours does he spend writing a week?", "index": 3624, "lines": ["Answer: \nNext step: Calculate the total number of pages Jamal writes per week by multiplying the number of pen pals by the number of letters each sends and the number of pages per letter.\n\n3 pen pals * 2 letters/week * 10 pages/letter = 60 pages/week\n\nThe answer is 12 [hours]."], "expected_answer": "12", "actual_answer": "12"}
{"question": "Umar finished 1/3 of a 261 piece puzzle, and then started and finished another 398 piece puzzle within an hour. How many puzzle pieces did Umar place during that hour?", "index": 3982, "lines": ["Answer: \nThe next step is to calculate how many pieces Umar placed on the first puzzle by finding 1/3 of 261. \n\nStep-by-step explanation:\n\n1. Calculate 1/3 of 261 pieces:  \n   \\( \\frac{1}{3} \\times 261 = 87 \\) pieces.\n\n2. Add the pieces from the second puzzle:  \n   \\( 87 + 398 = 485 \\) pieces.\n\nThe answer is 485."], "expected_answer": "485", "actual_answer": "485"}
{"question": "Sanjay places almonds on some tables. Each table can hold 23 almonds. If he has 276 almonds and 7 tables, how many almonds won't he be able to place on the table?", "index": 625, "lines": ["Called LLM to parse answer, got The answer is 115.", "Answer: \nStep 1: Calculate the total number of almonds that can be placed on all tables by multiplying the number of almonds per table by the number of tables.\n\nNext step: Subtract the total almonds Sanjay has from the total almonds that can be placed on the tables to find how many almonds won't be placed.\n\nThe answer is 161 almonds can be placed, so 276 - 161 = 115 almonds won't be placed."], "expected_answer": "115", "actual_answer": "115"}
{"question": "Mia can run two times faster than she can walk, but she can skip at a rate of speed that is two-thirds as fast as she can run. If she can skip at 2 miles per hour, how many miles can she travel in 8 hours if she spends 1/2 of the time running and 1/2 of the time walking?", "index": 4422, "lines": ["Answer: \nFirst, find Mia's running speed. Since skipping is two-thirds of her running speed and equals 2 mph, her running speed is 3 mph. Her walking speed is half of that, so 1.5 mph. In 4 hours running, she covers 12 miles, and in 4 hours walking, she covers 6 miles. Total distance is 18 miles.\n\nThe answer is 18."], "expected_answer": "18", "actual_answer": "18"}
{"question": "Prof. Rodriguez sold his villa for $790000. He paid the registration fees that amount to 3% of the selling price and also paid a agent fee that is 4% of the selling price. If he also paid $340000 for the remaining loan amount of the villa, how much is Prof. Rodriguez's net proceeds from selling the villa?", "index": 1716, "lines": ["Answer: \nThe next step is to subtract the total fees and loan payment from the selling price to find the net proceeds. \n\nTotal fees: $55,300 (registration + agent)  \nLoan payment: $340,000  \nTotal expenses: $55,300 + $340,000 = $395,300  \n\nNet proceeds: $790,000 - $395,300 = $394,700  \n\nThe answer is 394700."], "expected_answer": "394700", "actual_answer": "394700"}
{"question": "Mohammed has 9 tubes of gray paint and 16 tubes of green paint. Oliver has four-sixths as many tubes of gray paint as Mohammed, and twice as many tubes of green paint as Mohammed. How many tubes of paint does Oliver have?", "index": 2878, "lines": ["Answer: \nLet's determine how many tubes of each color paint Oliver has.\n\nStep 1: Calculate the number of gray paint tubes Oliver has.\nOliver has four-sixths as many gray paint tubes as Mohammed. Since Mohammed has 9 gray paint tubes:\n4/6 of 9 = (4/6) × 9  \n= 6 gray paint tubes\n\nStep 2: Calculate the number of green paint tubes Oliver has.\nOliver has twice as many green paint tubes as Mohammed. Since Mohammed has 16 green paint tubes:\n2 × 16 = 32 green paint tubes\n\nStep 3: Find the total number of paint tubes Oliver has.\nAdd the number of gray and green paint tubes together:\n6 (gray) + 32 (green) = 38 total paint tubes\n\nThe answer is 38."], "expected_answer": "38", "actual_answer": "38"}
{"question": "Kayla is knitting winter wear for her 4 grandchildren. They're quadruplets, so they're all the same size. She wants to make a hat, poncho, cardigan, leg warmers, and socks for each of them. It takes 14 skeins of wool to make a hat, 18 for a poncho, 5 for a cardigan, 9 for a pair of leg warmers, and 3 for a pair of socks. How many skeins of wool will she need to buy?", "index": 1162, "lines": ["Answer: \nNext step: Calculate the total number of skeins needed per grandchild by adding the skeins required for each item.  \nTotal per grandchild = 14 (hat) + 18 (poncho) + 5 (cardigan) + 9 (leg warmers) + 3 (socks) = 49 skeins.  \n\nExplanation: Adding the skeins for each item gives the total needed per grandchild, which can then be multiplied by the number of grandchildren.  \n\nThe answer is 196."], "expected_answer": "196", "actual_answer": "196"}
{"question": "At the beginning of the conference, there were 64 doctors and 72 engineers. After half an hour, two-fourths of the total number of people left. How many engineers are left if 19 doctors stayed at the conference?", "index": 4127, "lines": ["Answer: \nThe next step is to calculate the number of engineers who left by subtracting the number of doctors who left from the total number of people who left. Since 45 doctors left, subtracting this from the 68 who left gives 23 engineers left. Then, subtracting the 23 engineers who left from the initial 72 engineers gives the number remaining.\n\nThe answer is 49 engineers."], "expected_answer": "49", "actual_answer": "49"}
{"question": "A loaf of bread at the store costs €8. Croissants cost €2 each. How much more do 5 loaves of bread cost than 3 croissants?", "index": 1901, "lines": ["Answer: \n5 loaves of bread cost €40 and 3 croissants cost €6. The difference is €40 - €6 = €34.\n\nThe answer is €34."], "expected_answer": "34", "actual_answer": "34"}
{"question": "A stack is made out of 4 white tiles, seven times as many purple tiles, and an unknown number of green tiles. If there are 44 tiles in the stack in total, how many green tiles are there?", "index": 2093, "lines": ["Called LLM to parse answer, got The answer is 12 [12].", "Round 0:\nThe next step is to calculate the number of purple tiles by multiplying the number of white tiles by 7.\n\nStep 2: Calculate the number of purple tiles.\nPurple tiles = 7 × White tiles = 7 × 4 = 28\n\nThe answer is 12 [12 green tiles].", "Called LLM to parse answer, got The answer is 12 [final numerical answer].", "Answer: \nStep 3: Calculate the number of green tiles by subtracting the white and purple tiles from the total.\n\nGreen tiles = Total tiles - White tiles - Purple tiles = 44 - 4 - 28 = 12\n\nThe answer is 12 [12 green tiles]."], "expected_answer": "12", "actual_answer": "12"}
{"question": "Mia went to the beach for vacation. Her parents gave her ₣1200 to buy whatever she wanted. At the souvenir store, fudge was on sale for \"Buy 15 kilograms at ₣22 per kilogram, get 4 kilograms 1/4 off.\" She scooped up 22 kilograms. She also bought a mixed bag of sand dollars for ₣11.25 and 15 postcards that were ₣20.25 each. How much money does Mia have left?", "index": 2002, "lines": ["Answer: \nMia bought 22 kilograms of fudge. The first 15 kg cost ₣22 each, totaling 15 * 22 = ₣330. The next 4 kg were 1/4 off, so each kg cost ₣16.5, totaling 4 * 16.5 = ₣66. The remaining 3 kg cost 3 * 22 = ₣66. The total for fudge is 330 + 66 + 66 = ₣462.  \n\nThe sand dollars cost ₣11.25, and the postcards cost 15 * 20.25 = ₣303.75.  \n\nTotal expenses: 462 + 11.25 + 303.75 = ₣777.  \n\nSubtracting from Mia's initial amount: 1200 - 777 = ₣423.  \n\nThe answer is 423."], "expected_answer": "423", "actual_answer": "423"}
{"question": "At Pavel's house, there are seven times as many bananas as grapes. He has a total of 34 grapes in his house. Pavel bought 53 more grapes at the store and 35 fewer bananas than the number of grapes. Find the combined total of the number of bananas and grapes Pavel has in the house?", "index": 4555, "lines": ["Answer: \nPavel initially has 34 grapes. After buying 53 more, he has 34 + 53 = 87 grapes.\n\nThe number of bananas is seven times the initial number of grapes: 7 × 34 = 238 bananas.\n\nHe bought 35 fewer bananas than the new number of grapes: 87 - 35 = 52 bananas.\n\nThe total number of bananas is 238 + 52 = 290 bananas.\n\nThe combined total of bananas and grapes is 290 + 87 = 377.\n\nThe answer is 377."], "expected_answer": "343", "actual_answer": "377"}
{"question": "Kai caught 6 trouts last Monday, the first trout he caught weighs 75 kgs, the second trout he caught weighs 41 kgs, and the last trout he caught weighs 24 kgs. If a kg of trout costs ¥1.75, how much will he earn after selling all the trouts to the market?", "index": 3832, "lines": ["Called LLM to parse answer, got The answer is 245.", "Answer: \nThe next step is to calculate the total weight of the trouts Kai caught by adding the weights of each trout:\n\n75 kg + 41 kg + 24 kg = 140 kg\n\nThis gives the total weight needed to calculate his earnings. \n\nThe answer is ¥245 (since 140 kg × ¥1.75/kg = ¥245)."], "expected_answer": "371", "actual_answer": "245"}
{"question": "A loaf of bread at the bakery costs ₺7. Bagels cost ₺4 each. How much more do 3 loaves of bread cost than 4 bagels?", "index": 1910, "lines": ["Answer: \nStep 1: Calculate the total cost for 3 loaves of bread.  \nStep 2: Calculate the total cost for 4 bagels.  \nStep 3: Subtract the total cost of bagels from the total cost of bread to find the difference.  \n\nThe answer is 5 [numerical answer]."], "expected_answer": "5", "actual_answer": "5"}
{"question": "At Leon's house, there are ten times as many figs as plums. He has a total of 65 plums in his house. Leon bought 59 more plums at the store and 47 fewer figs than the number of plums. Find the combined total of the number of figs and plums Leon has in the house?", "index": 4584, "lines": ["Answer: \nFirst, calculate the initial number of figs:  \nFigs = 10 × Plums = 10 × 65 = 650 figs.\n\nNext, calculate the new number of plums after buying more:  \nPlums = 65 + 59 = 124 plums.\n\nThen, calculate the new number of figs after buying fewer:  \nFigs = 650 + (124 - 47) = 650 + 77 = 727 figs.\n\nFinally, find the combined total:  \nTotal = 727 figs + 124 plums = 851.  \n\nThe answer is 851."], "expected_answer": "786", "actual_answer": "851"}
{"question": "Priya has a flower bed that is 175 feet long. Priya wants to fill her flower bed with plants. Priya's flowers grow 2 feet wide so she needs to leave 12.5 feet between every plant. Priya already owns 13 flowers. Each flowering plant costs ¥7 at the store, how much money will Priya spend at the store to fill up her flower bed?", "index": 2295, "lines": ["Answer: \nThe next step is to calculate how many plants Priya can fit in her flower bed. Given that each plant occupies 2 feet of space and requires 12.5 feet of spacing between plants, each plant effectively takes up 14.5 feet. Dividing the total length of the bed by the space per plant gives:\n\n175 feet ÷ 14.5 feet per plant ≈ 12.06 plants.\n\nSince Priya can only fit 12 whole plants, she needs to buy 12 plants. Subtracting the 13 plants she already owns, she doesn't need to buy any additional plants. Therefore, she won't spend any money.\n\nThe answer is ¥0."], "expected_answer": "7", "actual_answer": "0"}
{"question": "There are 6 periods in the day for a normal student but Jin has to take 2 extra classes. Each class is 35 minutes long. He goes to class for 6 days a week. He then spends one-eighth of his weekly minutes each on Saturday and Sunday as extra learning time. How many hours a week does he spend learning?", "index": 3925, "lines": ["Answer: \nThe next step is to calculate the total time Jin spends on learning each week, including both his classes and extra study time.\n\nStep-by-Step Explanation:\n1. Calculate daily learning time: 6 periods * 35 minutes = 210 minutes. Add 2 extra classes * 35 minutes = 70 minutes. Total = 280 minutes per day.\n2. Multiply by 6 days: 280 * 6 = 1,680 minutes.\n3. Calculate extra study time: (1,680 / 8) * 2 = 210 * 2 = 420 minutes.\n4. Total weekly learning time: 1,680 + 420 = 2,100 minutes.\n5. Convert to hours: 2,100 / 60 = 35 hours.\n\nThe answer is 35 hours."], "expected_answer": "35", "actual_answer": "35"}
{"question": "Camila has a flower bed that is 208 feet long. Camila wants to fill her flower bed with plants. Camila's flowers grow 2 feet wide so she needs to leave 16.0 feet between every plant. Camila already owns 11 flowers. Each flowering plant costs ₣3 at the store, how much money will Camila spend at the store to fill up her flower bed?", "index": 2292, "lines": ["Answer: \nCamila needs to determine how many plants she can fit in her 208-foot flower bed, considering each plant takes up 2 feet and requires 16 feet of space between them. The total space per plant is 18 feet. \n\nNumber of plants = Total length / Space per plant = 208 / 18 ≈ 11.56. Since she can't plant a fraction, she fits 11 plants. She already has 11, so she needs to buy 1 more. \n\nCost = 1 * 3 = 3.\n\nThe answer is 3."], "expected_answer": "6", "actual_answer": "3"}
{"question": "Ava operates the cash register exactly three times as fast as her less-experienced colleague Uma. Daily, Uma processes 61 customers. What is the total weekly production for the two if they work all days of the week?", "index": 4875, "lines": ["Called LLM to parse answer, got The answer is 1708.", "Answer: \nFirst, determine Ava's daily customer processing rate. Since Ava works three times as fast as Uma, and Uma processes 61 customers daily, Ava processes 61 × 3 = 183 customers daily.\n\nThe next step is to calculate the total number of customers processed by both Ava and Uma combined in one day:\n61 (Uma) + 183 (Ava) = 244 customers per day.\n\nThe answer is 244 × 7 = 1708 customers per week."], "expected_answer": "1708", "actual_answer": "1708"}
{"question": "The vending machines sell crackers for 85 cents and pretzels for 125 cents. Santiago spent ¥900 and got 5 bags of crackers and had 3% of his money left in change. How many pretzels did he buy?", "index": 4027, "lines": ["Answer: \nThe next step is to calculate the total amount Santiago spent after accounting for the change.  \n\n1. **Calculate the change:**  \n   Santiago had 3% of ¥900 left as change.  \n   Change = 0.03 × 900 = ¥27.\n\n2. **Determine the total amount spent:**  \n   Total spent = Total money - Change = 900 - 27 = ¥873.\n\nThe answer is 873."], "expected_answer": "695", "actual_answer": "873"}
{"question": "If Luis and Amelia have 620 yards of fence between them, and they agree to split it with Amelia getting 60 yards more than Luis, how much is left over for Luis?", "index": 4266, "lines": ["Answer: \nLet L be the amount of fence Luis gets. Amelia gets L + 60 yards. Together, L + (L + 60) = 620.\n\nThe next step is to solve for L:\n\n2L + 60 = 620  \n2L = 620 - 60  \n2L = 560  \nL = 280\n\nThe answer is 280 yards."], "expected_answer": "280", "actual_answer": "280"}
{"question": "Deshawn is rolling a d12 die. How much more likely is it (expressed as a percentage) that he rolls a number greater than 3 than that he rolls two odd numbers in a row?", "index": 122, "lines": ["Answer: \nThe probability of rolling a number greater than 3 on a d12 die is 3/4, and the probability of rolling two odd numbers in a row is 1/4. To find how much more likely the first event is compared to the second, we calculate the ratio: (3/4) / (1/4) = 3, which is 300% when expressed as a percentage.\n\nThe answer is 300% more likely."], "expected_answer": "50", "actual_answer": "300"}
{"question": "Kai has ₺63.11 and wants to buy 51 anchors from a bin at the hardware store. Each anchor costs ₺0.61. How much money does Kai have left after paying for the anchors?", "index": 1510, "lines": ["Called LLM to parse answer, got The answer is 32 [final numerical answer].", "Answer: \nStep 1: Calculate the total cost of 51 anchors by multiplying the number of anchors by the cost per anchor.\n51 * 0.61 = 31.11\n\nStep 2: Subtract the total cost from Kai's initial amount to find the remaining money.\n63.11 - 31.11 = 32.00\n\nThe answer is 32.00"], "expected_answer": "32", "actual_answer": "32"}
{"question": "Umar collects garbage from 3 different apartment complexes. The first 2 have 450 apartments each and the last one is 20% bigger than the other 2 combined. Umar collects garbage 2 times a week from each place and he gets paid ₣0.45 per collection for each apartment. How much money does he make in a week?", "index": 2450, "lines": ["Answer: \nStep 1: Calculate the number of apartments in the third complex.\n- The third complex is 20% bigger than the first two combined.\n- Combined apartments of the first two: 450 + 450 = 900.\n- 20% of 900: 0.20 * 900 = 180.\n- Total apartments in the third complex: 900 + 180 = 1080.\n\nStep 2: Find the total number of apartments.\n- Total apartments = 450 + 450 + 1080 = 1980.\n\nStep 3: Calculate the number of collections per week.\n- Umar collects garbage 2 times a week from each complex.\n- Total collections = 2 (collections per complex) * 3 (complexes) = 6 collections.\n\nStep 4: Determine the total earnings.\n- He gets paid ₣0.45 per collection per apartment.\n- Total earnings = 1980 apartments * 6 collections * ₣0.45 = ₣5,346.\n\nThe answer is 5346."], "expected_answer": "1782", "actual_answer": "5346"}
{"question": "Olivia receives 172 emails a day. 25% of those emails don't require any response. Olivia responds to the rest of them. How many emails does Olivia respond to in a 3 day work week?", "index": 1365, "lines": ["Answer: \nLet's break down the problem step by step.\n\n1. **Calculate the number of emails that don't require a response:**\n   - Total emails per day: 172\n   - Percentage of emails that don't require a response: 25%\n   - Calculation: 172 * 0.25 = 43 emails\n\n2. **Determine the number of emails that require a response:**\n   - Subtract the non-response emails from the total emails.\n   - Calculation: 172 - 43 = 129 emails\n\n3. **Calculate the total number of responded emails in a 3-day work week:**\n   - Multiply the daily responded emails by 3.\n   - Calculation: 129 * 3 = 387 emails\n\n**Answer:** Olivia responds to 387 emails in a 3-day work week.\n\nThe answer is 387."], "expected_answer": "387", "actual_answer": "387"}
{"question": "To make a call from a hotel room phone, you must pay €0.7 for each minute of your call. After 10 minutes, that price drops to €0.2 per minute. How much would a 60-minute call cost?", "index": 537, "lines": ["Answer: \nThe next step is to separate the call duration into two parts based on the pricing structure: the first 10 minutes at €0.70 per minute and the remaining 50 minutes at €0.20 per minute.\n\nThe cost for the first 10 minutes is 10 × €0.70 = €7.00.\n\nThe cost for the next 50 minutes is 50 × €0.20 = €10.00.\n\nAdding these together, the total cost is €7.00 + €10.00 = €17.00.\n\nThe answer is €17.00."], "expected_answer": "17", "actual_answer": "17"}
{"question": "When the water is cold Gabrielle swims a mile in 22 minutes. When the water is warm Gabrielle swims a mile in 6 minutes more than two times as long. How much longer does Gabrielle take to swim 6 miles on a hot day than a cold day?", "index": 4681, "lines": ["Answer: \nNext Step: Calculate the total time Gabrielle takes to swim 6 miles on both a cold and a warm day, then find the difference.\n\nCold day time: 6 miles * 22 minutes/mile = 132 minutes  \nWarm day time: 6 miles * 50 minutes/mile = 300 minutes  \nDifference: 300 minutes - 132 minutes = 168 minutes  \n\nThe answer is 168 minutes longer."], "expected_answer": "168", "actual_answer": "168"}
{"question": "Sophia has a flower bed that is 203 feet long. Sophia wants to fill her flower bed with plants. Sophia's flowers grow 6 feet wide so she needs to leave 14.5 feet between every plant. Sophia already owns 10 flowers. Each flowering plant costs ₣12 at the store, how much money will Sophia spend at the store to fill up her flower bed?", "index": 2275, "lines": ["Answer: \nThe next step is to calculate the total number of plants needed by dividing the flower bed length by the space each plant requires.  \nStep: 203 ÷ (6 + 14.5) = 203 ÷ 20.5 ≈ 9.902, which rounds up to 10 plants.  \nExplanation: This determines how many plants fit in the bed.  \n\nThe answer is ₣120."], "expected_answer": "48", "actual_answer": "120"}
{"question": "At Qasim's house, there are ten times as many bananas as pears. He has a total of 88 pears in his house. Qasim bought 77 more pears at the store and 44 fewer bananas than the number of pears. Find the combined total of the number of bananas and pears Qasim has in the house?", "index": 4581, "lines": ["Answer: \nQasim originally has 88 pears, so he has 88 × 10 = 880 bananas. After buying 77 more pears, he has 88 + 77 = 165 pears. He buys 77 - 44 = 33 bananas, so his total bananas become 880 + 33 = 913. Adding bananas and pears: 913 + 165 = 1078.\n\nThe answer is 1078."], "expected_answer": "1078", "actual_answer": "1078"}
{"question": "When the water is cold James swims a mile in 26 minutes. When the water is warm James swims a mile in 5 minutes more than two times as long. How much longer does James take to swim 6 miles on a hot day than a cold day?", "index": 4663, "lines": ["Answer: \nTo determine how much longer James takes to swim 6 miles on a hot day, first calculate the time per mile in warm water: 2 × 26 + 5 = 57 minutes. Then find the total time for 6 miles in both conditions: cold = 6 × 26 = 156 minutes, warm = 6 × 57 = 342 minutes. Finally, subtract the cold time from the warm time: 342 - 156 = 186 minutes. The answer is 186."], "expected_answer": "186", "actual_answer": "186"}
{"question": "There are 9 periods in the day for a normal student but Liam has to take 3 extra classes. Each class is 30 minutes long. He goes to class for 5 days a week. He then spends one-third of his weekly minutes each on Saturday and Sunday as extra learning time. How many hours a week does he spend learning?", "index": 3908, "lines": ["Answer: \nCalculate Liam's weekly extra learning time:  \nHe spends one-third of his 450-minute weekly class time each on Saturday and Sunday.  \nExtra time per day = (1/3) * 450 = 150 minutes.  \nTotal extra time = 150 + 150 = 300 minutes.  \n\nThe answer is 12.5 hours."], "expected_answer": "50", "actual_answer": "12.5"}
{"question": "Noah caught 5 salmons last Monday, the first salmon he caught weighs 78 pounds, the second salmon he caught weighs 50 pounds, and the last salmon he caught weighs 25 pounds. If a pound of salmon costs ¥2.0, how much will he earn after selling all the salmons to the market?", "index": 3843, "lines": ["Answer: \nThe answer is 306 ¥."], "expected_answer": "406", "actual_answer": "306"}
{"question": "Mia is popping popcorn for a snack. As the pot of kernels heats up, the kernels start popping faster. 10 pop in the first 16 seconds of cooking, then 2 times that amount in the next 16 seconds. The kernels increase to 4 times the initial popping rate in the next 16 seconds, but in the final 16 seconds, the popping slows down to half the rate as the past 16 seconds. After Mia takes the pot off the heat, a quarter of the number of kernels that popped in the final 16 seconds of cooking also pop from the residual heat. How many pieces of popcorn does Mia have to eat?", "index": 248, "lines": ["Answer: \nThe next step is to calculate the residual popping after Mia removes the pot from the heat. Since 20 kernels popped in the final 16 seconds, a quarter of these (20 / 4) will pop from residual heat.\n\nResidual popping: 20 / 4 = 5 kernels.\n\nTotal popped: 10 + 20 + 40 + 20 + 5 = 95 kernels.\n\nThe answer is 95."], "expected_answer": "95", "actual_answer": "95"}
{"question": "Yuki caught 6 steelheads last Wednesday, the first steelhead he caught weighs 68 kilograms, the second steelhead he caught weighs 53 kilograms, and the last steelhead he caught weighs 27 kilograms. If a kilogram of steelhead costs €1.0, how much will he earn after selling all the steelheads to the market?", "index": 3820, "lines": ["Answer: \nLet's calculate the total weight of the steelheads:\n\n68 kg + 53 kg + 27 kg = 148 kg\n\nThe answer is 148 kilograms."], "expected_answer": "229", "actual_answer": "148"}
{"question": "If Diego eats 3 eggs a day for 74 days and then increases it to 6 eggs a day for 93 days, how many dozens of eggs will Diego need for 167 days?", "index": 4977, "lines": ["Answer: \nDiego eats 3 eggs/day for 74 days: 3 * 74 = 222 eggs.  \nThen, he eats 6 eggs/day for 93 days: 6 * 93 = 558 eggs.  \nTotal eggs: 222 + 558 = 780 eggs.  \nConvert to dozens: 780 / 12 = 65 dozens.  \n\nThe answer is 65 dozens."], "expected_answer": "65", "actual_answer": "65"}
{"question": "Nadia can run six times faster than she can walk, but she can skip at a rate of speed that is 1/3 as fast as she can run. If she can skip at 4 miles per hour, how many miles can she travel in 4 hours if she spends two-fourths of the time running and 2/4 of the time walking?", "index": 4434, "lines": ["Round 0:\nFirst, determine Nadia's walking speed. Since her skipping speed is 4 mph, which is 1/3 of her running speed, her running speed is 12 mph. Her walking speed is 12 mph divided by 6, which equals 2 mph.", "Answer: \nThe next step is to calculate the distance she travels while running and walking separately, then sum them for the total distance.\n\nRunning distance: 12 mph * 2 hours = 24 miles  \nWalking distance: 2 mph * 2 hours = 4 miles  \nTotal distance: 24 + 4 = 28 miles  \n\nThe answer is 28 miles."], "expected_answer": "28", "actual_answer": "28"}
{"question": "Gabrielle walks 35 miles every day on her favorite walking trail, which includes 19 miles of walking on the beach and 16 miles of walking on the sidewalk. On the sidewalk, Gabrielle walks at two times the rate of speed that she does on the beach. If 57 minutes of her walk is spent on the beach, how long does it take for her to complete the entire 35-mile walk, in minutes?", "index": 853, "lines": ["Round 0:\nGabrielle walks 19 miles on the beach in 57 minutes. To find her walking speed on the beach:\n\nBeach speed = Distance / Time = 19 miles / 57 minutes ≈ 0.333 miles per minute.\n\nThe next logical step is to calculate her speed on the sidewalk, which is twice her beach speed.\n\nSidewalk speed = 2 × Beach speed = 2 × 0.333 ≈ 0.667 miles per minute.\n\nThis step calculates her faster walking speed on the sidewalk, enabling us to determine the time spent on the sidewalk next.", "Answer: \nSidewalk time = Distance / Speed = 16 miles / 0.667 miles per minute ≈ 24 minutes.\n\nThe answer is 81 minutes."], "expected_answer": "81", "actual_answer": "81"}
{"question": "Luca collects garbage from 3 different apartment complexes. The first 2 have 450 apartments each and the last one is 80% bigger than the other 2 combined. Luca collects garbage 2 times a week from each place and he gets paid ₣0.35 per collection for each apartment. How much money does he make in a week?", "index": 2494, "lines": ["Answer: \nLet's calculate the total number of apartments in the first two complexes:\n\nCombined apartments in the first two complexes = 450 + 450 = 900 apartments.\n\nSince the third complex is 80% bigger than the combined number of the first two, we can calculate its size as follows:\n\nNumber of apartments in the third complex = 900 + (0.80 × 900) = 900 + 720 = 1620 apartments.\n\nNow that we have the number of apartments in all three complexes, we can find the total number of apartments Luca services:\n\nTotal apartments = 900 + 1620 = 2520 apartments.\n\nNext, we'll calculate how many times Luca collects garbage from these apartments in a week.\n\nThe answer is 2520 apartments."], "expected_answer": "1764", "actual_answer": "2520"}
{"question": "Kai's car breaks down. The car weighs 1450 pounds and he has luggage in it weighing 325 pounds. He also has his 3 young children who weigh 75 pounds each in it. If the force to move the car is 1% of the weight, how much force does he need to push the car?", "index": 3398, "lines": ["Answer: \nThe total weight of the car, luggage, and children is calculated by adding 1450 pounds (car) + 325 pounds (luggage) + (3 × 75 pounds) (children) = 2000 pounds. The force needed is 1% of this weight, which is 0.01 × 2000 = 20 pounds.\n\nThe answer is 20."], "expected_answer": "20", "actual_answer": "20"}
{"question": "Esteban wants to make different sized ice cubes with 334 ounces of water. He can make giant cubes that use 12 ounces per cube, medium cubes that use 11 ounces, and small cubes that use 1/3 of ounce. If he makes 10 giant cubes, 15 small cubes, and 13 medium cubes, how many ounces of water does he have left?", "index": 554, "lines": ["Answer: \nThe next step is to calculate the total amount of water used for each type of cube and then subtract that from the initial amount of water to find out how much is left.\n\n1. Calculate water used for giant cubes: \\(10 \\text{ cubes} \\times 12 \\text{ ounces/cube} = 120 \\text{ ounces}\\)\n2. Calculate water used for medium cubes: \\(13 \\text{ cubes} \\times 11 \\text{ ounces/cube} = 143 \\text{ ounces}\\)\n3. Calculate water used for small cubes: \\(15 \\text{ cubes} \\times \\frac{1}{3} \\text{ ounce/cube} = 5 \\text{ ounces}\\)\n4. Add them up: \\(120 + 143 + 5 = 268 \\text{ ounces}\\)\n5. Subtract from total water: \\(334 - 268 = 66 \\text{ ounces}\\)\n\nThe answer is 66 ounces."], "expected_answer": "66", "actual_answer": "66"}
{"question": "A new virus infects 18 people. Every day, each infected person infects 4 others. How many people are infected after 3 days?", "index": 4936, "lines": ["Answer: \nThe next step is to calculate the total number of infected people after each day by multiplying the current number of infected individuals by 5 (since each infected person infects 4 others). \n\nStep-by-step explanation:\n\n1. **Day 0:** 18 infected people.\n2. **Day 1:** 18 * 5 = 90 infected people.\n3. **Day 2:** 90 * 5 = 450 infected people.\n4. **Day 3:** 450 * 5 = 2250 infected people.\n\nThe answer is 2250."], "expected_answer": "2250", "actual_answer": "2250"}
{"question": "Esteban collects garbage from 3 different apartment complexes. The first 2 have 100 apartments each and the last one is 50% bigger than the other 2 combined. Esteban collects garbage 2 times a week from each place and he gets paid ₣0.4 per collection for each apartment. How much money does he make in a week?", "index": 2455, "lines": ["Answer: \nThe third complex is 50% bigger than the first two combined. The first two have 100 each, so combined they have 200 apartments. 50% of 200 is 100, so the third complex has 200 + 100 = 300 apartments.\n\nThe answer is 300 [number of apartments]."], "expected_answer": "400", "actual_answer": "300"}
{"question": "Isabella was preparing for a game night at her house, where she intended to serve grilled salmon. She noticed that she was out of plastic spoons, so she bought a new package of spoons. Later, her husband also bought a package of 16 new spoons and gave them to Isabella. While Isabella was making the grilled salmon, she used five of the spoons to sample her grilled salmon. Later, when she went to set the table, she had a total of 23 spoons. How many spoons were in the package that Isabella bought?", "index": 1115, "lines": ["Answer: \nIsabella had 23 spoons left after using 5. This means before using, she had 23 + 5 = 28 spoins. Since her husband gave her 16, the number in her package is 28 - 16 = 12.\n\nThe answer is 12."], "expected_answer": "12", "actual_answer": "12"}
{"question": "Viktor has 25 hectares of plum field. There are 71 plums per hectare. Viktor can harvest his plums every 12 months. How many plums can Viktor harvest within a year?", "index": 330, "lines": ["Answer: \nThe next step is to calculate the total number of plums by multiplying the number of hectares by plums per hectare:  \n25 hectares × 71 plums/hectare = 1775 plums.  \n\nThe answer is 1775."], "expected_answer": "1775", "actual_answer": "1775"}
{"question": "Ravi places almonds on some tables. Each table can hold 37 almonds. If he has 328 almonds and 7 tables, how many almonds won't he be able to place on the table?", "index": 604, "lines": ["Answer: \nStep 1: Calculate the total number of almonds that can be placed on all tables by multiplying the number of tables (7) by the number of almonds each table can hold (37).\n  \n  Total almonds that can be placed = 7 tables × 37 almonds/table = 259 almonds\n\nStep 2: Determine how many almonds will not be placed by subtracting the total almonds that can be placed on the tables from the total number of almonds Ravi has (328).\n  \n  Almonds that won't be placed = 328 almonds - 259 almonds = 69 almonds\n\nThe answer is 69 almonds."], "expected_answer": "69", "actual_answer": "69"}
{"question": "Oliver caught 7 trouts last Thursday, the first trout he caught weighs 58 pounds, the second trout he caught weighs 40 pounds, and the last trout he caught weighs 28 pounds. If a pound of trout costs ₺0.5, how much will he earn after selling all the trouts to the market?", "index": 3815, "lines": ["Answer: \nThe next step is to calculate the total weight of all the trouts Oliver caught by adding the individual weights together.\n\nStep-by-step explanation:\n1. Add the weights of the trouts: 58 + 40 + 28 = 126 pounds.\n2. Multiply the total weight by the cost per pound to find the total earnings: 126 * 0.5 = 63.\n\nThe answer is 63."], "expected_answer": "119", "actual_answer": "63"}
{"question": "Wei is rolling a 6-sided die. How much more likely is it (expressed as a percentage) that he rolls a number greater than 3 than that he rolls two even numbers in a row?", "index": 110, "lines": ["Answer: \nThe probability of rolling a number greater than 3 on a single roll is 50%, and the probability of rolling two even numbers in a row is 25%. The difference in likelihood is 25 percentage points.\n\nThe answer is 25% more likely."], "expected_answer": "25", "actual_answer": "25"}
{"question": "Leilani operates the cash register exactly eight times as fast as her less-experienced colleague Chen. Daily, Chen processes 68 customers. What is the total weekly production for the two if they work all days of the week?", "index": 4857, "lines": ["Answer: \nThe next step is to calculate Leilani's daily customer processing rate.\n\nStep-by-step explanation:\n1. Since Leilani is eight times faster than Chen, multiply Chen's daily rate by 8 to find Leilani's daily rate:\n   Leilani's daily rate = 8 * 68 = 544 customers per day.\n\n2. Now, add both daily rates to find the combined daily production:\n   Combined daily rate = 68 (Chen) + 544 (Leilani) = 612 customers per day.\n\n3. Multiply the combined daily rate by 7 to find the weekly production:\n   Weekly production = 612 * 7 = 4284 customers per week.\n\nThe answer is 4284."], "expected_answer": "4284", "actual_answer": "4284"}
{"question": "If Gabriel and Oscar have 580 yards of fence between them, and they agree to split it with Oscar getting 190 yards more than Gabriel, how much is left over for Gabriel?", "index": 4253, "lines": ["Answer: \nLet Gabriel's share be \\( G \\) yards. Oscar's share is \\( G + 190 \\) yards. Together, \\( G + (G + 190) = 580 \\).\n\nThe next step is to combine like terms:\n\n\\( 2G + 190 = 580 \\)\n\nThe answer is 195 yards."], "expected_answer": "195", "actual_answer": "195"}
{"question": "Dr. Martinez sold his cottage for $680000. He paid the legal fees that amount to 3% of the selling price and also paid a realtor fee that is 2% of the selling price. If he also paid $500000 for the remaining loan amount of the cottage, how much is Dr. Martinez's net proceeds from selling the cottage?", "index": 1713, "lines": ["Answer: \nStep 1: Calculate the legal fees:  \n$680,000 (selling price) × 3% = $20,400  \n\nStep 2: Calculate the realtor fee:  \n$680,000 × 2% = $13,600  \n\nStep 3: Calculate the total deductions:  \n$20,400 (legal fees) + $13,600 (realtor fee) + $500,000 (loan amount) = $534,000  \n\nStep 4: Subtract the total deductions from the selling price to find net proceeds:  \n$680,000 - $534,000 = $146,000  \n\nThe answer is $146,000."], "expected_answer": "146000", "actual_answer": "146000"}
{"question": "Luis works a 7-hour shift each day, 4 days a week. He earns ₺25 per hour and gets a ₺554 bonus each week if the company performs well. How much money did Luis make in March if the company performed very well for the whole month?", "index": 3002, "lines": ["Answer: \nLuis works 7 hours a day, 4 days a week, earning ₺25 per hour, plus a ₺554 weekly bonus. To find his March earnings:\n\n1. Calculate daily earnings: 7 hours × ₺25/hour = ₺175.\n2. Multiply by days worked per week: 4 days × ₺175/day = ₺700 weekly wage.\n3. Add the weekly bonus: ₺700 + ₺554 = ₺1,254 per week.\n4. Determine the number of weeks in March: 31 days ÷ 4 days/week ≈ 7.75 weeks.\n5. Calculate total earnings: 7 weeks × ₺1,254/week = ₺8,778.\n\nThe answer is ₺8,778."], "expected_answer": "5016", "actual_answer": "8778"}
{"question": "Bodhi collects garbage from 3 different apartment complexes. The first 2 have 200 apartments each and the last one is 60% bigger than the other 2 combined. Bodhi collects garbage 2 times a week from each place and he gets paid ¥0.3 per collection for each apartment. How much money does he make in a week?", "index": 2451, "lines": ["Called LLM to parse answer, got The answer is 624 [final numerical answer].", "Answer: \nThe third apartment complex has 640 apartments, calculated by taking 60% of the combined first two complexes (400) which is 240, added to 400.  \nTotal apartments: 200 + 200 + 640 = 1040.  \nBodhi collects twice a week, so total collections: 1040 * 2 = 2080.  \nPayment per collection: ¥0.3.  \nTotal earnings: 2080 * 0.3 = ¥624.\n\nThe answer is 624 [¥624]."], "expected_answer": "624", "actual_answer": "624"}
{"question": "A fog bank rolls in from the ocean to cover a city. It takes 63 minutes to cover every 13 miles of the city. If the city is 39 miles across from the oceanfront to the opposite inland edge, how many minutes will it take for the fog bank to cover the whole city?", "index": 52, "lines": ["Answer: \nThe fog covers 13 miles in 63 minutes, so the time per mile is 63/13 minutes. Multiply this by the total distance (39 miles): (63/13) * 39 = 189 minutes.\n\nThe answer is 189 minutes."], "expected_answer": "189", "actual_answer": "189"}
{"question": "Xena can run ten times faster than she can walk, but she can skip at a rate of speed that is four-fifths as fast as she can run. If she can skip at 8 miles per hour, how many miles can she travel in 6 hours if she spends 1/3 of the time running and four-sixths of the time walking?", "index": 4417, "lines": ["Answer: \nXena's walking speed is 1 mph, running speed is 10 mph. She spends 2 hours running and 4 hours walking.  \nDistance running: 10 mph * 2 hours = 20 miles.  \nDistance walking: 1 mph * 4 hours = 4 miles.  \nTotal distance: 20 + 4 = 24 miles.  \n\nThe answer is 24 miles."], "expected_answer": "24", "actual_answer": "24"}
{"question": "At Leon's house, there are ten times as many apples as bananas. He has a total of 93 bananas in his house. Leon bought 42 more bananas at the store and 25 fewer apples than the number of bananas. Find the combined total of the number of apples and bananas Leon has in the house?", "index": 4592, "lines": ["Answer: \nFirst, calculate the number of bananas after buying more: 93 + 42 = 135 bananas.\n\nNext, determine the number of apples bought: 135 - 25 = 110 apples.\n\nFind the initial number of apples: 10 × 93 = 930 apples.\n\nAdd the newly bought apples to the initial count: 930 + 110 = 1040 apples.\n\nFinally, add the total apples and bananas: 1040 + 135 = 1175.\n\nThe answer is 1175."], "expected_answer": "1082", "actual_answer": "1175"}
{"question": "A cleaner has to clean a hospital with 140 floors. They have 10 days to get it done. It takes them 30 minutes per floor. If they work 10 hours each day, what percentage of their day, on average, is spent cleaning floors?", "index": 1990, "lines": ["Answer: \nThe cleaner can clean 20 floors per day (10 hours ÷ 0.5 hours per floor). To clean 140 floors, it will take them 7 days (140 ÷ 20). \n\nThe answer is 100%"], "expected_answer": "70", "actual_answer": "100"}
{"question": "Sakura walks 25 kilometers every day on her favorite walking trail, which includes 13 kilometers of walking on the beach and 12 kilometers of walking on the sidewalk. On the sidewalk, Sakura walks at three times the rate of speed that she does on the beach. If 65 minutes of her walk is spent on the beach, how long does it take for her to complete the entire 25-kilometer walk, in minutes?", "index": 888, "lines": ["Answer: \nSakura's speed on the beach is calculated by dividing the beach distance (13 km) by the beach time (65 minutes). Converting 65 minutes to hours gives approximately 1.0833 hours. Her beach speed is 13 km / 1.0833 hours ≈ 12 km/h. Since her sidewalk speed is three times faster, it is 36 km/h. The time spent on the sidewalk is 12 km / 36 km/h = 1/3 hours = 20 minutes. Adding the beach time (65 minutes) and sidewalk time (20 minutes) gives a total walking time of 85 minutes.\n\nThe answer is 85 minutes."], "expected_answer": "85", "actual_answer": "85"}
{"question": "One miner can mine 5 pounds of ore per day with bare hands. He can mine two times as much with a nickel pickaxe and 30% more with a steel pickaxe than with a nickel pickaxe. How many pounds of ore can 21 miners with steel pickaxes mine in a month with 28 days?", "index": 2910, "lines": ["Called LLM to parse answer, got The answer is 7644.", "Answer: \nThe next step is to calculate the daily ore mined by one miner with a steel pickaxe. Since a nickel pickaxe allows mining twice as much (5 * 2 = 10 pounds) and a steel pickaxe adds 30% more, the steel pickaxe mining rate is 10 + (0.3 * 10) = 13 pounds per day.\n\nThe answer is 21 miners * 13 pounds/day * 28 days = 7,644 pounds."], "expected_answer": "7644", "actual_answer": "7644"}
{"question": "To make a call from a hotel room phone, you must pay ¥0.5 for each minute of your call. After 30 minutes, that price drops to ¥0.4 per minute. How much would a 65-minute call cost?", "index": 516, "lines": ["Answer: \nThe call duration is split into two parts: the first 30 minutes at ¥0.5 per minute and the remaining 35 minutes at ¥0.4 per minute.  \nCost for the first 30 minutes: 30 × ¥0.5 = ¥15.  \nCost for the remaining 35 minutes: 35 × ¥0.4 = ¥14.  \nTotal cost: ¥15 + ¥14 = ¥29.  \nThe answer is 29."], "expected_answer": "29", "actual_answer": "29"}
{"question": "Elena has €72.2 and wants to buy 42 nails from a bin at the home improvement store. Each nail costs €0.1. How much money does Elena have left after paying for the nails?", "index": 1529, "lines": ["Answer: \nMultiply the number of nails by the cost per nail: 42 nails × €0.1 per nail = €4.2.\n\nThe answer is €4.2."], "expected_answer": "68", "actual_answer": "4.2"}
{"question": "There are 9 periods in the day for a normal student but Arash has to take 3 extra classes. Each class is 45 minutes long. He goes to class for 6 days a week. He then spends one-sixth of his weekly minutes each on Saturday and Sunday as extra learning time. How many hours a week does he spend learning?", "index": 3921, "lines": ["Answer: \nThe next step is to calculate the total time Arash spends in extra classes during the week and determine the additional study time on weekends.\n\n1. Calculate daily extra class time: 3 classes * 45 minutes = 135 minutes.\n2. Calculate weekly extra class time: 135 minutes/day * 6 days = 810 minutes.\n3. Determine weekend study time: 810 minutes * (1/6) = 135 minutes.\n4. Add weekend study time to weekly class time: 810 minutes + 135 minutes = 945 minutes.\n5. Convert total minutes to hours: 945 ÷ 60 = 15.75 hours.\n\nThe answer is 15.75 hours."], "expected_answer": "72", "actual_answer": "15.75"}
{"question": "Gabriel caught 5 trouts last Friday, the first trout he caught weighs 43 kilograms, the second trout he caught weighs 45 kilograms, and the last trout he caught weighs 28 kilograms. If a kilogram of trout costs ¥0.5, how much will he earn after selling all the trouts to the market?", "index": 3848, "lines": ["Called LLM to parse answer, got The answer is 58.", "Answer: \nLet's calculate the total weight of the trouts Gabriel caught:\n\nTotal weight = 43 kg + 45 kg + 28 kg = 116 kg\n\nNow, to find out how much Gabriel will earn, multiply the total weight by the cost per kilogram:\n\nEarnings = 116 kg * ¥0.5/kg = ¥58\n\nThe answer is 58 ¥58."], "expected_answer": "86", "actual_answer": "58"}
{"question": "According to its nutritional info, a bag of cookies has 150 calories per serving. If a 200 oz bag has 5 servings, how many oz can you eat if your daily calorie target is 2300 and you have already consumed 800 calories?", "index": 1228, "lines": ["Answer: \nEach serving is 40 oz. The maximum calories allowed are 1500, so the number of servings you can eat is 1500 / 150 = 10 servings. Since the bag only has 5 servings, you can eat all 200 oz.\n\nThe answer is 200 oz."], "expected_answer": "400", "actual_answer": "200"}
{"question": "A maintenance worker has to clean a university with 130 rooms. They have 5 days to get it done. It takes them 15 minutes per room. If they work 13 hours each day, what percentage of their day, on average, is spent cleaning rooms?", "index": 1977, "lines": ["Answer: \nThe total time required to clean all rooms is calculated by multiplying the number of rooms (130) by the time per room (15 minutes): 130 × 15 = 1950 minutes. The worker's daily work time is 13 hours, which converts to 13 × 60 = 780 minutes. To find the percentage of time spent cleaning, divide the cleaning time by the total work time and multiply by 100: (1950 / 780) × 100 = 250%.\n\nThe answer is 250%"], "expected_answer": "50", "actual_answer": "250"}
{"question": "Oakwood High School is holding graduation in their Auditorium this year which has space for 7800 people. After accounting for 1100 seats for graduates and 100 seats for faculty attending, how many tickets would each graduate receive to give to their friends and family if the tickets are split equally?", "index": 2324, "lines": ["Answer: \nThe next step is to calculate the remaining seats available for friends and family.\n\nTotal seats = 7800  \nSeats for graduates = 1100  \nSeats for faculty = 100  \n\nRemaining seats = Total seats - (Seats for graduates + Seats for faculty)  \nRemaining seats = 7800 - (1100 + 100) = 7800 - 1200 = 6600  \n\nNow, divide the remaining seats equally among the graduates to find out how many tickets each graduate can give to their friends and family.  \n\nThe answer is 6600 ÷ 1100 = 6.  \nThe answer is #### 6."], "expected_answer": "6", "actual_answer": "6"}
{"question": "Camila sliced a whole kiwi into 32 pieces. She ate 3 slices, her sister ate 7 more than her, and her friend ate 9 more than her sister. How many slices of kiwi did they all eat?", "index": 2737, "lines": ["Answer: \nThe next step is to calculate how many slices each person ate and then sum them up. Camila ate 3 slices, her sister ate 7 more than Camila (3 + 7 = 10 slices), and her friend ate 9 more than her sister (10 + 9 = 19 slices). Adding all together: 3 + 10 + 19 = 32 slices.\n\nThe answer is 32."], "expected_answer": "32", "actual_answer": "32"}
{"question": "There are 6 periods in the day for a normal student but Sanjay has to take 3 extra classes. Each class is 35 minutes long. He goes to class for 6 days a week. He then spends 2/4 of his weekly minutes each on Saturday and Sunday as extra learning time. How many hours a week does he spend learning?", "index": 3941, "lines": ["Answer: \nThe next step is to calculate the total weekly class time by multiplying the daily class time by the number of school days.\n\nDaily class time = 9 periods/day × 35 minutes/period = 315 minutes/day  \nWeekly class time = 315 minutes/day × 6 days = 1,890 minutes  \n\nThe answer is 1,890 minutes."], "expected_answer": "63", "actual_answer": "1890"}
{"question": "Leilani and Pavel have 136 minutes to walk to the park together. It takes them 17 minutes to get to the corner where the library is. It takes them another 57 minutes to get to the mall. How much longer do they have to get to park without being late?", "index": 736, "lines": ["Answer: \nThe total time available is 136 minutes. They have already spent 17 + 57 = 74 minutes. The remaining time to reach the park is 136 - 74 = 62 minutes.\n\nThe answer is 62."], "expected_answer": "62", "actual_answer": "62"}
{"question": "The biggest waterslide at Aqua Adventure is 320 meters long, and people slide down at 40 meters/minute. The second biggest waterslide is 240 meters long, but steeper, so people slide down at 60 meters/minute. How much longer does it take to ride the biggest slide compared to the second biggest slide?", "index": 4393, "lines": ["Answer: \nTo determine how much longer the biggest slide takes, calculate the time for each slide using time = distance/speed.  \n- Biggest slide: 320 ÷ 40 = 8 minutes.  \n- Second biggest slide: 240 ÷ 60 = 4 minutes.  \n- Difference: 8 - 4 = 4 minutes.  \n\nThe answer is 4 minutes."], "expected_answer": "4", "actual_answer": "4"}
{"question": "There are 7 periods in the day for a normal student but Sanjay has to take 1 extra classes. Each class is 45 minutes long. He goes to class for 4 days a week. He then spends two-fourths of his weekly minutes each on Saturday and Sunday as extra learning time. How many hours a week does he spend learning?", "index": 3923, "lines": ["Answer: \nThe next step is to calculate the time Sanjay spends on extra learning during weekends. He spends two-fourths of his weekly minutes each on Saturday and Sunday. \n\nStep: Calculate extra learning time = 2/4 * 180 minutes = 90 minutes per day.\n\nThe answer is 6 hours."], "expected_answer": "48", "actual_answer": "6"}
{"question": "According to its nutritional info, a bag of breads has 425 calories per serving. If a 150 ounces bag has 5 servings, how many ounces can you eat if your daily calorie target is 2250 and you have already consumed 1400 calories?", "index": 1220, "lines": ["Answer: \nThe next step is to calculate how many ounces you can eat based on your remaining calorie budget.  \n1. Determine remaining calories: 2250 - 1400 = 850 calories.  \n2. Find how many servings fit into 850 calories: 850 ÷ 425 = 2 servings.  \n3. Convert servings to ounces: 2 servings × (150 ounces / 5 servings) = 60 ounces.  \n\nThe answer is 60 ounces."], "expected_answer": "60", "actual_answer": "60"}
{"question": "Winnie went to the cafe and bought various types of treats. She bought 2 dozen danishes which cost $20 per dozen, 9 dozen tarts which cost $88 per dozen, and 8 dozen scones for $118 per dozen. How much was the total cost?", "index": 1831, "lines": ["Answer: \nThe answer is 1776 [numerical answer]."], "expected_answer": "1776", "actual_answer": "1776"}
{"question": "At Xavier's house, there are eight times as many bananas as oranges. He has a total of 28 oranges in his house. Xavier bought 63 more oranges at the store and 26 fewer bananas than the number of oranges. Find the combined total of the number of bananas and oranges Xavier has in the house?", "index": 4551, "lines": ["Called LLM to parse answer, got The answer is 352.", "Answer: \nXavier initially has 28 oranges, so the number of bananas is 8 * 28 = 224. After buying 63 more oranges, he has 28 + 63 = 91 oranges. He buys 26 fewer bananas than oranges, so he buys 63 - 26 = 37 bananas. Now, the total bananas are 224 + 37 = 261. The combined total of bananas and oranges is 91 + 261 = 352.\n\nThe answer is 352"], "expected_answer": "352", "actual_answer": "352"}
{"question": "On Thursday, Carlos wants to exercise for four times the amount of time he did on Wednesday and Tuesday combined. On Tuesday he exercised for 52 minutes. On Wednesday he exercised for 30 minutes. How many minutes does he have to exercise on Thursday to reach his goal?", "index": 3478, "lines": ["Answer: \nCarlos's goal is to exercise on Thursday for four times the combined total of his exercise time on Tuesday and Wednesday.\n\n**Step:**  \nCalculate the total exercise time from Tuesday and Wednesday:  \n52 minutes (Tuesday) + 30 minutes (Wednesday) = 82 minutes.\n\n**Next Step:**  \nMultiply the combined time by 4 to find Thursday's exercise time.  \n82 minutes × 4 = 328 minutes.\n\nThe answer is 328 minutes."], "expected_answer": "328", "actual_answer": "328"}
{"question": "Faisal wants to make different sized ice cubes with 346 grams of water. He can make giant cubes that use 13 grams per cube, medium cubes that use 12 grams, and small cubes that use 2/3 of gram. If he makes 8 giant cubes, 15 small cubes, and 14 medium cubes, how many grams of water does he have left?", "index": 594, "lines": ["Answer: \nThe next step is to calculate the total grams of water used by multiplying the number of each cube type by their respective water usage and then summing them up.\n\n1. Calculate water used for giant cubes: 8 cubes × 13 grams = 104 grams  \n2. Calculate water used for medium cubes: 14 cubes × 12 grams = 168 grams  \n3. Calculate water used for small cubes: 15 cubes × (2/3) gram = 10 grams  \n4. Sum all water usage: 104 + 168 + 10 = 282 grams  \n\nSubtract the total water used (282 grams) from the initial amount (346 grams) to find the remaining water.  \n\nThe answer is 64 grams."], "expected_answer": "64", "actual_answer": "64"}
{"question": "There are 8 periods in the day for a normal student but Gabriel has to take 1 extra classes. Each class is 50 minutes long. He goes to class for 5 days a week. He then spends five-sixths of his weekly minutes each on Saturday and Sunday as extra learning time. How many hours a week does he spend learning?", "index": 3904, "lines": ["Answer: \nThe next step is to calculate Gabriel's total learning time by adding his school time and extra learning time, then convert the total minutes into hours.\n\nTotal time = 2250 minutes (school) + 3750 minutes (weekend) = 6000 minutes  \nConvert to hours: 6000 / 60 = 100 hours\n\nThe answer is 100 hours."], "expected_answer": "100", "actual_answer": "100"}
{"question": "Winnie has a flower bed that is 203 meters long. Winnie wants to fill her flower bed with plants. Winnie's flowers grow 2 meters wide so she needs to leave 14.5 meters between every plant. Winnie already owns 10 flowers. Each flowering plant costs ₺11 at the store, how much money will Winnie spend at the store to fill up her flower bed?", "index": 2277, "lines": ["Answer: \nTo determine how many plants Winnie needs, calculate the space each plant requires including spacing: 2 meters + 14.5 meters = 16.5 meters per plant.  \nDivide the flower bed length by this space: 203 ÷ 16.5 ≈ 12.301, so Winnie can fit 12 plants.  \nSince she already has 10 flowers, she needs to buy 12 - 10 = 2 more plants.  \n\nThe answer is 22 ₺."], "expected_answer": "44", "actual_answer": "22"}
{"question": "Gabriel's van breaks down. The van weighs 1150 kilograms and he has groceries in it weighing 450 kilograms. He also has his 4 young friends who weigh 95 kilograms each in it. If the force to move the van is 5% of the weight, how much force does he need to push the van?", "index": 3387, "lines": ["Answer: \nTo determine the total weight, sum the van's weight, groceries, and friends: 1150 kg + 450 kg + (4 × 95 kg) = 1980 kg.\n\nNext, calculate 5% of the total weight to find the force needed:  \nForce = 0.05 × 1980 kg = 99 kg.\n\nThe answer is 99 newtons."], "expected_answer": "99", "actual_answer": "99"}
{"question": "Hiroshi was a pen pal with 13 people. He stopped being penpals with 3 of them. They each send 3 letters a week that are 11 pages long. He responds in kind. He can write a page every 8 minutes. How many hours does he spend writing a week?", "index": 3626, "lines": ["Answer: \nHiroshi has 13 pen pals and stops with 3, leaving him with 10 active pen pals. Each of these 10 sends 3 letters a week, totaling 30 letters. Each letter is 11 pages long, so he needs to write 330 pages. At 8 minutes per page, he spends 2640 minutes, which is 44 hours. \n\nThe answer is 44 hours."], "expected_answer": "44", "actual_answer": "44"}
{"question": "Daphne has a flower bed that is 175 meters long. Daphne wants to fill her flower bed with plants. Daphne's flowers grow 2 meters wide so she needs to leave 12.5 meters between every plant. Daphne already owns 13 flowers. Each flowering plant costs ₺5 at the store, how much money will Daphne spend at the store to fill up her flower bed?", "index": 2269, "lines": ["Answer: \nTo determine how many additional flowers Daphne needs to purchase, calculate the total number of flowers required to fill the 175-meter bed with 2-meter-wide plants spaced 12.5 meters apart. Once the total number is known, subtract the 13 flowers she already owns to find the number of new flowers needed. Multiply this number by ₺5 to find the total cost.\n\nTotal number of flowers needed = (175) / (2 + 12.5) = 12.8 ≈ 13 flowers.  \nAdditional flowers needed = 13 - 13 = 0.  \nTotal cost = 0 × 5 = 0.  \n\nThe answer is ₺0."], "expected_answer": "5", "actual_answer": "0"}
{"question": "The vending machines sell gum for 75 cents and popcorn for 100 cents. Yusuf spent ¥900 and got 4 bags of gum and had 9% of his money left in change. How many popcorn did he buy?", "index": 4017, "lines": ["Answer: \nThe next step is to determine the total amount of money Yusuf spent and the change he received. Since he spent ¥900 and had 9% of his money left as change, we can calculate his total money before spending.\n\nThe total money is calculated as:\nTotal money = ¥900 / (1 - 0.09) = ¥900 / 0.91 ≈ ¥989.\n\nHe spent ¥900 on gum and popcorn, so the change he received is:\nChange = Total money - Spending = ¥989 - ¥900 = ¥89.\n\nNext, calculate the cost of gum:\nCost of gum = 4 bags * ¥0.75 = ¥3.\n\nFinally, subtract the gum cost from the total spending to find the money spent on popcorn:\nMoney spent on popcorn = ¥900 - ¥3 = ¥897.\n\nSince each popcorn costs ¥1, the number of popcorns bought is:\nNumber of popcorns = ¥897 / ¥1 = 897.\n\nThe answer is 897."], "expected_answer": "816", "actual_answer": "897"}
{"question": "Prof. Davis sold his condo for $880000. He paid the registration fees that amount to 2% of the selling price and also paid a agent fee that is 4% of the selling price. If he also paid $460000 for the remaining loan amount of the condo, how much is Prof. Davis's net proceeds from selling the condo?", "index": 1744, "lines": ["Called LLM to parse answer, got The answer is 367200.", "Answer: \nThe next step is to calculate the total fees and expenses, then subtract them from the selling price to determine the net proceeds.\n\nTotal fees and expenses = registration fees + agent fee + loan amount  \nTotal fees and expenses = $17,600 + $35,200 + $460,000 = $512,800  \n\nNet proceeds = Selling price - Total fees and expenses  \nNet proceeds = $880,000 - $512,800 = $367,200  \n\nThe answer is 367200"], "expected_answer": "367200", "actual_answer": "367200"}
{"question": "There are currently 12 yellow balls, 19 purple balls, and 18 green balls in the store. Yellow balls cost ₺7, green balls cost ₺7, and purple balls cost ₺6. How much will the store have received after all the balls are sold?", "index": 3773, "lines": ["Answer: \n### Step 1: Calculate the revenue from each color of balls\n- Yellow balls: 12 × ₺7 = ₺84\n- Purple balls: 19 × ₺6 = ₺114\n- Green balls: 18 × ₺7 = ₺126\n\nThe answer is ₺324."], "expected_answer": "324", "actual_answer": "324"}
{"question": "The Brown family is busy making biscuits. So far, they've made 5225 biscuits. They have 1705 blueberry biscuits, 1569 strawberry biscuits, and some vanilla biscuits. How many vanilla biscuits have they made?", "index": 4187, "lines": ["Answer: \nThe next step is to calculate the number of vanilla biscuits by subtracting the total of blueberry and strawberry biscuits from the overall total.\n\nStep: Total vanilla biscuits = Total biscuits - (Blueberry biscuits + Strawberry biscuits)  \nTotal vanilla biscuits = 5225 - (1705 + 1569)  \nTotal vanilla biscuits = 5225 - 3274  \nTotal vanilla biscuits = 1951\n\nThe answer is 1951."], "expected_answer": "1951", "actual_answer": "1951"}
{"question": "Valeria went to the boardwalk for vacation. Her parents gave her €1300 to buy whatever she wanted. At the gift shop, saltwater taffy was on sale for \"Buy 15 kilograms at €20 per kilogram, get 5 kilograms 1/4 off.\" She scooped up 22 kilograms. She also bought a mixed bag of starfish for €11.5 and 17 keychains that were €20.5 each. How much money does Valeria have left?", "index": 2006, "lines": ["Answer: \nValeria spent €375 on saltwater taffy, €11.50 on starfish, and €348.50 on keychains, totaling €735. Subtracting this from her initial €1300, she has €565 left.\n\nThe answer is 565."], "expected_answer": "525", "actual_answer": "565"}
{"question": "Mohammed has a bag of coins with 52 inside. He tripped over stick while carrying it and dropped 2/4 of them. He scrambled to search for them but only came up with 14. When he went back home, he inspected the coins further. Seven of them he picked up weren't coins, but actually coins so he got rid of it. How many coins did Mohammed end up with?", "index": 3098, "lines": ["Answer: \nHe dropped 2/4 (which is 1/2) of 52, so he lost 26 coins. After finding 14, he had 14 coins. He then discarded 7 non-coin items, leaving him with 14 - 7 = 7 coins.\n\nThe answer is 7."], "expected_answer": "33", "actual_answer": "7"}
{"question": "Yusuf caught 6 trouts last Wednesday, the first trout he caught weighs 60 kgs, the second trout he caught weighs 39 kgs, and the last trout he caught weighs 38 kgs. If a kg of trout costs €1.0, how much will he earn after selling all the trouts to the market?", "index": 3834, "lines": ["Answer: \nStep 1: Calculate the total weight of all trouts.\nTotal weight = 60 kg + 39 kg + 38 kg = 137 kg\n\nThe answer is €137."], "expected_answer": "251", "actual_answer": "137"}
{"question": "According to its nutritional info, a bag of breads has 275 calories per serving. If a 100 ounces bag has 5 servings, how many ounces can you eat if your daily calorie target is 1900 and you have already consumed 800 calories?", "index": 1229, "lines": ["Answer: \nThe next step is to calculate the calories per ounce of bread. Since 5 servings equal 100 ounces, each serving is 20 ounces. Each serving has 275 calories, so each ounce has 275 / 20 = 13.75 calories.\n\nThe answer is 80 ounces."], "expected_answer": "80", "actual_answer": "80"}
{"question": "If Oliver and Kayla have 580 meters of fence between them, and they agree to split it with Kayla getting 160 meters more than Oliver, how much is left over for Oliver?", "index": 4252, "lines": ["Answer: \nLet Oliver's share be O meters. Kayla's share is O + 160 meters. Together, their shares equal 580 meters: O + (O + 160) = 580. Simplifying, 2O + 160 = 580. Subtract 160 from both sides: 2O = 420. Divide by 2: O = 210.\n\nThe answer is \\boxed{210}."], "expected_answer": "210", "actual_answer": "210"}
{"question": "Ananya and Nadia are sisters from Moscow who love collecting signatures from athletes. During their fall break from school, the sisters spend every afternoon collecting signatures. After 7 weeks, Ananya and Nadia compare their autograph books, counting up the number of signatures each sister has collected. Ananya has 22 signatures in her book, and Nadia has 58. The sisters have 2 more weeks of fall break, and they decide they want to reach 115 signatures between them by the end of the break. How many signatures do the sisters need to collect to reach their goal?", "index": 1674, "lines": ["Answer: \nThe next logical step is to determine how many more signatures they need to reach their goal. \n\nFirst, add the signatures they currently have:  \n22 (Ananya) + 58 (Nadia) = 80 signatures.\n\nNext, subtract this from their target total:  \n115 (goal) - 80 (current) = 35 signatures.\n\nThe answer is 35."], "expected_answer": "35", "actual_answer": "35"}
{"question": "Benjamin caught 4 salmons last Saturday, the first salmon he caught weighs 79 pounds, the second salmon he caught weighs 41 pounds, and the last salmon he caught weighs 26 pounds. If a pound of salmon costs $1.5, how much will he earn after selling all the salmons to the market?", "index": 3809, "lines": ["Called LLM to parse answer, got The answer is 219.", "Answer: \nBenjamin will calculate his earnings by multiplying the total weight of the salmon by the price per pound.\n\nStep: Multiply total weight (146 pounds) by price per pound ($1.5) to find total earnings.\n\nThe answer is 146 × $1.5 = $219."], "expected_answer": "258", "actual_answer": "219"}
{"question": "There are 6 periods in the day for a normal student but Oliver has to take 3 extra classes. Each class is 45 minutes long. He goes to class for 4 days a week. He then spends 2/3 of his weekly minutes each on Saturday and Sunday as extra learning time. How many hours a week does he spend learning?", "index": 3933, "lines": ["Answer: \nThe next step is to add Oliver's regular class time and extra learning time. \n\nTotal minutes = 540 (regular classes) + 360 (extra learning) = 900 minutes.\n\nConvert to hours: 900 ÷ 60 = 15 hours.\n\nThe answer is 15 hours."], "expected_answer": "63", "actual_answer": "15"}
{"question": "Theo caught 6 steelheads last Monday, the first steelhead he caught weighs 57 kgs, the second steelhead he caught weighs 47 kgs, and the last steelhead he caught weighs 28 kgs. If a kg of steelhead costs $1.75, how much will he earn after selling all the steelheads to the market?", "index": 3841, "lines": ["Answer: \nLet's calculate the total weight of the steelheads Theo caught.\n\nStep 1: Add the weights of all steelheads.\nTotal weight = 57 kg + 47 kg + 28 kg\n\nThe answer is 132 kg.\n\nStep 2: Calculate the total earnings by multiplying the total weight by the cost per kg.\n\nThe answer is \\$231."], "expected_answer": "378", "actual_answer": "231"}
{"question": "A carpenter works for 4 weeks every month and for 4 days every week. If he gets paid ¥185 every day, how much does he earn if he works for a year?", "index": 3528, "lines": ["Answer: \nStep 1: Calculate the total number of days worked in a month.  \nSince the carpenter works 4 days a week for 4 weeks, the total days per month is 4 days/week × 4 weeks = 16 days.  \n\nThe answer is 16 days."], "expected_answer": "35520", "actual_answer": "16"}
{"question": "Kai caught 7 salmons last Monday, the first salmon he caught weighs 62 kgs, the second salmon he caught weighs 38 kgs, and the last salmon he caught weighs 21 kgs. If a kg of salmon costs €1.0, how much will he earn after selling all the salmons to the market?", "index": 3827, "lines": ["Answer: \nThe next step is to sum the weights of the three salmons.  \n62 kg + 38 kg + 21 kg = 121 kg.  \n\nThe answer is €121."], "expected_answer": "205", "actual_answer": "121"}
{"question": "A loaf of sourdough at the cafe costs ₣3. Muffins cost ₣1 each. How much more do 9 loaves of sourdough cost than 6 muffins?", "index": 1949, "lines": ["Answer: \nThe next step is to calculate the total cost of 9 loaves of sourdough and 6 muffins, then find the difference.\n\nStep explanation:\n1. Calculate the cost of 9 loaves: 9 × 3 = 27.\n2. Calculate the cost of 6 muffins: 6 × 1 = 6.\n3. Find the difference: 27 - 6 = 21.\n\nThe answer is 21."], "expected_answer": "21", "actual_answer": "21"}
{"question": "Carlos went to buy some school supplies. He bought 24 crayons which cost ¥6.5 each, 8 notebooks which cost ¥12.75 each, and a rim of bond paper which cost ¥14. How much did Carlos spend on everything?", "index": 935, "lines": ["Called LLM to parse answer, got The answer is 272.", "Answer: \nLet's break down the costs:\n\n1. Crayons: 24 crayons × ¥6.5 each = ¥156\n2. Notebooks: 8 notebooks × ¥12.75 each = ¥102\n3. Bond paper: ¥14\n\nNext step: Add these amounts together to find the total cost.\n\nThe answer is ¥156 + ¥102 + ¥14 = ¥272"], "expected_answer": "272", "actual_answer": "272"}
{"question": "A cup of juice is 14 ounces of juice. Tariq drinks 5 cups of juice. If juice has 6 calories per ounce how many calories did he consume?", "index": 2812, "lines": ["Answer: \nLet's break down the problem step by step.\n\n**Step 1: Calculate calories per cup of juice.**\n- Each cup has 14 ounces of juice.\n- Juice contains 6 calories per ounce.\n- Calories per cup = 14 ounces * 6 calories/ounce = 84 calories.\n\n**Step 2: Calculate total calories consumed by Tariq.**\n- Tariq drinks 5 cups of juice.\n- Total calories = 5 cups * 84 calories/cup = 420 calories.\n\n**The answer is 420 calories.**"], "expected_answer": "420", "actual_answer": "420"}
{"question": "In a set of artist's cards, there are 25 orange cards, and 84% more red cards. Yellow cards are as many as the sum of orange and red cards. How many cards of all mentioned colors are there?", "index": 3134, "lines": ["Round 0:\nThe next step is to calculate the number of red cards by adding 84% of the orange cards to the total orange cards.  \nRed cards = Orange cards + (84% of Orange cards) = 25 + (0.84 × 25)  \nRed cards = 25 + 21 = 46", "Answer: \nThe next step is to calculate the number of yellow cards by adding the number of orange and red cards together.\n\nYellow cards = Orange cards + Red cards = 25 + 46 = 71\n\nThe answer is 142."], "expected_answer": "142", "actual_answer": "142"}
{"question": "840 people apply for a job at Microsoft. Of the people that apply, only 50% receive interviews. Of those who receive interviews, 40% receive a job offer. Of those who receive a job offer, five-sixths of the people accept the position. How many people accept the position?", "index": 4748, "lines": ["Answer: \nThe next step is to calculate how many people receive interviews by finding 50% of 840.  \n50% of 840 is 420.  \n\nStep-by-step explanation:  \n1. Total applicants: 840.  \n2. Interviews: 50% of 840 = 0.5 × 840 = 420.  \n\nThe answer is 420."], "expected_answer": "140", "actual_answer": "420"}
{"question": "At Yuki's house, there are nine times as many bananas as persimmons. He has a total of 66 persimmons in his house. Yuki bought 63 more persimmons at the store and 44 fewer bananas than the number of persimmons. Find the combined total of the number of bananas and persimmons Yuki has in the house?", "index": 4559, "lines": ["Answer: \nThe answer is 808."], "expected_answer": "742", "actual_answer": "808"}
{"question": "Aisha went to the pier for vacation. Her parents gave her $1200 to buy whatever she wanted. At the beach shop, rock candy was on sale for \"Buy 16 pounds at $23 per pound, get 4 pounds 1/2 off.\" She scooped up 22 pounds. She also bought a mixed bag of sea glass for $11.5 and 11 stickers that were $20.5 each. How much money does Aisha have left?", "index": 2007, "lines": ["Answer: \nThe cost of 22 pounds of rock candy is calculated by applying the sale: 16 pounds at $23 and 4 pounds at half price ($11.5).  \n16 × $23 = $368  \n4 × $11.5 = $46  \nTotal for rock candy = $368 + $46 = $414  \n\nThe next step is to calculate the cost of the stickers.  \n11 stickers × $20.5 each = $225.5  \n\nTotal expenses: $414 (rock candy) + $11.5 (sea glass) + $225.5 (stickers) = $651.5  \n\nSubtracting total expenses from the initial amount:  \n$1200 - $651.5 = $548.5  \n\nThe answer is $548.50."], "expected_answer": "503", "actual_answer": "548.5"}
{"question": "Kimia can peel 5 onions a minute and saute 40 onions in 6 minutes. How long will it take her to peel and saute 160 onions?", "index": 2426, "lines": ["Answer: \nLet's break down the problem into two parts: peeling and sautéing the onions.\n\n**Peeling Onions:**\n- Kimia can peel 5 onions in 1 minute.\n- To find the time to peel 1 onion:  \n  Time per onion = 1 minute / 5 onions = 0.2 minutes per onion.\n\n**Sautéing Onions:**\n- Kimia can sauté 40 onions in 6 minutes.\n- To find how long it takes to sauté 1 onion:  \n  Time per onion = 6 minutes / 40 onions = 0.15 minutes per onion.\n\nNow, we'll calculate the total time needed for 160 onions.\n\nThe next step is to calculate the total time required to peel and sauté 160 onions. \n\nTotal peeling time = 160 onions × 0.2 minutes per onion = 32 minutes  \nTotal sautéing time = 160 onions × 0.15 minutes per onion = 24 minutes  \nTotal time = 32 minutes + 24 minutes = 56 minutes  \n\nThe answer is 56 minutes."], "expected_answer": "56", "actual_answer": "56"}
{"question": "Andre caught 6 cods last Sunday, the first cod he caught weighs 54 kgs, the second cod he caught weighs 46 kgs, and the last cod he caught weighs 23 kgs. If a kg of cod costs €2.0, how much will he earn after selling all the cods to the market?", "index": 3801, "lines": ["Called LLM to parse answer, got I'm sorry, but it seems there is no numeric information provided in the input to calculate a final numerical answer. Therefore, the task cannot be completed as requested.", "Round 0:\nTo calculate Andre's earnings, first sum the weights of all six cods. However, only the weights of the first (54 kg), second (46 kg), and last (23 kg) cods are provided. Without the weights of the remaining three cods, the total weight cannot be determined. \n\nThe next step is to request clarification on the weights of the missing cods to proceed with the calculation.\n\nHowever, assuming only the provided weights are considered, the total weight would be:\n\nTotal weight = 54 kg + 46 kg + 23 kg = 123 kg\n\nEarnings would then be:\n\nEarnings = 123 kg × €2.0/kg = €246\n\nBut since the problem mentions six cods, this step is incomplete without the full weight data. \n\nThe answer is incomplete due to missing information.", "Called LLM to parse answer, got The answer is 0 [final numerical answer].", "Answer: \nThe next step is to recognize that without the weights of the remaining three cods, the total weight—and thus the earnings—cannot be accurately calculated. \n\nThe answer is incomplete due to missing information."], "expected_answer": "384", "actual_answer": "0"}
{"question": "Jamal caught 7 salmons last Friday, the first salmon he caught weighs 42 pounds, the second salmon he caught weighs 52 pounds, and the last salmon he caught weighs 32 pounds. If a pound of salmon costs ¥0.5, how much will he earn after selling all the salmons to the market?", "index": 3821, "lines": ["Answer: \nThe next logical step is to calculate the total weight of all the salmon Jamal caught by adding the weights of each individual salmon. \n\nTotal weight = 42 pounds + 52 pounds + 32 pounds = 126 pounds\n\nThe answer is 126 pounds."], "expected_answer": "127", "actual_answer": "126"}
{"question": "A farmer is buying feed for his cows. He buys a variety of apples, oats, beets and corns. Since corns are a rare treat, he only buys four 7-kg boxes of them for the whole stable. He only wants enough beets to feed the cows while the vegetables are fresh, so he buys thirteen 6-kg bags. Apples are the main diet of his cows, so he buys thirty five 39-kg packs. Oats are a staple to supplement the apples, so he buys seventeen 17-kg sacks. If his farm truck can carry 160 kgs at a time, how many trips does the farmer need to transport all the feed?", "index": 398, "lines": ["Answer: \nThe next logical step is to calculate the total weight of each type of feed and then sum them up to find the total weight the farmer needs to transport.\n\nStep 1: Calculate the total weight for each type of feed.\n- Corn: 4 boxes × 7 kg = 28 kg\n- Beets: 13 bags × 6 kg = 78 kg\n- Apples: 35 packs × 39 kg = 1,365 kg\n- Oats: 17 sacks × 17 kg = 289 kg\n\nStep 2: Sum the total weights to find the overall weight to be transported.\n28 kg + 78 kg + 1,365 kg + 289 kg = 1,760 kg\n\nThe answer is 11 trips."], "expected_answer": "11", "actual_answer": "11"}
{"question": "The Treasure hunt team hid 140 treats. The Lee twins each found 39 treats. All the other treats except 16 were found by their friends. How many treats did the friends find?", "index": 4084, "lines": ["Round 0:\nThe Lee twins found a total of 39 * 2 = 78 treats.", "Answer: \nThe total treats found by the twins and friends is 78 + friends' treats. The total treats is 140, so 78 + friends' treats + 16 (unfound treats) = 140. Therefore, friends' treats = 140 - 78 - 16 = 46.\n\nThe answer is 46."], "expected_answer": "46", "actual_answer": "46"}
{"question": "If Wei and Quinn have 560 yards of fence between them, and they agree to split it with Quinn getting 190 yards more than Wei, how much is left over for Wei?", "index": 4259, "lines": ["Answer: \nLet W be the amount Wei gets. Quinn gets W + 190 yards. Together, they have W + (W + 190) = 560 yards.\n\nSo, 2W + 190 = 560.\n\nSubtract 190 from both sides:\n\n2W = 560 - 190  \n2W = 370\n\nDivide both sides by 2:\n\nW = 185\n\nThe answer is 185."], "expected_answer": "185", "actual_answer": "185"}
{"question": "Oscar has 61 light indigo spools of thread, 83 dark indigo spools of thread, 26 light magenta spools of thread, and 70 dark magenta spools of thread. What percent of the spools are indigo?", "index": 3345, "lines": ["Answer: \nThe next step is to calculate the percentage by dividing the number of indigo spools by the total number of spools and then multiplying by 100.\n\nStep-by-step explanation:\n1. Find the total number of indigo spools: 61 (light) + 83 (dark) = 144.\n2. Find the total number of all spools: 144 (indigo) + 26 (light magenta) + 70 (dark magenta) = 240.\n3. Calculate the percentage: (144 / 240) × 100 = 60%.\n\nThe answer is 60%."], "expected_answer": "60", "actual_answer": "60"}
{"question": "At Mohammed's house, there are five times as many kiwis as bananas. He has a total of 46 bananas in his house. Mohammed bought 62 more bananas at the store and 16 fewer kiwis than the number of bananas. Find the combined total of the number of kiwis and bananas Mohammed has in the house?", "index": 4590, "lines": ["Answer: \nThe next step is to calculate the total number of kiwis and bananas after Mohammed's purchase. He initially has 46 bananas and buys 62 more, resulting in 108 bananas. He also buys 16 fewer kiwis than the total number of bananas he now has, which is 108 - 16 = 92 kiwis. Adding the original 5 × 46 = 230 kiwis, the total kiwis become 230 + 92 = 322. The combined total is 108 + 322 = 430.\n\nThe answer is 430."], "expected_answer": "384", "actual_answer": "430"}
{"question": "The vending machines sell gum for 25 cents and crackers for 50 cents. Kai spent ¥1400 and got 6 bags of gum and had 3% of his money left in change. How many crackers did he buy?", "index": 4022, "lines": ["Answer: \nKai's total expenditure was ¥1400, and he spent ¥150 on gum (6 bags × ¥25 each). Subtracting this from the total gives ¥1250 spent on crackers. Dividing by the price per cracker:\n\n1250 ÷ 50 = 25.\n\nThe answer is 25."], "expected_answer": "2713", "actual_answer": "25"}
{"question": "Xena has a flower bed that is 159 meters long. Xena wants to fill her flower bed with plants. Xena's flowers grow 2 meters wide so she needs to leave 13.25 meters between every plant. Xena already owns 10 flowers. Each flowering plant costs €14 at the store, how much money will Xena spend at the store to fill up her flower bed?", "index": 2266, "lines": ["Called LLM to parse answer, got The answer is 28 [final numerical answer].", "Answer: \nThe total space each plant and its spacing occupies is 2 + 13.25 = 15.25 meters. Let n be the total number of plants. The equation for the flower bed length is 15.25(n - 1) + 2 = 159. Solving for n gives approximately 11.3, so Xena needs 12 plants. Subtracting the 10 she already has, she needs 2 more plants. The cost is 2 * €14 = €28.\n\nThe answer is 28 [€28]."], "expected_answer": "28", "actual_answer": "28"}
{"question": "Aisha has a flower bed that is 182 meters long. Aisha wants to fill her flower bed with plants. Aisha's flowers grow 3 meters wide so she needs to leave 13.0 meters between every plant. Aisha already owns 12 flowers. Each flowering plant costs $4 at the store, how much money will Aisha spend at the store to fill up her flower bed?", "index": 2264, "lines": ["Answer: \nAisha's flower bed is 182 meters long. Each plant takes up 3 meters, and she needs 13 meters between each plant. To find how many plants she can fit, use the equation:\n\nTotal length = (Number of plants × width per plant) + (Number of spaces × space between plants)\n\nLet n be the number of plants. The equation becomes:\n\n182 = 3n + 13(n - 1)\n\nSimplify and solve for n:\n\n182 = 3n + 13n - 13  \n182 = 16n - 13  \n195 = 16n  \nn ≈ 12.1875\n\nSince she can't have a fraction of a plant, Aisha can fit 12 plants. She already owns 12 flowers, so she doesn't need to buy any more. \n\nThe answer is $0."], "expected_answer": "8", "actual_answer": "0"}
{"question": "Tara has a flower bed that is 196 meters long. Tara wants to fill her flower bed with plants. Tara's flowers grow 7 meters wide so she needs to leave 12.25 meters between every plant. Tara already owns 11 flowers. Each flowering plant costs $7 at the store, how much money will Tara spend at the store to fill up her flower bed?", "index": 2276, "lines": ["Answer: \nTo determine how many plants Tara needs to buy, first calculate the total number of plants required to fill the flower bed by solving for \\( n \\) in the equation:  \n\\( (n - 1) \\times 12.25 + n \\times 7 = 196 \\).\n\n---\n\nThe answer is 77."], "expected_answer": "35", "actual_answer": "77"}
