{"question": "Jin caught 4 trouts last Thursday, the first trout he caught weighs 54 kgs, the second trout he caught weighs 42 kgs, and the last trout he caught weighs 20 kgs. If a kg of trout costs ¥0.5, how much will he earn after selling all the trouts to the market?", "index": 3849, "lines": ["Answer: \nStep 1: Calculate the total weight of the trouts caught.\n\nTotal weight = 54 kg + 42 kg + 20 kg = 116 kg\n\nThe answer is 116 kg."], "expected_answer": "68", "actual_answer": "116"}
{"question": "Jamal has ¥71.19 and wants to buy 31 nuts from a bin at the hardware store. Each nut costs ¥0.49. How much money does Jamal have left after paying for the nuts?", "index": 1524, "lines": ["Answer: \nStep 1: Calculate the total cost of 31 nuts.  \nTotal cost = 31 nuts × ¥0.49/nut = ¥15.19\n\nThe answer is ¥56.00."], "expected_answer": "56", "actual_answer": "56"}
{"question": "Oscar caught 7 steelheads last Sunday, the first steelhead he caught weighs 56 pounds, the second steelhead he caught weighs 57 pounds, and the last steelhead he caught weighs 27 pounds. If a pound of steelhead costs $2.25, how much will he earn after selling all the steelheads to the market?", "index": 3826, "lines": ["Answer: \nThe next logical step is to sum the weights of all the steelheads Oscar caught and then multiply by the cost per pound to determine his earnings.\n\nStep-by-step explanation:\n\n1. Calculate the total weight of the steelheads:\n   56 pounds + 57 pounds + 27 pounds = 140 pounds\n\nThe answer is 140 pounds."], "expected_answer": "558", "actual_answer": "140"}
{"question": "Ravi finished three-sixths of a 194 piece puzzle, and then started and finished another 354 piece puzzle within an hour. How many puzzle pieces did Ravi place during that hour?", "index": 3987, "lines": ["Answer: \nRavi placed 97 pieces from the first puzzle and all 354 pieces from the second puzzle. Adding these together: 97 + 354 = 451 pieces.\n\nThe answer is 451."], "expected_answer": "451", "actual_answer": "451"}
{"question": "A pyramid is made out of 2 green cubes, seven times as many orange cubes, and an unknown number of purple cubes. If there are 39 cubes in the pyramid in total, how many purple cubes are there?", "index": 2067, "lines": ["Answer: \nFirst, calculate the number of orange cubes: 2 green cubes × 7 = 14 orange cubes. Then, the total number of green and orange cubes is 2 + 14 = 16. Subtract this from the total cubes to find the purple cubes: 39 - 16 = 23.\n\nThe answer is 23."], "expected_answer": "23", "actual_answer": "23"}
{"question": "A juggler can juggle 200 balls. A fifth of the balls are tennis balls, and 1/2 of the tennis balls are teal. How many teal tennis balls are there?", "index": 430, "lines": ["Answer: \nThe next step is to find the number of tennis balls:\n\nNumber of tennis balls = (1/5) × Total balls  \nNumber of tennis balls = (1/5) × 200  \nNumber of tennis balls = 40  \n\nThe answer is 40."], "expected_answer": "20", "actual_answer": "40"}
{"question": "Alejandro has a bag of buttons with 24 inside. He tripped over toy while carrying it and dropped two-thirds of them. He scrambled to search for them but only came up with 14. When he went back home, he inspected the buttons further. Two of them he picked up weren't buttons, but actually pebbles so he got rid of it. How many buttons did Alejandro end up with?", "index": 3063, "lines": ["Answer: \nAlejandro initially had 24 buttons. He dropped two-thirds, which is 16 buttons, leaving him with 8 buttons. He found 14 buttons, but 2 were pebbles, so he had 12 usable buttons. Adding the remaining buttons from the bag to the usable ones he found: 8 + 12 = 20.\n\nThe answer is 20."], "expected_answer": "20", "actual_answer": "20"}
{"question": "Kayla has a flower bed that is 216 feet long. Kayla wants to fill her flower bed with plants. Kayla's flowers grow 4 feet wide so she needs to leave 13.5 feet between every plant. Kayla already owns 10 flowers. Each flowering plant costs ₣7 at the store, how much money will Kayla spend at the store to fill up her flower bed?", "index": 2280, "lines": ["Answer: \nThe next step is to calculate how many plants Kayla can fit in her flower bed.\n\n1. **Determine the space each plant needs:** Each plant grows 4 feet wide and requires 13.5 feet of space between them.  \n   Space per plant = 4 ft + 13.5 ft = 17.5 ft\n\n2. **Calculate the number of plants that can fit in the flower bed:**  \n   Number of plants = Total length of the flower bed / Space per plant  \n   Number of plants = 216 ft / 17.5 ft ≈ 12.34\n\n3. **Since you can't have a fraction of a plant, Kayla will need 12 plants in total.**\n\n4. **Subtract the number of plants she already owns:**  \n   Plants to buy = Total plants needed - Plants she already has  \n   Plants to buy = 12 - 10 = 2\n\n5. **Calculate the total cost to buy the additional plants:**  \n   Total cost = Number of plants to buy × Cost per plant  \n   Total cost = 2 × ₣7 = ₣14\n\nThe answer is **14**."], "expected_answer": "42", "actual_answer": "14"}
{"question": "Carlos goes to the store to buy some tea. The normal brand of tea he buys costs ₺4 per kilogram. He had to buy a more expensive brand that costs 25% more since his favorite brand was sold out. He decides to buy a week's worth of tea and he uses 1 kilogram of tea per day. He also decided to buy himself a muffin for ₺1. How much did everything cost?", "index": 2129, "lines": ["Answer: \nThe next step is to calculate the total cost for a week's worth of tea.  \n\nStep-by-step explanation:  \n1. The new tea brand costs 25% more than ₺4 per kg.  \n2. 25% of ₺4 is ₺1.  \n3. The new price per kg is ₺4 + ₺1 = ₺5.  \n4. Carlos buys 7 kg (1 kg per day for 7 days).  \n5. The cost for tea is 7 kg × ₺5/kg = ₺35.  \n\nThe answer is ₺35 [total cost for tea]."], "expected_answer": "36", "actual_answer": "35"}
{"question": "A clinic has a capacity of 1700 rooms with 2/5 occupied. Due to the natural disaster, 20 patients are admitted into the clinic each day. Calculate the total number of unoccupied rooms in the clinic after 2 weeks.", "index": 1434, "lines": ["Answer: \nThe next step is to calculate the number of patients admitted over 2 weeks. Since 20 patients are admitted each day, over 14 days, this is 20 * 14 = 280 patients.\n\nThe answer is 740 unoccupied rooms."], "expected_answer": "740", "actual_answer": "740"}
{"question": "James's truck breaks down. The truck weighs 1350 pounds and he has equipment in it weighing 400 pounds. He also has his 2 young colleagues who weigh 85 pounds each in it. If the force to move the truck is 5% of the weight, how much force does he need to push the truck?", "index": 3389, "lines": ["Answer: \nThe total weight of the truck, equipment, and colleagues is calculated as follows:  \nTruck: 1350 pounds  \nEquipment: 400 pounds  \nColleagues: 2 × 85 = 170 pounds  \nTotal weight = 1350 + 400 + 170 = 1920 pounds  \n\nNow, calculate 5% of the total weight to determine the force:  \nForce = 0.05 × 1920 = 96 pounds  \n\nThe answer is 96 pounds."], "expected_answer": "96", "actual_answer": "96"}
{"question": "At Gabriel's house, there are five times as many grapes as apples. He has a total of 94 apples in his house. Gabriel bought 42 more apples at the store and 39 fewer grapes than the number of apples. Find the combined total of the number of grapes and apples Gabriel has in the house?", "index": 4578, "lines": ["Answer: \nThe next step is to calculate the new number of grapes Gabriel has after his purchase. Since he bought 39 fewer grapes than apples (42 apples - 39 = 3 grapes), add these to the initial grapes: 470 + 3 = 473 grapes. \n\nThe answer is 609."], "expected_answer": "609", "actual_answer": "609"}
{"question": "A juggler can juggle 960 balls. 1/2 of the balls are tennis balls, and a third of the tennis balls are yellow. How many yellow tennis balls are there?", "index": 449, "lines": ["Answer: \nStep 1: Calculate the number of tennis balls.\nnumber of tennis balls = total balls × 1/2 = 960 × 1/2 = 480\n\nThe answer is 480 yellow tennis balls."], "expected_answer": "160", "actual_answer": "480"}
{"question": "Oscar is popping popcorn for a snack. As the pot of kernels heats up, the kernels start popping faster. 30 pop in the first 22 seconds of cooking, then 2 times that amount in the next 22 seconds. The kernels increase to 4 times the initial popping rate in the next 22 seconds, but in the final 22 seconds, the popping slows down to half the rate as the past 22 seconds. After Oscar takes the pot off the heat, a quarter of the number of kernels that popped in the final 22 seconds of cooking also pop from the residual heat. How many pieces of popcorn does Oscar have to eat?", "index": 247, "lines": ["Answer: \nThe answer is 285."], "expected_answer": "285", "actual_answer": "285"}
{"question": "The Brown family is busy making muffins. So far, they've made 7800 muffins. They have 1833 strawberry muffins, 2847 blueberry muffins, and some peanut butter muffins. How many peanut butter muffins have they made?", "index": 4167, "lines": ["Answer: \nThey have a total of 7800 muffins. They have 1833 strawberry muffins and 2847 blueberry muffins. To find the number of peanut butter muffins, subtract the total number of strawberry and blueberry muffins from the total muffins.\n\nStep-by-step explanation:  \nTotal muffins = 7800  \nStrawberry muffins = 1833  \nBlueberry muffins = 2847  \nPeanut butter muffins = Total muffins - Strawberry muffins - Blueberry muffins  \nPeanut butter muffins = 7800 - 1833 - 2847  \nPeanut butter muffins = 7800 - 4680  \nPeanut butter muffins = 3120\n\nThe answer is 3120."], "expected_answer": "3120", "actual_answer": "3120"}
{"question": "At Liam's house, there are ten times as many pears as apples. He has a total of 31 apples in his house. Liam bought 58 more apples at the store and 44 fewer pears than the number of apples. Find the combined total of the number of pears and apples Liam has in the house?", "index": 4569, "lines": ["Answer: \nThe answer is 444."], "expected_answer": "413", "actual_answer": "444"}
{"question": "Noah hires a luxury car from 1 PM to 6 PM. He gets 1 hours free. The first paid hour is ₺11 and each hour after that is twice the cost. How much did he pay?", "index": 4454, "lines": ["Answer: \nThe total duration Noah hires the car is from 1 PM to 6 PM, which is 5 hours. With 1 hour free, he is charged for 4 hours. The cost structure is ₺11 for the first hour, and each subsequent hour is twice the previous cost. \n\nCalculating the cost:\n- 1st paid hour: ₺11  \n- 2nd paid hour: 2 × ₺11 = ₺22  \n- 3rd paid hour: 2 × ₺22 = ₺44  \n- 4th paid hour: 2 × ₺44 = ₺88  \n\nAdding these together:  \n11 + 22 + 44 + 88 = 165  \n\nThe answer is ₺165."], "expected_answer": "77", "actual_answer": "165"}
{"question": "Olga has a flower bed that is 168 feet long. Olga wants to fill her flower bed with plants. Olga's flowers grow 4 feet wide so she needs to leave 14.0 feet between every plant. Olga already owns 10 flowers. Each flowering plant costs ₺14 at the store, how much money will Olga spend at the store to fill up her flower bed?", "index": 2281, "lines": ["Answer: \nThe next step is to calculate the number of flowers Olga can fit in her bed. Each flower requires 4 feet of space plus 14 feet between them, totaling 18 feet per flower. Dividing the bed's length (168 feet) by 18 feet per flower gives approximately 9.33 flowers. Since Olga can't buy a fraction of a flower and already owns 10, she doesn't need to purchase any, so her cost is ₺0. \n\nThe answer is 0."], "expected_answer": "28", "actual_answer": "0"}
{"question": "There are 5 periods in the day for a normal student but Benjamin has to take 1 extra classes. Each class is 40 minutes long. He goes to class for 4 days a week. He then spends three-fourths of his weekly minutes each on Saturday and Sunday as extra learning time. How many hours a week does he spend learning?", "index": 3940, "lines": ["Answer: \nBenjamin has 6 classes per day (5 regular + 1 extra). Each class is 40 minutes, so daily time is 6 * 40 = 240 minutes. Over 4 days, this is 240 * 4 = 960 minutes. He spends 3/4 of 960 minutes on weekends: (3/4) * 960 = 720 minutes. Total learning time is 960 + 720 = 1680 minutes. Converting to hours: 1680 / 60 = 28 hours.\n\nThe answer is 28 hours."], "expected_answer": "40", "actual_answer": "28"}
{"question": "If Haruka and Liam have 220 meters of fence between them, and they agree to split it with Liam getting 110 meters more than Haruka, how much is left over for Haruka?", "index": 4277, "lines": ["Round 0:\nStep 1: Let H be the amount of fence Haruka gets.  \nThen Liam gets H + 110 meters.  \n\nThe next step is to set up the equation:  \nH + (H + 110) = 220  \n\nThis combines the total fence they have together.", "Round 1:\nStep 2: Combine like terms:\n2H + 110 = 220\n\nThis step simplifies the equation by adding the two H terms together, making it easier to solve for H.", "Round 2:\nStep 3: Subtract 110 from both sides to isolate the term with H.  \n2H = 220 - 110  \n2H = 110  \n\nThis step removes the constant term to solve for H.", "Answer: \nStep 4: Divide both sides of the equation by 2 to solve for H.  \nH = 110 / 2  \nH = 55  \n\nThis step isolates H, revealing how much fence Haruka receives.  \n\nThe answer is 55."], "expected_answer": "55", "actual_answer": "55"}
{"question": "Oliver watches TV after he finishes his homework every night. On Thursday and Friday, he watched a 5-hour episode of his favorite show each night. On Saturday, he watched a few episodes of a 30-minute show. On Sunday, he finished homework early and watched a 2-hour episode and a 30-minute show. On Monday, he got to stay up late, so he watched two 2-hour episodes. If he watched 20 hours of TV in all, how many 30-minute episodes did he watch on Saturday?", "index": 1063, "lines": ["Answer: \nTo find the number of 30-minute episodes Oliver watched on Saturday, let's calculate the total TV time for all other days and subtract from 20 hours.\n\nTotal TV time on Thursday and Friday: 5 + 5 = 10 hours  \nTV time on Sunday: 2 hours + 0.5 hours = 2.5 hours  \nTV time on Monday: 2 * 2 = 4 hours  \n\nTotal known TV time: 10 + 2.5 + 4 = 16.5 hours  \n\nLet x be the number of 30-minute episodes on Saturday: 0.5x hours  \n\nTotal TV time equation: 16.5 + 0.5x = 20  \n\nSubtract 16.5 from both sides: 0.5x = 3.5  \n\nDivide both sides by 0.5: x = 7  \n\nThe answer is 7."], "expected_answer": "7", "actual_answer": "7"}
{"question": "A farmer is buying feed for his sheep. He buys a variety of oats, hay, cucumbers and wheats. Since wheats are a rare treat, he only buys five 5-pound boxes of them for the whole stable. He only wants enough cucumbers to feed the sheep while the vegetables are fresh, so he buys twelve 7-pound bags. Oats are the main diet of his sheep, so he buys thirty five 43-pound packs. Hay are a staple to supplement the oats, so he buys sixteen 16-pound sacks. If his farm truck can carry 110 pounds at a time, how many trips does the farmer need to transport all the feed?", "index": 383, "lines": ["Answer: \nFirst, calculate the total weight for each type of feed by multiplying the quantity by the weight per unit:\n\n- **Wheats:** 5 boxes × 5 pounds = 25 pounds  \n- **Cucumbers:** 12 bags × 7 pounds = 84 pounds  \n- **Oats:** 35 packs × 43 pounds = 1505 pounds  \n- **Hay:** 16 sacks × 16 pounds = 256 pounds  \n\nThe next step is to sum these weights to find the total weight of all feed:  \n25 + 84 + 1,505 + 256 = **1,870 pounds**  \n\nThen, divide the total weight by the truck's capacity to determine the number of trips needed:  \n1,870 ÷ 110 = 17 trips  \n\nThe answer is 17 trips."], "expected_answer": "17", "actual_answer": "17"}
{"question": "Elena has six times as many Twitter friends as Chen. Oliver has eight times as many friends on Twitter as Chen. If Elena has 180 friends on Twitter, how many Twitter friends does Oliver have?", "index": 4527, "lines": ["Round 0:\nStep 1: Determine the number of Twitter friends Chen has. Since Elena has six times as many friends as Chen and Elena has 180 friends, we can set up the equation: 6C = 180, where C is the number of Chen's friends. Solving for C gives C = 180 / 6 = 30.", "Answer: \nStep 2: Calculate Oliver's Twitter friends. Since Oliver has eight times as many friends as Chen and Chen has 30 friends, we can calculate Oliver's friends as 8 * 30 = 240.\n\nThe answer is 240."], "expected_answer": "240", "actual_answer": "240"}
{"question": "Valeria is popping popcorn for a snack. As the pan of kernels heats up, the kernels start popping faster. 30 pop in the first 12 seconds of cooking, then 3 times that amount in the next 12 seconds. The kernels increase to 4 times the initial popping rate in the next 12 seconds, but in the final 12 seconds, the popping slows down to half the rate as the past 12 seconds. After Valeria takes the pan off the heat, a quarter of the number of kernels that popped in the final 12 seconds of cooking also pop from the residual heat. How many pieces of popcorn does Valeria have to eat?", "index": 237, "lines": ["Round 0:\nThe first step is to calculate the number of popped kernels in the second 12-second interval. Since the popping rate triples, we multiply the initial 30 kernels by 3.\n\n30 kernels × 3 = 90 kernels.\n\nThis gives the number of kernels popped in the second interval.", "Round 1:\nThe next step is to calculate the number of popped kernels in the third 12-second interval. Since the popping rate is now four times the initial rate, we multiply the initial 30 kernels by 4.\n\n30 kernels × 4 = 120 kernels.\n\nThis gives the number of kernels popped in the third interval.", "Round 2:\nThe next step is to calculate the number of popped kernels in the final 12-second interval when the popping rate slows down to half the previous rate. Since the previous rate was 4 times the initial, half of that is 2 times the initial rate.\n\n30 kernels × 2 = 60 kernels.\n\nThis gives the number of kernels popped in the final interval while cooking.", "Answer: \nThe next step is to account for the additional kernels that pop from residual heat. Since a quarter of the final 12-second interval's popped kernels (60) pop after cooking, we calculate 60 × 0.25 = 15. Adding this to the total popped during cooking gives the final amount.\n\nTotal popped during cooking: 30 + 90 + 120 + 60 = 300.\n\nAdding residual popped kernels: 300 + 15 = 315.\n\nThe answer is 315."], "expected_answer": "315", "actual_answer": "315"}
{"question": "There are 8 periods in the day for a normal student but Qasim has to take 2 extra classes. Each class is 50 minutes long. He goes to class for 6 days a week. He then spends 1/4 of his weekly minutes each on Saturday and Sunday as extra learning time. How many hours a week does he spend learning?", "index": 3920, "lines": ["Answer: \nThe next step is to calculate the total time Qasim spends in classes during the 6 school days. Each day, he attends 10 periods (8 regular + 2 extra), each lasting 50 minutes. \n\nStep-by-step calculation:\n1. **Daily class time**: 10 periods * 50 minutes/period = 500 minutes.\n2. **Weekly class time (6 days)**: 6 days * 500 minutes/day = 3000 minutes.\n\nNow, add the extra learning time for Saturday and Sunday:\n- **Extra time each day**: 1/4 of 3000 minutes = 750 minutes.\n- **Total extra time**: 750 minutes * 2 days = 1500 minutes.\n\n**Total weekly learning time**: 3000 minutes + 1500 minutes = 4500 minutes.\n\nConvert minutes to hours:\n- 4500 minutes ÷ 60 = 75 hours.\n\nThe answer is 75 hours."], "expected_answer": "75", "actual_answer": "75"}
{"question": "Kai caught 4 trouts last Monday, the first trout he caught weighs 46 kgs, the second trout he caught weighs 30 kgs, and the last trout he caught weighs 32 kgs. If a kg of trout costs ₺0.25, how much will he earn after selling all the trouts to the market?", "index": 3817, "lines": ["Answer: \nThe next step is to calculate the total weight of all trouts caught by Kai. Since the weights of the first, second, and last trouts are given, we can sum them up to find the total weight.\n\nStep 2: Sum the weights of all trouts.\nTotal weight = 46 kg + 30 kg + 32 kg + 32 kg = 140 kg\n\nThe answer is 140 kg."], "expected_answer": "35", "actual_answer": "140"}
{"question": "Keisha went to the beach for vacation. Her parents gave her ₺1400 to buy whatever she wanted. At the souvenir store, fudge was on sale for \"Buy 15 pounds at ₺21 per pound, get 6 pounds 1/2 off.\" She scooped up 23 pounds. She also bought a mixed bag of sand dollars for ₺11.5 and 15 postcards that were ₺20.5 each. How much money does Keisha have left?", "index": 2040, "lines": ["Answer: \nKeisha's total purchases amount to ₺697. Subtracting this from her initial ₺1400 gives the remaining money.\n\nThe answer is ₺703."], "expected_answer": "661", "actual_answer": "703"}
{"question": "A new infection infects 20 people. Every day, each infected person infects 4 others. How many people are infected after 4 days?", "index": 4920, "lines": ["Answer: \nOn day 2, each of the 100 infected people infects 4 others, resulting in 100 × 4 = 400 new infections. Adding these to the previous total, the number of infected people becomes 100 + 400 = 500.\n\nThe answer is 500."], "expected_answer": "12500", "actual_answer": "500"}
{"question": "Ava makes tea using teaspoons of sugar and cups of water in the ratio of 113:14. If she used a total of 635 teaspoons of sugar and cups of water, calculate the number of teaspoonfuls of sugar she used.", "index": 283, "lines": ["Answer: \nThe next step is to calculate the value of one part of the ratio. \n\nStep-by-step explanation:\n1. The total ratio parts = 113 (sugar) + 14 (water) = 127 parts.\n2. Each part is equal to the total volume divided by the total parts: 635 ÷ 127 = 5.\n3. Therefore, the number of teaspoonfuls of sugar is 113 parts × 5 = 565.\n\nThe answer is 565."], "expected_answer": "565", "actual_answer": "565"}
{"question": "Yuki collects garbage from 3 different apartment complexes. The first 2 have 100 apartments each and the last one is 20% bigger than the other 2 combined. Yuki collects garbage 5 times a week from each place and he gets paid ₣0.35 per collection for each apartment. How much money does he make in a week?", "index": 2497, "lines": ["Answer: \nThe total number of apartments across all complexes is 100 + 100 + 240 = 440. \n\nMultiply this by the number of collections per week (5) and the payment per collection per apartment ($0.35): 440 * 5 * 0.35 = $770.\n\nThe answer is 770."], "expected_answer": "770", "actual_answer": "770"}
{"question": "A fog bank rolls in from the ocean to cover a city. It takes 407 minutes to cover every 28 miles of the city. If the city is 56 miles across from the oceanfront to the opposite inland edge, how many minutes will it take for the fog bank to cover the whole city?", "index": 89, "lines": ["Answer: \nThe fog covers 28 miles in 407 minutes, so the rate is 407 minutes per 28 miles. To find the time for 56 miles, multiply 407 by 2.\n\nThe answer is 814 minutes."], "expected_answer": "814", "actual_answer": "814"}
{"question": "At Esteban's house, there are six times as many plums as persimmons. He has a total of 83 persimmons in his house. Esteban bought 71 more persimmons at the store and 21 fewer plums than the number of persimmons. Find the combined total of the number of plums and persimmons Esteban has in the house?", "index": 4565, "lines": ["Answer: \nFirst, calculate the new number of persimmons after purchasing 71 more:  \n83 + 71 = 154 persimmons.\n\nNext, determine the number of plums purchased by subtracting 21 from the new number of persimmons:  \n154 - 21 = 133 plums.\n\nNow, calculate the total number of plums Esteban has after purchasing the additional plums:  \n6 × 83 (initial plums) + 133 (purchased plums) = 498 + 133 = 631 plums.\n\nFinally, find the combined total of plums and persimmons:  \n631 (plums) + 154 (persimmons) = 785.\n\nThe answer is 785."], "expected_answer": "702", "actual_answer": "785"}
{"question": "Ava has a flower bed that is 169 meters long. Ava wants to fill her flower bed with plants. Ava's flowers grow 3 meters wide so she needs to leave 13.0 meters between every plant. Ava already owns 12 flowers. Each flowering plant costs ₣8 at the store, how much money will Ava spend at the store to fill up her flower bed?", "index": 2283, "lines": ["Answer: \nAva needs to determine how many plants she needs to buy. She can fit 10 plants in her flower bed, but she already has 12, so she doesn't need to purchase any.\n\nThe answer is 0."], "expected_answer": "8", "actual_answer": "0"}
{"question": "At Benjamin's house, there are six times as many pears as figs. He has a total of 57 figs in his house. Benjamin bought 87 more figs at the store and 48 fewer pears than the number of figs. Find the combined total of the number of pears and figs Benjamin has in the house?", "index": 4599, "lines": ["Called LLM to parse answer, got The answer is 399 [final numerical answer].", "Answer: \nThe next step is to determine the number of pears Benjamin initially has. Since there are six times as many pears as figs, and there are 57 figs, the number of pears is 6 * 57.\n\nStep-by-step explanation:\n- Calculate the initial number of pears: 6 * 57 = 342 pears.\n\nThe answer is 342 pears and 57 figs initially."], "expected_answer": "525", "actual_answer": "399"}
{"question": "There are 116 fifth-graders at Maple Grove School. 25 of them are girls. On Friday, 3 fifth-grade girls and 8 fifth-grade boys were absent. How many fifth grade boys were at Maple Grove School on Friday?", "index": 3748, "lines": ["Answer: \nThere are 116 fifth-graders in total, with 25 being girls. To find the number of boys, subtract the number of girls from the total number of students. \n\nStep 1: Total students = 116  \nStep 2: Number of girls = 25  \nStep 3: Number of boys = Total students - Number of girls = 116 - 25 = 91  \n\nThe next step is to account for the absences of boys on Friday. \n\nThe answer is 83."], "expected_answer": "83", "actual_answer": "83"}
{"question": "The vending machines sell crackers for 85 cents and pretzels for 125 cents. Santiago spent ¥900 and got 5 bags of crackers and had 3% of his money left in change. How many pretzels did he buy?", "index": 4027, "lines": ["Called LLM to parse answer, got The answer is 3.", "Answer: \nThe total amount spent on pretzels is ¥448. Dividing this by the cost per pretzel (¥125) gives the number of pretzels purchased.\n\nThe number of pretzels is 448 ÷ 125 = 3.584. Since you can't buy a fraction of a pretzel, Santiago bought 3 pretzels. However, to match the exact calculation, the answer is 3.584, but in practical terms, it would be 3 pretzels. \n\nThe answer is 3.584, but since partial pretzels aren't possible, the correct whole number is 3 pretzels."], "expected_answer": "695", "actual_answer": "3"}
{"question": "Alejandro went to buy some school supplies. He bought 14 crayons which cost ₣9.0 each, 8 pencils which cost ₣13.75 each, and a rim of bond paper which cost ₣23. How much did Alejandro spend on everything?", "index": 943, "lines": ["Answer: \nNext step: Calculate the total cost for the crayons.\n- Multiply the number of crayons by the cost per crayon: 14 × 9.0 = 126.\n\nThe answer is 126."], "expected_answer": "259", "actual_answer": "126"}
{"question": "Keisha is required to submit a 246-page assignment. She already finished writing 2/4 of the assignment. How many pages does she have left to write?", "index": 3867, "lines": ["Answer: \nKeisha has written 2/4 of the assignment, which is half of 246 pages. Calculating 246 ÷ 2 gives 123 pages written. To find the remaining pages, subtract the written pages from the total: 246 - 123 = 123 pages left.\n\nThe answer is 123."], "expected_answer": "123", "actual_answer": "123"}
{"question": "If Valentina and Luis have 540 feet of fence between them, and they agree to split it with Luis getting 80 feet more than Valentina, how much is left over for Valentina?", "index": 4299, "lines": ["Answer: \nThe next step is to set up an equation representing their combined fencing:\n\nLet Valentina's share be \\( V \\) feet, so Luis's share is \\( V + 80 \\). Together, they have:\n\n\\[ V + (V + 80) = 540 \\]\n\nThis equation will help determine the exact amount each person receives. Simplifying it further:\n\n\\[ 2V + 80 = 540 \\]\n\nThe answer is 230 feet.\n\nThe answer is 230."], "expected_answer": "230", "actual_answer": "230"}
{"question": "Beatriz has six times as many TikTok friends as Haruka. Leon has ten times as many friends on TikTok as Haruka. If Beatriz has 24 friends on TikTok, how many TikTok friends does Leon have?", "index": 4514, "lines": ["Answer: \nHaruka has 24 ÷ 6 = 4 TikTok friends.\n\nThe answer is 40 [numerical answer]."], "expected_answer": "40", "actual_answer": "40"}
{"question": "Liam hires a luxury car from 3 PM to 9 PM. He gets 1 hours free. The first paid hour is $13 and each hour after that is twice the cost. How much did he pay?", "index": 4471, "lines": ["Answer: \nThe total rental time is 6 hours, but with 1 hour free, so Liam pays for 5 hours. The first paid hour is $13, and each subsequent hour is $26. Therefore, the total cost is $13 + (4 × $26) = $13 + $104 = $117.\n\nThe answer is 117."], "expected_answer": "117", "actual_answer": "117"}
{"question": "At Ravi's house, there are two times as many apples as figs. He has a total of 90 figs in his house. Ravi bought 66 more figs at the store and 45 fewer apples than the number of figs. Find the combined total of the number of apples and figs Ravi has in the house?", "index": 4596, "lines": ["Answer: \nRavi initially has 90 figs and 180 apples. After buying 66 more figs, he has 156 figs. He also buys 21 apples (since 66 - 45 = 21), making the total apples 201. The combined total is 201 apples + 156 figs = 357.\n\nThe answer is 357."], "expected_answer": "357", "actual_answer": "357"}
{"question": "Prof. Williams sold his condo for $850000. He paid the registration fees that amount to 2% of the selling price and also paid a agent fee that is 3% of the selling price. If he also paid $280000 for the remaining loan amount of the condo, how much is Prof. Williams's net proceeds from selling the condo?", "index": 1724, "lines": ["Answer: \nThe next step is to calculate the total fees by adding the registration and agent fees: $17,000 + $25,500 = $42,500.\n\nThe total expenses are $42,500 (fees) + $280,000 (loan) = $322,500.\n\nNet proceeds = Selling price - Total expenses = $850,000 - $322,500 = $527,500.\n\nThe answer is 527500."], "expected_answer": "527500", "actual_answer": "527500"}
{"question": "There are 24 girls in the park. If there are 1/2 the number of boys in the park, how many kids are in the park?", "index": 2214, "lines": ["Answer: \nNext step: Calculate the number of boys by halving the number of girls.\n\nStep explanation: Since there are 24 girls and boys are half that number, we calculate boys as 24 * (1/2) = 12.\n\nThe answer is 36."], "expected_answer": "36", "actual_answer": "36"}
{"question": "Qasim hires a limousine from 2 PM to 11 PM. He gets 2 hours free. The first paid hour is ₣40 and each hour after that is twice the cost. How much did he pay?", "index": 4467, "lines": ["Answer: \nThe total hours rented are 9 hours, with 2 hours free, leaving 7 paid hours. The first paid hour costs ₣40, and each subsequent hour doubles the previous cost. \n\nCalculating the cost:\n- 1st paid hour: ₣40\n- 2nd paid hour: 2 × 40 = ₣80\n- 3rd paid hour: 2 × 80 = ₣160\n- 4th paid hour: 2 × 160 = ₣320\n- 5th paid hour: 2 × 320 = ₣640\n- 6th paid hour: 2 × 640 = ₣1,280\n- 7th paid hour: 2 × 1,280 = ₣2,560\n\nTotal cost: 40 + 80 + 160 + 320 + 640 + 1,280 + 2,560 = ₣5,080.\n\nThe answer is 5080."], "expected_answer": "520", "actual_answer": "5080"}
{"question": "Xavier places bananas on some baskets. Each basket can hold 24 bananas. If he has 294 bananas and 12 baskets, how many bananas won't he be able to place on the basket?", "index": 608, "lines": ["Answer: \nStep 1: Calculate the total capacity of the baskets.\n24 bananas/basket × 12 baskets = 288 bananas\n\nStep 2: Subtract the total capacity from the total number of bananas to find the surplus.\n294 bananas - 288 bananas = 6 bananas\n\nThe answer is 6 bananas."], "expected_answer": "6", "actual_answer": "6"}
{"question": "A lasagna has 36 servings. If Ava can eat 3 servings a day while Yuki can eat five times as much, how many days will the lasagna last?", "index": 1890, "lines": ["Answer: \nYuki eats five times as much as Ava, so Yuki eats 5 * 3 = 15 servings per day.\n\nThe total servings eaten per day by both is 3 + 15 = 18 servings.\n\nThe lasagna will last for 36 servings ÷ 18 servings per day = 2 days.\n\nThe answer is 2."], "expected_answer": "2", "actual_answer": "2"}
{"question": "James places olives on some plates. Each plate can hold 22 olives. If he has 345 olives and 11 plates, how many olives won't he be able to place on the plate?", "index": 642, "lines": ["Answer: \nFirst, calculate the total number of olives that can be placed on all plates by multiplying the number of plates by the capacity of each plate.\n\nThe answer is 103 olives."], "expected_answer": "103", "actual_answer": "103"}
{"question": "There are 7 periods in the day for a normal student but Oliver has to take 2 extra classes. Each class is 40 minutes long. He goes to class for 4 days a week. He then spends three-sixths of his weekly minutes each on Saturday and Sunday as extra learning time. How many hours a week does he spend learning?", "index": 3928, "lines": ["Answer: \nThe next step is to calculate the extra learning time Oliver spends on weekends. He spends three-sixths (0.5) of his weekly class time each on Saturday and Sunday.\n\nExtra learning time per day = 0.5 × 1,440 minutes = 720 minutes.  \nTotal extra learning time = 720 minutes × 2 days = 1,440 minutes.\n\nThe answer is 48 hours."], "expected_answer": "48", "actual_answer": "48"}
{"question": "Alejandro caught 7 trouts last Saturday, the first trout he caught weighs 56 kgs, the second trout he caught weighs 37 kgs, and the last trout he caught weighs 31 kgs. If a kg of trout costs €2.0, how much will he earn after selling all the trouts to the market?", "index": 3836, "lines": ["Answer: \nStep 1: Calculate the total weight of all trouts caught.\n\nGiven:\n- First trout: 56 kg\n- Second trout: 37 kg\n- Last trout: 31 kg\n\nTotal weight = 56 kg + 37 kg + 31 kg = 124 kg\n\nThe answer is 124 kg."], "expected_answer": "496", "actual_answer": "124"}
{"question": "A group of 171 students has various hobbies. 7 like to play video games, 43 like to play hurling, and the rest like to either paint or read. How many like to paint if the number that like to read is twice the number that prefer playing hurling?", "index": 161, "lines": ["Answer: \nStep 1: Determine the number of students who like to read.\n\nSince the number of students who like to read is twice the number that like to play hurling, we calculate:\nNumber of students who like to read = 2 × 43 = 86.\n\nStep 2: Calculate the number of students who like to paint.\n\nTotal students who like to paint or read = Total students - Students who like video games - Students who like hurling\n= 171 - 7 - 43 = 121.\n\nNumber of students who like to paint = Total students who like to paint or read - Number of students who like to read\n= 121 - 86 = 35.\n\nThe answer is 35."], "expected_answer": "35", "actual_answer": "35"}
{"question": "Liam has 6 ₣20 bills. He buys 11 coloring books for ₣4 each. He also buys 3 packs of trading cards for ₣2 each. How much money does he have left?", "index": 2604, "lines": ["Answer: \nStep 1: Calculate the total amount of money Liam has initially.\n6 ₣20 bills × 20 = 120\n\nThe answer is 120."], "expected_answer": "70", "actual_answer": "120"}
{"question": "Keisha and Yara are sisters from Stockholm who love collecting signatures from movie stars. During their winter break from school, the sisters spend every afternoon collecting signatures. After 4 weeks, Keisha and Yara compare their autograph books, counting up the number of signatures each sister has collected. Keisha has 16 signatures in her book, and Yara has 45. The sisters have 3 more weeks of winter break, and they decide they want to reach 90 signatures between them by the end of the break. How many signatures do the sisters need to collect to reach their goal?", "index": 1660, "lines": ["Called LLM to parse answer, got The answer is 61.", "Answer: \nStep: Calculate the total number of signatures Keisha and Yara currently have together.\n\nThe answer is 16 + 45 = 61."], "expected_answer": "29", "actual_answer": "61"}
{"question": "Tariq wants to make different sized ice cubes with 348 grams of water. He can make giant cubes that use 12 grams per cube, medium cubes that use 11 grams, and small cubes that use 1/8 of gram. If he makes 10 giant cubes, 24 small cubes, and 13 medium cubes, how many grams of water does he have left?", "index": 567, "lines": ["Answer: \nThe next step is to calculate the total grams of water used by multiplying the number of each cube type by their respective water usage and summing them up. \n\nTotal water used = (10 × 12) + (13 × 11) + (24 × 1/8) = 120 + 143 + 3 = 266 grams.\n\nThen, subtract the total water used from the initial amount:\n\n348 - 266 = 82 grams.\n\nThe answer is 82."], "expected_answer": "82", "actual_answer": "82"}
{"question": "A class of 195 students has various hobbies. 112 like to play music, 15 like to play basketball, and the rest like to either dance or play video games. How many like to dance if the number that like to play video games is twice the number that prefer playing basketball?", "index": 186, "lines": ["Answer: \nThe next logical step is to calculate the number of students who like dancing by subtracting the number of students who like video games from the remaining students after accounting for music and basketball enthusiasts.\n\nStep-by-step explanation:\n1. Total students: 195\n2. Subtract students who like music: 195 - 112 = 83\n3. Subtract students who like basketball: 83 - 15 = 68\n4. Let V = number of students who like video games. Given V = 2 * 15 = 30\n5. Therefore, number of students who like dancing = 68 - 30 = 38\n\nThe answer is 38."], "expected_answer": "38", "actual_answer": "38"}
{"question": "Elena makes coffee using teaspoons of sugar and cups of water in the ratio of 80:70. If she used a total of 600 teaspoons of sugar and cups of water, calculate the number of teaspoonfuls of sugar she used.", "index": 280, "lines": ["Answer: \nThe ratio of sugar to water is 80:70, so there are a total of 150 parts (80 + 70). Each part represents \\( \\frac{600}{150} = 4 \\) teaspoons. Therefore, the number of teaspoons of sugar used is \\( 80 \\times 4 = 320 \\).\n\nThe answer is 320."], "expected_answer": "320", "actual_answer": "320"}
{"question": "Leon collects garbage from 7 different apartment complexes. The first 6 have 200 apartments each and the last one is 60% bigger than the other 6 combined. Leon collects garbage 5 times a week from each place and he gets paid ¥0.4 per collection for each apartment. How much money does he make in a week?", "index": 2453, "lines": ["Answer: \nFirst, calculate the number of apartments in the first six complexes: 6 complexes * 200 apartments = 1200 apartments. The seventh complex is 60% larger, so 0.6 * 1200 = 720 additional apartments, totaling 1920 apartments. \n\nNext, calculate Leon's earnings per collection: 5 collections/week * (6 complexes * 200 apartments * ¥0.4 + 1920 apartments * ¥0.4) = ¥6240.\n\nThe answer is ¥6240."], "expected_answer": "6240", "actual_answer": "6240"}
{"question": "At the beginning of the gathering, there were 72 doctors and 33 engineers. After 45 minutes, three-fifths of the total number of people left. How many engineers are left if 30 doctors stayed at the gathering?", "index": 4122, "lines": ["Answer: \nThe total number of people initially is 72 + 33 = 105. After 45 minutes, three-fifths left, so two-fifths stayed: (2/5) * 105 = 42 people remained. Since 30 doctors stayed, the remaining 42 - 30 = 12 people are engineers. The answer is 12."], "expected_answer": "12", "actual_answer": "12"}
{"question": "An uncle eats 3 tacos per day, his spouse eats 8 tacos per day, and their grandchild eats 7 tacos per day. How many tacos does this family eat in one week?", "index": 1307, "lines": ["Answer: \nWe calculate the total number of tacos eaten by each family member in a week and then sum them up.\n\nNext step: Add the weekly taco consumption of the uncle, spouse, and grandchild: 21 + 56 + 49 = 126 tacos.\n\nThe answer is 126."], "expected_answer": "126", "actual_answer": "126"}
{"question": "There are 39 girls in the field. If there are two-sixths the number of boys in the field, how many kids are in the field?", "index": 2205, "lines": ["Called LLM to parse answer, got The answer is 52.", "Answer: \nThe next step is to calculate the number of boys. Since there are two-sixths the number of boys as girls, we calculate 2/6 of 39 girls.\n\nStep-by-step explanation:\n1. Simplify 2/6 to 1/3.\n2. Multiply 39 by 1/3: 39 * (1/3) = 13.\n3. There are 13 boys.\n\nNow, add the number of boys and girls to find the total number of kids.\n\nThe answer is 39 + 13 = 52."], "expected_answer": "52", "actual_answer": "52"}
{"question": "Xena went to the boardwalk for vacation. Her parents gave her ₺1200 to buy whatever she wanted. At the gift shop, saltwater taffy was on sale for \"Buy 16 pounds at ₺20 per pound, get 5 pounds 1/4 off.\" She scooped up 23 pounds. She also bought a mixed bag of starfish for ₺11.5 and 14 keychains that were ₺20.75 each. How much money does Xena have left?", "index": 2020, "lines": ["Answer: \nNext step: Calculate the total cost of keychains by multiplying the number of keychains (14) by the price per keychain (₱20.75).  \nTotal cost for keychains = 14 × ₱20.75 = ₱290.50  \n\nThe answer is 503."], "expected_answer": "463", "actual_answer": "503"}
{"question": "Prof. Brown sold his villa for $580000. He paid the registration fees that amount to 2% of the selling price and also paid a agent fee that is 4% of the selling price. If he also paid $170000 for the remaining loan amount of the villa, how much is Prof. Brown's net proceeds from selling the villa?", "index": 1705, "lines": ["Answer: \nThe next step is to calculate the total deductions by adding the registration fees, agent fee, and loan amount together: $11,600 + $23,200 + $170,000 = $204,800.  \n\nThe answer is $375,200."], "expected_answer": "375200", "actual_answer": "375200"}
{"question": "Arjun and Luis are currently 6 years apart in age. If Arjun, who is younger than Luis, is 15 years old, what's the average of their ages?", "index": 1588, "lines": ["Answer: \nSince Arjun is 15 and Luis is older by 6 years, Luis is 21. To find the average age, add their ages and divide by 2: (15 + 21) / 2 = 36 / 2 = 18.\n\nThe answer is 18."], "expected_answer": "18", "actual_answer": "18"}
{"question": "Keisha has a flower bed that is 192 feet long. Keisha wants to fill her flower bed with plants. Keisha's flowers grow 7 feet wide so she needs to leave 12.0 feet between every plant. Keisha already owns 10 flowers. Each flowering plant costs $11 at the store, how much money will Keisha spend at the store to fill up her flower bed?", "index": 2267, "lines": ["Answer: \nTo determine how many plants Keisha can fit, calculate the space each plant needs: 7 feet for the plant and 12 feet between plants, totaling 19 feet per plant. Divide the flower bed length by this space: 192 ÷ 19 ≈ 10.105. Since Keisha can't have a fraction of a plant, she can fit 10 plants.  \n\nThe answer is $0."], "expected_answer": "66", "actual_answer": "0"}
{"question": "Faisal caught 4 cods last Friday, the first cod he caught weighs 47 kgs, the second cod he caught weighs 55 kgs, and the last cod he caught weighs 24 kgs. If a kg of cod costs ¥1.0, how much will he earn after selling all the cods to the market?", "index": 3802, "lines": ["Called LLM to parse answer, got The answer is ¥126.00 [final numerical answer].", "Answer: \nLet's calculate the total weight of the cods Faisal caught:\n- First cod: 47 kgs\n- Second cod: 55 kgs\n- Third cod: 24 kgs\n\nTotal weight = 47 + 55 + 24 = 126 kgs\n\nThe answer is ¥126.00"], "expected_answer": "150", "actual_answer": "126"}
{"question": "At Theo's house, there are two times as many oranges as corns. He has a total of 33 corns in his house. Theo bought 75 more corns at the store and 45 fewer oranges than the number of corns. Find the combined total of the number of oranges and corns Theo has in the house?", "index": 4594, "lines": ["Answer: \nThe number of oranges Theo has after buying more is calculated by adding the oranges he already had (66) to the newly bought oranges (63), resulting in 129 oranges. The total number of corns after purchase is 108. Adding these together gives the combined total.\n\nThe answer is 237."], "expected_answer": "204", "actual_answer": "237"}
{"question": "Benjamin collects garbage from 4 different apartment complexes. The first 3 have 400 apartments each and the last one is 55% bigger than the other 3 combined. Benjamin collects garbage 4 times a week from each place and he gets paid ₣0.25 per collection for each apartment. How much money does he make in a week?", "index": 2452, "lines": ["Round 0:\nThe fourth apartment complex has 55% more apartments than the combined total of the first three. Since the first three have 400 each, their combined total is 3 * 400 = 1,200 apartments. The fourth complex is 55% larger, so it has 1,200 + (0.55 * 1,200) = 1,200 + 660 = 1,860 apartments.", "Answer: \nThe total number of apartments is 3,060. Benjamin collects garbage 4 times a week from each complex, so he makes 4 * 4 = 16 collections per week. He gets paid ₣0.25 per collection per apartment, so his weekly earnings are 3,060 apartments * 16 collections * ₣0.25. \n\nThe answer is 12,240."], "expected_answer": "3060", "actual_answer": "12240"}
{"question": "In a 30-item quiz, 50% of the questions are biology, and the rest are equally divided as economics and chemistry questions. If Gabrielle is sure to get 60% of the biology questions, and a fifth of the economics and chemistry questions correctly, how many points is she sure to get?", "index": 969, "lines": ["Answer: \nThe next step is to calculate the total points by adding Gabrielle's correct answers in each category: 9 (biology) + 1.5 (economics) + 1.5 (chemistry) = 12. \n\nThe answer is 12."], "expected_answer": "12", "actual_answer": "12"}
{"question": "Sakura can peel 6 carrots a minute and saute 30 carrots in 5 minutes. How long will it take her to peel and saute 150 carrots?", "index": 2443, "lines": ["Answer: \nSakura needs to peel and sauté 150 carrots. First, calculate the time to peel 150 carrots:  \n150 carrots ÷ 6 carrots per minute = **25 minutes**.  \nNext, calculate the time to sauté 150 carrots:  \n150 carrots ÷ 30 carrots per 5 minutes = 5 batches × 5 minutes per batch = **25 minutes**.  \nTotal time = 25 minutes (peeling) + 25 minutes (sautéing) = **50 minutes**.  \n\nThe answer is 50."], "expected_answer": "50", "actual_answer": "50"}
{"question": "Thiago and Fatima have 84 minutes to walk to the cinema together. It takes them 11 minutes to get to the corner where the mall is. It takes them another 43 minutes to get to the library. How much longer do they have to get to cinema without being late?", "index": 722, "lines": ["Answer: \nThey have already spent 11 + 43 = 54 minutes walking. Subtracting this from the total time: 84 - 54 = 30 minutes.\n\nThe answer is 30 minutes."], "expected_answer": "30", "actual_answer": "30"}
{"question": "Deshawn went to buy some school supplies. He bought 16 rulers which cost $5.5 each, 6 erasers which cost $15.5 each, and a rim of bond paper which cost $22. How much did DeShawn spend on everything?", "index": 908, "lines": ["Called LLM to parse answer, got The answer is 203.", "Answer: \nLet's calculate the cost for each item:\n\n1. **Rulers**: 16 rulers × $5.5 each = $88\n2. **Erasers**: 6 erasers × $15.5 each = $93\n3. **Bond paper**: 1 × $22 = $22\n\n**Next step**: Add all the costs together to find the total amount Deshawn spent.\n\nThe answer is 88 + 93 + 22 = $203."], "expected_answer": "203", "actual_answer": "203"}
{"question": "Quinn has a flower bed that is 189 meters long. Quinn wants to fill her flower bed with plants. Quinn's flowers grow 5 meters wide so she needs to leave 13.5 meters between every plant. Quinn already owns 13 flowers. Each flowering plant costs ₣8 at the store, how much money will Quinn spend at the store to fill up her flower bed?", "index": 2263, "lines": ["Answer: \nTo determine how many plants are needed, calculate the space each plant requires, including spacing:  \nSpace per plant = width of plant + space between plants = 5 meters + 13.5 meters = 18.5 meters.  \n\nNext step: Divide the total bed length by space per plant to find the total number of plants needed.  \nNumber of plants = 189 meters ÷ 18.5 meters/plant ≈ 10.216.  \n\nSince you can't have a fraction of a plant, round up to ensure the entire bed is covered.  \nNumber of plants needed = 11.  \n\nSubtract the 13 plants Quinn already has:  \nAdditional plants needed = 11 - 13 = -2.  \n\nSince Quinn already has more than enough plants, she doesn't need to buy any.  \nThe answer is 0."], "expected_answer": "8", "actual_answer": "0"}
{"question": "It takes Nadia 26 minutes to finish a jigsaw puzzle and 11 minutes to finish a word puzzle. Over the vacation she solved 2 jigsaw puzzles and 8 word puzzles. How much time did she spend playing these games?", "index": 3415, "lines": ["Answer: \nThe next step is to calculate the total time spent on each type of puzzle by multiplying the time per puzzle by the number of puzzles solved.\n\nFor jigsaw puzzles:  \n26 minutes/puzzle × 2 puzzles = 52 minutes  \n\nFor word puzzles:  \n11 minutes/puzzle × 8 puzzles = 88 minutes  \n\nThe total time spent is the sum of these two amounts.  \n\nThe answer is 140 minutes."], "expected_answer": "140", "actual_answer": "140"}
{"question": "Mia's aunt said that she had ₺300 budgeted for her birthday party. She wants to make sure she and her friends all get to play one round of laser tag, have ₺5 in pinball tokens, and get to ride the roller coaster seven times. A round of laser tag is ₺10. The roller coaster cost ₺5 a ride. How many friends can she invite?", "index": 4800, "lines": ["Answer: \nMia's total budget is ₺300. Each person's cost is calculated as follows: laser tag (10) + pinball (5) + roller coaster (7×5=35) = 50 per person. To find the number of people, divide the budget by the cost per person: 300 ÷ 50 = 6. Since Mia is included, she can invite 5 friends.\n\nThe answer is 5 friends."], "expected_answer": "5", "actual_answer": "5"}
{"question": "The Williams family is busy making muffins. So far, they've made 9925 muffins. They have 1085 peanut butter muffins, 2051 lemon muffins, and some vanilla muffins. How many vanilla muffins have they made?", "index": 4195, "lines": ["Answer: \nThe next step is to add the number of peanut butter and lemon muffins to find the total number of non-vanilla muffins:  \n1085 (peanut butter) + 2051 (lemon) = 3136 muffins.\n\nThen, subtract this total from the overall muffin count to find the vanilla muffins:  \n9925 - 3136 = 6789 vanilla muffins.\n\nThe answer is 6789."], "expected_answer": "6789", "actual_answer": "6789"}
{"question": "Uma went to the coast for vacation. Her parents gave her ₣1300 to buy whatever she wanted. At the seaside store, cotton candy was on sale for \"Buy 15 kgs at ₣21 per kg, get 5 kgs 2/3 off.\" She scooped up 22 kgs. She also bought a mixed bag of coral pieces for ₣11.75 and 17 pins that were ₣21.25 each. How much money does Uma have left?", "index": 2026, "lines": ["Answer: \nThe next step is to calculate the total cost of the pins.  \n17 pins at ₣21.25 each:  \n17 × 21.25 = ₣361.25  \n\nThe answer is ₣577."], "expected_answer": "535", "actual_answer": "577"}
{"question": "Alejandro collects garbage from 6 different apartment complexes. The first 5 have 200 apartments each and the last one is 45% bigger than the other 5 combined. Alejandro collects garbage 2 times a week from each place and he gets paid $0.25 per collection for each apartment. How much money does he make in a week?", "index": 2490, "lines": ["Answer: \nFirst, calculate the number of apartments in the sixth complex: 5 complexes × 200 apartments = 1000 apartments. The sixth complex is 45% larger: 1000 × 0.45 = 450. So, the sixth complex has 1000 + 450 = 1450 apartments.\n\nNext, calculate the total number of apartments: 5 × 200 + 1450 = 1000 + 1450 = 2450 apartments.\n\nThen, determine the number of collections per week: 2 collections per complex × 6 complexes = 12 collections.\n\nHowever, each collection includes all apartments in a complex. So, total collections per week are:\n\nFor the first five complexes: 2 × 200 = 400 apartments each week. Total for five complexes: 5 × 400 = 2000.\n\nFor the sixth complex: 2 × 1450 = 2900 apartments.\n\nTotal collections: 2000 + 2900 = 4900.\n\nFinally, calculate earnings: 4900 collections × $0.25 = $1225.\n\nThe answer is 1225."], "expected_answer": "1225", "actual_answer": "1225"}
{"question": "Mohammed caught 5 steelheads last Tuesday, the first steelhead he caught weighs 64 kgs, the second steelhead he caught weighs 48 kgs, and the last steelhead he caught weighs 23 kgs. If a kg of steelhead costs €1.0, how much will he earn after selling all the steelheads to the market?", "index": 3807, "lines": ["Round 0:\nThe problem states Mohammed caught 5 steelheads, but only provides weights for the first, second, and fifth fish. Missing are the weights of the third and fourth steelheads. Without these, we cannot calculate the total weight and thus the earnings.  \n\nNext step: Ask for the weights of the third and fourth steelheads to proceed with the calculation.  \n\nThe answer cannot be determined with the current information.", "Called LLM to parse answer, got The answer is ####.", "Round 1:\nThe problem requires the weights of all five steelheads to calculate total earnings. Since weights of the third and fourth steelheads are missing, we cannot proceed further with the calculation.\n\nThe answer is #### The answer cannot be determined with the current information.", "Called LLM to parse answer, got The answer is #### 0.", "Answer: \nThe answer is #### The answer cannot be determined with the current information."], "expected_answer": "181", "actual_answer": "0"}
{"question": "Jamal was a pen pal with 5 people. He stopped being penpals with 2 of them. They each send 2 letters a week that are 10 pages long. He responds in kind. He can write a page every 12 minutes. How many hours does he spend writing a week?", "index": 3624, "lines": ["Answer: \nNext step: Calculate the total number of letters Jamal receives each week. Since each of the 3 pen pals sends 2 letters per week, multiply 3 by 2 to find the total letters.\n\nStep explanation: Jamal has 3 active pen pals, each sending 2 letters weekly. So, total letters received = 3 * 2 = 6 letters per week.\n\nThe answer is 6 letters per week."], "expected_answer": "12", "actual_answer": "6"}
{"question": "A care facility has a capacity of 1000 beds with 1/10 occupied. Due to the pandemic, 55 patients are admitted into the care facility each day. Calculate the total number of unoccupied beds in the care facility after 2 weeks.", "index": 1417, "lines": ["Answer: \nThe total number of patients admitted over 14 days is calculated by multiplying 55 patients/day by 14 days, resulting in 770 patients. \n\nThe next step is to add these admissions to the initial occupied beds and subtract from the total capacity to find the unoccupied beds.\n\nThe answer is 130 unoccupied beds. \n\nThe answer is 130."], "expected_answer": "130", "actual_answer": "130"}
{"question": "Priya has a flower bed that is 175 feet long. Priya wants to fill her flower bed with plants. Priya's flowers grow 2 feet wide so she needs to leave 12.5 feet between every plant. Priya already owns 13 flowers. Each flowering plant costs ¥7 at the store, how much money will Priya spend at the store to fill up her flower bed?", "index": 2295, "lines": ["Called LLM to parse answer, got The answer is 13 [13].", "Round 0:\nTo determine how many plants Priya needs, calculate the total space required per plant (2 feet width + 12.5 feet spacing = 14.5 feet). Divide the flower bed length by this space: 175 ÷ 14.5 ≈ 12.06. Since partial plants aren't possible, round up to 13 plants.\n\nThe answer is 13 [13].", "Answer: \nThe next step is to calculate the total cost by multiplying the number of plants by the cost per plant: 13 plants × ¥7 = ¥91. \n\nThe answer is ¥91."], "expected_answer": "7", "actual_answer": "91"}
{"question": "Ali caught 6 trouts last Wednesday, the first trout he caught weighs 51 kilograms, the second trout he caught weighs 45 kilograms, and the last trout he caught weighs 21 kilograms. If a kilogram of trout costs $0.5, how much will he earn after selling all the trouts to the market?", "index": 3818, "lines": ["Answer: \nThe next step is to calculate the total weight of the trouts by adding their individual weights.\n\nTotal weight = 51 kg + 45 kg + 21 kg = 117 kg\n\nThe answer is \\boxed{58.5} dollars."], "expected_answer": "90", "actual_answer": "58.5"}
{"question": "There are 9 periods in the day for a normal student but Arjun has to take 1 extra classes. Each class is 55 minutes long. He goes to class for 6 days a week. He then spends 1/2 of his weekly minutes each on Saturday and Sunday as extra learning time. How many hours a week does he spend learning?", "index": 3929, "lines": ["Answer: \nHe attends 10 classes per day (9 periods + 1 extra), each lasting 55 minutes. Over 6 days, this totals 6 * 10 * 55 = 3,300 minutes. On weekends, he adds 1/2 of this weekly time each day, totaling 3,300 + 3,300 = 6,600 minutes. Converting to hours: 6,600 ÷ 60 = 110 hours.\n\nThe answer is 110 hours."], "expected_answer": "110", "actual_answer": "110"}
{"question": "If Jasmine and Leon have 220 feet of fence between them, and they agree to split it with Leon getting 90 feet more than Jasmine, how much is left over for Jasmine?", "index": 4294, "lines": ["Called LLM to parse answer, got The answer is 65 [final numerical answer].", "Answer: \nLet J represent the amount Jasmine gets. Leon gets J + 90. Together, J + (J + 90) = 220.\n\nStep 1: Combine like terms: 2J + 90 = 220.\n\nThe next step is to subtract 90 from both sides:  \n2J = 130.\n\nThe answer is 65. [Jasmine gets 65 feet.]"], "expected_answer": "65", "actual_answer": "65"}
{"question": "There are 8 girls in the yard. If there are three-fourths the number of boys in the yard, how many kids are in the yard?", "index": 2219, "lines": ["Answer: \nThe number of boys is three-fourths of the number of girls. Since there are 8 girls, the number of boys is (3/4) * 8 = 6. Adding the boys and girls together gives the total number of kids: 8 + 6 = 14.\n\nThe answer is 14."], "expected_answer": "14", "actual_answer": "14"}
{"question": "Umar finished 1/3 of a 261 piece puzzle, and then started and finished another 398 piece puzzle within an hour. How many puzzle pieces did Umar place during that hour?", "index": 3982, "lines": ["Answer: \nThe next step is to calculate how many pieces Umar placed during that hour.\n\n1. Calculate the number of pieces from the first puzzle: \\( \\frac{1}{3} \\times 261 = 87 \\) pieces.\n2. Add the pieces from the second puzzle: \\( 87 + 398 = 485 \\) pieces.\n\nThe answer is 485."], "expected_answer": "485", "actual_answer": "485"}
{"question": "Mrs. Smith is looking for a house that will not go beyond her $400000 budget. She saw a property that has a selling price of $350000. On top of that, the buyer has to pay a brokerage fee which is 7% of the selling price, and also the transfer fee that is 11% of the selling price. How much more is the total price of the house than Mrs. Smith's budget?", "index": 1623, "lines": ["Answer: \nThe total additional fees are $63,000, so adding that to the selling price gives a total price of $413,000. Subtracting Mrs. Smith's budget of $400,000 from this total price shows the excess.\n\nThe answer is $13,000."], "expected_answer": "13000", "actual_answer": "13000"}
{"question": "Prof. Rodriguez sold his villa for $790000. He paid the registration fees that amount to 3% of the selling price and also paid a agent fee that is 4% of the selling price. If he also paid $340000 for the remaining loan amount of the villa, how much is Prof. Rodriguez's net proceeds from selling the villa?", "index": 1716, "lines": ["Answer: \nThe next step is to calculate the total fees and expenses by adding the registration fees, agent fees, and the loan payment. \n\nStep-by-step explanation:\n1. Calculate registration fees: 3% of $790,000 = $23,700.\n2. Calculate agent fees: 4% of $790,000 = $31,600.\n3. Add the loan payment: $340,000.\n4. Sum these amounts to get total expenses: $23,700 + $31,600 + $340,000 = $395,300.\n\nThe answer is 394700 [numerical answer]."], "expected_answer": "394700", "actual_answer": "394700"}
{"question": "A grandfather eats 8 hamburgers per day, his partner eats 5 hamburgers per day, and their son eats 6 hamburgers per day. How many hamburgers does this family eat in one week?", "index": 1311, "lines": ["Answer: \nNext step: Calculate the weekly hamburger consumption for each family member by multiplying their daily intake by 7, then add them together.\n\nThe grandfather eats 8 hamburgers/day × 7 days = 56 hamburgers/week.  \nThe partner eats 5 hamburgers/day × 7 days = 35 hamburgers/week.  \nThe son eats 6 hamburgers/day × 7 days = 42 hamburgers/week.  \n\nTotal hamburgers eaten in a week = 56 + 35 + 42 = 133 hamburgers.  \n\nThe answer is 133."], "expected_answer": "133", "actual_answer": "133"}
{"question": "There are 9 periods in the day for a normal student but Liam has to take 3 extra classes. Each class is 30 minutes long. He goes to class for 5 days a week. He then spends one-third of his weekly minutes each on Saturday and Sunday as extra learning time. How many hours a week does he spend learning?", "index": 3908, "lines": ["Answer: \nThe next step is to calculate the total time Liam spends in classes during the school week.  \nEach day, he attends 12 classes (9 + 3), each 30 minutes long.  \nTotal daily time = 12 classes × 30 minutes/class = 360 minutes.  \nWeekly time during school days = 5 days × 360 minutes/day = 1800 minutes.\n\nThe answer is 50 hours."], "expected_answer": "50", "actual_answer": "50"}
{"question": "Mia can run two times faster than she can walk, but she can skip at a rate of speed that is two-thirds as fast as she can run. If she can skip at 2 miles per hour, how many miles can she travel in 8 hours if she spends 1/2 of the time running and 1/2 of the time walking?", "index": 4422, "lines": ["Answer: \nMia skips at 2 mph, which is two-thirds her running speed. Let running speed be \\( R \\). Then \\( 2 = \\frac{2}{3}R \\) → \\( R = 3 \\) mph. Walking speed is \\( \\frac{R}{2} = 1.5 \\) mph. She spends 4 hours running and 4 hours walking. Distance running: \\( 3 \\times 4 = 12 \\) miles. Distance walking: \\( 1.5 \\times 4 = 6 \\) miles. Total distance: \\( 12 + 6 = 18 \\) miles.\n\nThe answer is 18."], "expected_answer": "18", "actual_answer": "18"}
{"question": "I have 19 liters of peach drink that are 2/5 water and I wish to add it to 24 liters of lemon drink that is one-half water. But as I pour it, I spill 4 liters of the peach drink. How much water is in the remaining 39 liters?", "index": 2981, "lines": ["Answer: \nFirst, calculate the amount of water in the spilled peach drink: (2/5) * 4 = 1.6 liters. Subtract this from the total water in the original peach drink to find the water remaining after spillage: 7.6 - 1.6 = 6 liters.\n\nThe answer is 18 liters."], "expected_answer": "18", "actual_answer": "18"}
{"question": "Sanjay places almonds on some tables. Each table can hold 23 almonds. If he has 276 almonds and 7 tables, how many almonds won't he be able to place on the table?", "index": 625, "lines": ["Answer: \nThe next step is to calculate the total number of almonds that can be placed on the tables by multiplying the number of tables by the capacity per table. \n\nTotal almonds that can be placed = 23 almonds/table × 7 tables = 161 almonds.\n\nThe answer is 115 almonds."], "expected_answer": "115", "actual_answer": "115"}
{"question": "A stack is made out of 4 white tiles, seven times as many purple tiles, and an unknown number of green tiles. If there are 44 tiles in the stack in total, how many green tiles are there?", "index": 2093, "lines": ["Answer: \nThe next step is to calculate the number of green tiles by subtracting the total number of white and purple tiles from the overall total.\n\nNumber of green tiles = 44 - (4 white + 28 purple) = 44 - 32 = 12.\n\nThe answer is 12."], "expected_answer": "12", "actual_answer": "12"}
{"question": "Kayla is knitting winter wear for her 4 grandchildren. They're quadruplets, so they're all the same size. She wants to make a hat, poncho, cardigan, leg warmers, and socks for each of them. It takes 14 skeins of wool to make a hat, 18 for a poncho, 5 for a cardigan, 9 for a pair of leg warmers, and 3 for a pair of socks. How many skeins of wool will she need to buy?", "index": 1162, "lines": ["Answer: \nNext step: Calculate the total number of skeins needed for each item by multiplying the number of sets by the skeins required for each item.\n\nThe answer is 196."], "expected_answer": "196", "actual_answer": "196"}
{"question": "Mohammed has 9 tubes of gray paint and 16 tubes of green paint. Oliver has four-sixths as many tubes of gray paint as Mohammed, and twice as many tubes of green paint as Mohammed. How many tubes of paint does Oliver have?", "index": 2878, "lines": ["Answer: \nOliver has four-sixths as many gray paint tubes as Mohammed, so calculate 4/6 of 9: (4/6)*9 = 6. Oliver has twice as many green paint tubes as Mohammed, so 2*16 = 32. Total tubes = 6 + 32 = 38.\n\nThe answer is 38."], "expected_answer": "38", "actual_answer": "38"}
{"question": "A loaf of bread at the store costs €8. Croissants cost €2 each. How much more do 5 loaves of bread cost than 3 croissants?", "index": 1901, "lines": ["Answer: \nStep 1: Calculate the total cost of 5 loaves of bread.  \n5 loaves × €8 per loaf = €40.\n\nStep 2: Calculate the total cost of 3 croissants.  \n3 croissants × €2 per croissant = €6.\n\nStep 3: Determine how much more 5 loaves cost than 3 croissants by subtracting the two totals.  \n€40 - €6 = €34.\n\nThe answer is 34."], "expected_answer": "34", "actual_answer": "34"}
{"question": "There are 6 periods in the day for a normal student but Jin has to take 2 extra classes. Each class is 35 minutes long. He goes to class for 6 days a week. He then spends one-eighth of his weekly minutes each on Saturday and Sunday as extra learning time. How many hours a week does he spend learning?", "index": 3925, "lines": ["Answer: \nThe answer is 35 hours."], "expected_answer": "35", "actual_answer": "35"}
{"question": "Kai caught 6 trouts last Monday, the first trout he caught weighs 75 kgs, the second trout he caught weighs 41 kgs, and the last trout he caught weighs 24 kgs. If a kg of trout costs ¥1.75, how much will he earn after selling all the trouts to the market?", "index": 3832, "lines": ["Answer: \nThe next step is to calculate the total weight of all the trouts Kai caught.\n\nStep 1: Add the weights of all three trouts.\n75 kg (first trout) + 41 kg (second trout) + 24 kg (last trout) = 140 kg\n\nThe answer is 140 kg."], "expected_answer": "371", "actual_answer": "140"}
{"question": "A loaf of bread at the bakery costs ₺7. Bagels cost ₺4 each. How much more do 3 loaves of bread cost than 4 bagels?", "index": 1910, "lines": ["Answer: \nStep 1: Calculate the total cost of 3 loaves of bread.  \n3 loaves × ₺7 each = ₺21.\n\nStep 2: Calculate the total cost of 4 bagels.  \n4 bagels × ₺4 each = ₺16.\n\nStep 3: Determine how much more the bread costs than the bagels by subtracting the total cost of the bagels from the total cost of the bread.  \n₪21 (bread) - ₺16 (bagels) = ₺5.\n\nThe answer is 5."], "expected_answer": "5", "actual_answer": "5"}
{"question": "At the beginning of the party, there were 65 teachers and 10 nurses. After two hours, one-fifth of the total number of people left. How many nurses are left if 18 teachers stayed at the party?", "index": 4118, "lines": ["Called LLM to parse answer, got The answer is #### [unable to determine].", "Round 0:\nThe problem is inconsistent because the number of teachers who stayed (18) and the total number of people remaining (60) cannot be reconciled with the initial counts and the number of people who left. The answer cannot be determined from the given information.\n\nThe answer is #### [unable to determine]", "Called LLM to parse answer, got The answer is 0.", "Answer: \nThe problem is inconsistent because the number of teachers who stayed (18) and the total number of people remaining (60) cannot be reconciled with the initial counts and the number of people who left. The answer cannot be determined from the given information.\n\nThe answer is #### [unable to determine]"], "expected_answer": "42", "actual_answer": "0"}
{"question": "If Luis and Amelia have 620 yards of fence between them, and they agree to split it with Amelia getting 60 yards more than Luis, how much is left over for Luis?", "index": 4266, "lines": ["Answer: \nLet L be the amount of fence Luis gets. Amelia gets L + 60 yards.  \nThe total fence is 620 yards, so:  \nL + (L + 60) = 620  \n2L + 60 = 620  \n2L = 560  \nL = 280  \n\nThe answer is 280 yards."], "expected_answer": "280", "actual_answer": "280"}
{"question": "At the beginning of the conference, there were 64 doctors and 72 engineers. After half an hour, two-fourths of the total number of people left. How many engineers are left if 19 doctors stayed at the conference?", "index": 4127, "lines": ["Answer: \nFirst, calculate the total number of people initially at the conference: 64 doctors + 72 engineers = 136 people. After half an hour, two-fourths (which is half) of 136 people left, which is 68 people. This means 136 - 68 = 68 people remained. Given that 19 doctors stayed, subtract the number of staying doctors from the initial number of doctors to find how many doctors left: 64 - 19 = 45 doctors left. Subtract the number of doctors who left from the total number of people who left to find how many engineers left: 68 - 45 = 23 engineers left. Finally, subtract the number of engineers who left from the initial number of engineers to find how many engineers remain: 72 - 23 = 49 engineers.\n\nThe answer is 49."], "expected_answer": "49", "actual_answer": "49"}
{"question": "At Pavel's house, there are seven times as many bananas as grapes. He has a total of 34 grapes in his house. Pavel bought 53 more grapes at the store and 35 fewer bananas than the number of grapes. Find the combined total of the number of bananas and grapes Pavel has in the house?", "index": 4555, "lines": ["Answer: \nThe number of grapes after buying is 34 + 53 = 87. Pavel bought 35 fewer bananas than the number of grapes, so he bought 87 - 35 = 52 bananas. The new total of bananas is 238 + 52 = 290. The combined total of bananas and grapes is 290 + 87 = 377.\n\nThe answer is 377."], "expected_answer": "343", "actual_answer": "377"}
{"question": "Deshawn is rolling a d12 die. How much more likely is it (expressed as a percentage) that he rolls a number greater than 3 than that he rolls two odd numbers in a row?", "index": 122, "lines": ["Answer: \nThe probability of rolling a number greater than 3 is 9/12 = 0.75, and the probability of rolling two odd numbers in a row is (6/12) * (6/12) = 0.25. The difference is 0.75 - 0.25 = 0.5, which is 50%. \n\nThe answer is 50% more likely."], "expected_answer": "50", "actual_answer": "50"}
{"question": "Kai has ₺63.11 and wants to buy 51 anchors from a bin at the hardware store. Each anchor costs ₺0.61. How much money does Kai have left after paying for the anchors?", "index": 1510, "lines": ["Answer: \nStep 1: Calculate the total cost of 51 anchors by multiplying 51 by 0.61.\n\nThe total cost is 51 * 0.61 = 31.11.\n\nThe answer is 31.11."], "expected_answer": "32", "actual_answer": "31.11"}
{"question": "Umar collects garbage from 3 different apartment complexes. The first 2 have 450 apartments each and the last one is 20% bigger than the other 2 combined. Umar collects garbage 2 times a week from each place and he gets paid ₣0.45 per collection for each apartment. How much money does he make in a week?", "index": 2450, "lines": ["Answer: \nFirst, determine the number of apartments in the third complex. Since it's 20% bigger than the combined size of the first two complexes, calculate 20% of (450 + 450) = 900 apartments. \n20% of 900 = 180 apartments. \nSo, the third complex has 900 + 180 = 1080 apartments.\n\nNext step: Calculate the total number of apartments Umar collects from each complex once and then multiply by two (since he collects twice a week). \n\nThe number of apartments per week is: (450 + 450 + 1080) = 2000 apartments. \nSince he collects twice a week, total collections per week = 2000 * 2 = 4000 collections.\n\nThe answer is 4000 collections."], "expected_answer": "1782", "actual_answer": "4000"}
{"question": "Ava operates the cash register exactly three times as fast as her less-experienced colleague Uma. Daily, Uma processes 61 customers. What is the total weekly production for the two if they work all days of the week?", "index": 4875, "lines": ["Answer: \nAva's daily customer processing is 3 × 61 = 183. The total daily production for both is 183 + 61 = 244. Multiplying by 7 days gives 244 × 7 = 1708.\n\nThe answer is 1708."], "expected_answer": "1708", "actual_answer": "1708"}
{"question": "Olivia receives 172 emails a day. 25% of those emails don't require any response. Olivia responds to the rest of them. How many emails does Olivia respond to in a 3 day work week?", "index": 1365, "lines": ["Answer: \nLet's break down the solution step by step:\n\n1. **Total Emails per Day**: Olivia receives 172 emails each day.\n2. **Non-Response Emails**: 25% of these emails don't require a response. \n   - Calculation: 25% of 172 = 0.25 × 172 = 43 emails.\n3. **Emails Requiring Response**: Subtract the non-response emails from the total.\n   - Calculation: 172 - 43 = 129 emails.\n4. **Total Responses in 3 Days**: Multiply the daily response emails by 3.\n   - Calculation: 129 × 3 = 387 emails.\n\n**Answer**: The answer is 387."], "expected_answer": "387", "actual_answer": "387"}
{"question": "At Leon's house, there are ten times as many figs as plums. He has a total of 65 plums in his house. Leon bought 59 more plums at the store and 47 fewer figs than the number of plums. Find the combined total of the number of figs and plums Leon has in the house?", "index": 4584, "lines": ["Answer: \nFirst, calculate the initial number of figs: 10 times the number of plums, which is 10 × 65 = 650 figs.\n\nNext, determine the new number of plums after buying 59 more: 65 + 59 = 124 plums.\n\nThen, find out how many figs Leon bought: 47 fewer than the new number of plums, so 124 - 47 = 77 figs.\n\nAdd the bought figs to the initial figs: 650 + 77 = 727 figs.\n\nNow, add the new number of plums and the updated number of figs to find the combined total: 727 + 124 = 851.\n\nThe answer is 851."], "expected_answer": "786", "actual_answer": "851"}
{"question": "Camila has a flower bed that is 208 feet long. Camila wants to fill her flower bed with plants. Camila's flowers grow 2 feet wide so she needs to leave 16.0 feet between every plant. Camila already owns 11 flowers. Each flowering plant costs ₣3 at the store, how much money will Camila spend at the store to fill up her flower bed?", "index": 2292, "lines": ["Answer: \nTo determine how many plants Camila can fit, calculate the total space each plant and gap occupy: 2 feet for the plant and 16 feet between plants, totaling 18 feet per plant (except the last one). Divide the flower bed length by this space: 208 ÷ 18 ≈ 11.56, meaning 11 full plants fit with some space left. Since Camila already owns 11, she doesn’t need to buy any more. The answer is 0."], "expected_answer": "6", "actual_answer": "0"}
{"question": "Mia went to the beach for vacation. Her parents gave her ₣1200 to buy whatever she wanted. At the souvenir store, fudge was on sale for \"Buy 15 kilograms at ₣22 per kilogram, get 4 kilograms 1/4 off.\" She scooped up 22 kilograms. She also bought a mixed bag of sand dollars for ₣11.25 and 15 postcards that were ₣20.25 each. How much money does Mia have left?", "index": 2002, "lines": ["Answer: \nThe next step is to calculate the total cost of the fudge Mia bought. The store's deal is \"Buy 15 kilograms at ₣22/kg, get 4 kilograms 25% off.\" Mia took 22 kilograms, which includes one full deal (15 kg at full price) and an additional 7 kg at full price, since the deal only applies once. \n\n1. Calculate the cost for the first 15 kg:  \n   15 kg × ₣22/kg = ₣330  \n\n2. Calculate the discounted cost for the next 4 kg:  \n   4 kg × (₱22 × 0.75) = 4 kg × ₣16.5 = ₣66  \n\n3. Calculate the cost for the remaining 3 kg (since 15 + 4 + 3 = 22 kg):  \n   3 kg × ₣22/kg = ₣66  \n\n**Total fudge cost:**  \n₱330 + ₳66 + ₳66 = ₳462  \n\nThe answer is 462."], "expected_answer": "423", "actual_answer": "462"}
{"question": "Noah caught 5 salmons last Monday, the first salmon he caught weighs 78 pounds, the second salmon he caught weighs 50 pounds, and the last salmon he caught weighs 25 pounds. If a pound of salmon costs ¥2.0, how much will he earn after selling all the salmons to the market?", "index": 3843, "lines": ["Answer: \nThe next step is to calculate the total weight of the salmon Noah caught by adding the weights of each salmon: 78 + 50 + 25. This gives a total weight of 153 pounds.  \n\nThe answer is ¥306."], "expected_answer": "406", "actual_answer": "306"}
{"question": "At Qasim's house, there are ten times as many bananas as pears. He has a total of 88 pears in his house. Qasim bought 77 more pears at the store and 44 fewer bananas than the number of pears. Find the combined total of the number of bananas and pears Qasim has in the house?", "index": 4581, "lines": ["Answer: \nLet's break down the problem step by step:\n\n1. **Initial Count of Pears and Bananas:**\n   - Qasim has 88 pears.\n   - There are ten times as many bananas as pears, so:\n     \\[\n     \\text{Bananas} = 10 \\times 88 = 880\n     \\]\n\n2. **After Buying More Pears:**\n   - Qasim buys 77 more pears.\n     \\[\n     \\text{New pears} = 88 + 77 = 165\n     \\]\n\n3. **Bananas After Purchase:**\n   - He buys 44 fewer bananas than the new number of pears.\n     \\[\n     \\text{New bananas} = 165 - 44 = 121\n     \\]\n\n4. **Combined Total:**\n   - Add the new counts of pears and bananas:\n     \\[\n     \\text{Total} = 165 + 121 = 286\n     \\]\n\nThe answer is \\boxed{286}."], "expected_answer": "1078", "actual_answer": "286"}
{"question": "When the water is cold Gabrielle swims a mile in 22 minutes. When the water is warm Gabrielle swims a mile in 6 minutes more than two times as long. How much longer does Gabrielle take to swim 6 miles on a hot day than a cold day?", "index": 4681, "lines": ["Answer: \nTo determine the time difference for swimming 6 miles, calculate the time taken on both days:\n\n1. **Time on cold day:**  \n   Gabrielle takes 22 minutes per mile.  \n   Time = 6 miles × 22 minutes/mile = 132 minutes.\n\n2. **Time on warm day:**  \n   She takes 6 minutes more than twice the cold time per mile.  \n   Time per mile = 2 × 22 + 6 = 50 minutes.  \n   Time = 6 miles × 50 minutes/mile = 300 minutes.\n\n3. **Difference in time:**  \n   Time difference = 300 minutes - 132 minutes = 168 minutes.\n\nThe answer is 168 minutes."], "expected_answer": "168", "actual_answer": "168"}
{"question": "To make a call from a hotel room phone, you must pay €0.7 for each minute of your call. After 10 minutes, that price drops to €0.2 per minute. How much would a 60-minute call cost?", "index": 537, "lines": ["Answer: \nThe call duration is 60 minutes. The first 10 minutes cost €0.7 per minute, and the remaining 50 minutes cost €0.2 per minute. \n\nNext step: Calculate the cost for the first 10 minutes and the cost for the remaining 50 minutes.\n\nCost for the first 10 minutes: 10 × €0.7 = €7.00  \nCost for the remaining 50 minutes: 50 × €0.2 = €10.00  \n\nTotal cost: €7.00 + €10.00 = €17.00  \n\nThe answer is €17.00."], "expected_answer": "17", "actual_answer": "17"}
{"question": "When the water is cold James swims a mile in 26 minutes. When the water is warm James swims a mile in 5 minutes more than two times as long. How much longer does James take to swim 6 miles on a hot day than a cold day?", "index": 4663, "lines": ["Round 0:\nTo find the time per mile on a hot day, calculate 2 times 26 minutes plus 5 minutes.\n\nThe next step is to determine the time per mile when the water is hot. Since James takes 5 minutes more than twice as long as he does in cold water, we calculate: 2 * 26 + 5. This will give the time per mile in warm water.\n\nThe next step is to calculate the time per mile on a hot day.\n\nThe time per mile on a hot day is 2 * 26 + 5 = 57 minutes.", "Answer: \nThe next step is to calculate the total time James takes to swim 6 miles on a hot day and 6 miles on a cold day, then find the difference between these times.\n\nThe time per mile on a hot day is 57 minutes, so for 6 miles: 57 * 6 = 342 minutes.\n\nThe time per mile on a cold day is 26 minutes, so for 6 miles: 26 * 6 = 156 minutes.\n\nThe difference is 342 - 156 = 186 minutes.\n\nThe answer is 186 minutes."], "expected_answer": "186", "actual_answer": "186"}
{"question": "Nadia can run six times faster than she can walk, but she can skip at a rate of speed that is 1/3 as fast as she can run. If she can skip at 4 miles per hour, how many miles can she travel in 4 hours if she spends two-fourths of the time running and 2/4 of the time walking?", "index": 4434, "lines": ["Answer: \nThe next step is to calculate the total distance Nadia can travel by adding the distance she runs and the distance she walks. \n\nDistance running = 12 mph * 2 hours = 24 miles  \nDistance walking = 2 mph * 2 hours = 4 miles  \nTotal distance = 24 + 4 = 28 miles  \n\nThe answer is 28 miles."], "expected_answer": "28", "actual_answer": "28"}
{"question": "Leilani operates the cash register exactly eight times as fast as her less-experienced colleague Chen. Daily, Chen processes 68 customers. What is the total weekly production for the two if they work all days of the week?", "index": 4857, "lines": ["Answer: \nNext step: Calculate Leilani's daily production by multiplying Chen's rate by 8.\n\nLeilani's daily production = 8 * 68 = 544 customers\n\nThe answer is 544 [customers per day]."], "expected_answer": "4284", "actual_answer": "544"}
{"question": "Kai's car breaks down. The car weighs 1450 pounds and he has luggage in it weighing 325 pounds. He also has his 3 young children who weigh 75 pounds each in it. If the force to move the car is 1% of the weight, how much force does he need to push the car?", "index": 3398, "lines": ["Answer: \nThe first step is to calculate the total weight that needs to be moved. This includes the car's weight, luggage, and the weight of the three children. \n\nStep 1: Calculate the total weight.\n- Car weight = 1450 pounds\n- Luggage weight = 325 pounds\n- Each child's weight = 75 pounds\n- Total children's weight = 3 × 75 = 225 pounds\n\nTotal weight = 1450 + 325 + 225 = 2000 pounds\n\nThe next step is to determine the force needed, which is 1% of the total weight.\n\nStep 2: Calculate the force.\nForce = 1% of 2000 pounds = 0.01 × 2000 = 20 pounds\n\nThe answer is 20 pounds."], "expected_answer": "20", "actual_answer": "20"}
{"question": "Yuki caught 6 steelheads last Wednesday, the first steelhead he caught weighs 68 kilograms, the second steelhead he caught weighs 53 kilograms, and the last steelhead he caught weighs 27 kilograms. If a kilogram of steelhead costs €1.0, how much will he earn after selling all the steelheads to the market?", "index": 3820, "lines": ["Called LLM to parse answer, got The answer is 148 [final numerical answer].", "Answer: \nLet's calculate the total weight of all steelheads:\n\n68 + 53 + 27 = 148 kilograms\n\nNow, to find out how much Yuki will earn, multiply the total weight by the cost per kilogram:\n\n148 kg × €1.0/kg = €148.00\n\nThe answer is €148.00"], "expected_answer": "229", "actual_answer": "148"}
{"question": "Esteban wants to make different sized ice cubes with 334 ounces of water. He can make giant cubes that use 12 ounces per cube, medium cubes that use 11 ounces, and small cubes that use 1/3 of ounce. If he makes 10 giant cubes, 15 small cubes, and 13 medium cubes, how many ounces of water does he have left?", "index": 554, "lines": ["Answer: \nThe next step is to calculate the total amount of water used for each type of cube:\n- Giant cubes: 10 cubes * 12 ounces = 120 ounces  \n- Medium cubes: 13 cubes * 11 ounces = 143 ounces  \n- Small cubes: 15 cubes * (1/3) ounce = 5 ounces  \n\nTotal water used = 120 + 143 + 5 = 268 ounces  \n\nThe answer is 66 ounces."], "expected_answer": "66", "actual_answer": "66"}
{"question": "Gabrielle walks 35 miles every day on her favorite walking trail, which includes 19 miles of walking on the beach and 16 miles of walking on the sidewalk. On the sidewalk, Gabrielle walks at two times the rate of speed that she does on the beach. If 57 minutes of her walk is spent on the beach, how long does it take for her to complete the entire 35-mile walk, in minutes?", "index": 853, "lines": ["Answer: \nGabrielle's walking speed on the beach is calculated by dividing the beach distance by the beach time: \\( \\frac{19 \\text{ miles}}{57 \\text{ minutes}} \\). Convert this speed to miles per minute: \\( \\frac{19}{57} = \\frac{1}{3} \\) miles per minute. On the sidewalk, her speed is twice this: \\( \\frac{2}{3} \\) miles per minute. For the 16-mile sidewalk portion, time = distance/speed = \\( \\frac{16}{2/3} = 24 \\) minutes. Total time is \\( 57 + 24 = 81 \\) minutes.\n\nThe answer is 81."], "expected_answer": "81", "actual_answer": "81"}
{"question": "Mia is popping popcorn for a snack. As the pot of kernels heats up, the kernels start popping faster. 10 pop in the first 16 seconds of cooking, then 2 times that amount in the next 16 seconds. The kernels increase to 4 times the initial popping rate in the next 16 seconds, but in the final 16 seconds, the popping slows down to half the rate as the past 16 seconds. After Mia takes the pot off the heat, a quarter of the number of kernels that popped in the final 16 seconds of cooking also pop from the residual heat. How many pieces of popcorn does Mia have to eat?", "index": 248, "lines": ["Answer: \nTo calculate the total popcorn, sum the popped kernels during cooking and add the residual popped kernels.\n\n1. First 16 seconds: 10 kernels  \n2. Next 16 seconds: 2 × 10 = 20 kernels  \n3. Next 16 seconds: 4 × 10 = 40 kernels  \n4. Final 16 seconds: (4 × 10) ÷ 2 = 20 kernels  \n\nTotal popped during cooking: 10 + 20 + 40 + 20 = 90 kernels  \n\nResidual heat: ¼ × 20 = 5 kernels  \n\nTotal popcorn: 90 + 5 = 95 kernels  \n\nThe answer is 95."], "expected_answer": "95", "actual_answer": "95"}
{"question": "Luca collects garbage from 3 different apartment complexes. The first 2 have 450 apartments each and the last one is 80% bigger than the other 2 combined. Luca collects garbage 2 times a week from each place and he gets paid ₣0.35 per collection for each apartment. How much money does he make in a week?", "index": 2494, "lines": ["Answer: \nThe third apartment complex has 80% more apartments than the combined total of the first two complexes. The first two complexes have 450 apartments each, totaling 900 apartments. \n\n- Calculate 80% of 900: 0.8 * 900 = 720\n- Add this to the original total: 900 + 720 = 1620\n\nThe third complex has 1,620 apartments.\n\nThe answer is 1620 apartments in the third complex."], "expected_answer": "1764", "actual_answer": "1620"}
{"question": "A new virus infects 18 people. Every day, each infected person infects 4 others. How many people are infected after 3 days?", "index": 4936, "lines": ["Answer: \nThe next step is to calculate the total number of new infections each day by multiplying the current number of infected people by 4 and then summing these values to find the total infected after 3 days.\n\nStep-by-step explanation:\n- Day 1: 18 * 4 = 72 new infections; total infected = 18 + 72 = 90\n- Day 2: 90 * 4 = 360 new infections; total infected = 90 + 360 = 450\n- Day 3: 450 * 4 = 1800 new infections; total infected = 450 + 1800 = 2250\n\nThe answer is 2250."], "expected_answer": "2250", "actual_answer": "2250"}
{"question": "Viktor has 25 hectares of plum field. There are 71 plums per hectare. Viktor can harvest his plums every 12 months. How many plums can Viktor harvest within a year?", "index": 330, "lines": ["Answer: \nThe next step is to calculate the total number of plums by multiplying the number of hectares by the number of plums per hectare. \n\n25 hectares * 71 plums/hectare = 1,775 plums\n\nThe answer is 1,775 plums."], "expected_answer": "1775", "actual_answer": "1775"}
{"question": "Wei is rolling a 6-sided die. How much more likely is it (expressed as a percentage) that he rolls a number greater than 3 than that he rolls two even numbers in a row?", "index": 110, "lines": ["Answer: \nThe probability of rolling a number greater than 3 (4, 5, 6) on a 6-sided die is 3/6 = 1/2 or 0.5. The probability of rolling an even number (2, 4, 6) on a single roll is also 3/6 = 0.5. Since rolling two even numbers in a row involves two independent events, multiply their probabilities: 0.5 * 0.5 = 0.25. To find how much more likely the first event is compared to the second, divide their probabilities: 0.5 ÷ 0.25 = 2. Converting this ratio to a percentage: 2 * 100% = 200%. \n\nThe answer is 200."], "expected_answer": "25", "actual_answer": "200"}
{"question": "Isabella was preparing for a game night at her house, where she intended to serve grilled salmon. She noticed that she was out of plastic spoons, so she bought a new package of spoons. Later, her husband also bought a package of 16 new spoons and gave them to Isabella. While Isabella was making the grilled salmon, she used five of the spoons to sample her grilled salmon. Later, when she went to set the table, she had a total of 23 spoons. How many spoons were in the package that Isabella bought?", "index": 1115, "lines": ["Answer: \nLet's denote the number of spoons in Isabella's package as \\( x \\).\n\n1. Isabella bought a package with \\( x \\) spoons.\n2. Her husband bought an additional package with 16 spoons.\n3. Total spoons before using any: \\( x + 16 \\).\n4. She used 5 spoons: \\( (x + 16) - 5 = 23 \\).\n\nSimplify the equation:\n\\[\nx + 16 - 5 = 23 \\\\\nx + 11 = 23\n\\]\n\nSubtract 11 from both sides:\n\\[\nx = 23 - 11 \\\\\nx = 12\n\\]\n\nThe answer is 12."], "expected_answer": "12", "actual_answer": "12"}
{"question": "Ravi places almonds on some tables. Each table can hold 37 almonds. If he has 328 almonds and 7 tables, how many almonds won't he be able to place on the table?", "index": 604, "lines": ["Answer: \nThe next step is to subtract the total number of almonds that can be placed on the tables from the total number of almonds Ravi has. \n\nStep 1: Calculate the total number of almonds the tables can hold by multiplying the number of tables by the capacity of each table: 7 tables * 37 almonds/table = 259 almonds.  \nStep 2: Subtract this number from the total almonds Ravi has: 328 almonds - 259 almonds = 69 almonds.  \n\nThe answer is 69 almonds."], "expected_answer": "69", "actual_answer": "69"}
{"question": "If Diego eats 3 eggs a day for 74 days and then increases it to 6 eggs a day for 93 days, how many dozens of eggs will Diego need for 167 days?", "index": 4977, "lines": ["Round 0:\nThe next logical step is to calculate the total number of eggs Diego eats by multiplying the eggs per day by the number of days for each period. \n\nFor the first 74 days:  \n3 eggs/day × 74 days = 222 eggs  \n\nFor the next 93 days:  \n6 eggs/day × 93 days = 558 eggs  \n\nThe answer is 222 + 558 = 780 eggs.  \nThe total number of dozens is 780 ÷ 12 = 65 dozens.  \n\nThe answer is 65.  \n\nThe final answer is 65.", "Round 1:\nThe next logical step is to calculate the total number of eggs Diego eats by multiplying the eggs per day by the number of days for each period.\n\nFor the first 74 days:  \n3 eggs/day × 74 days = 222 eggs  \n\nFor the next 93 days:  \n6 eggs/day × 93 days = 558 eggs  \n\nThe answer is 222 + 558 = 780 eggs.  \nThe total number of dozens is 780 ÷ 12 = 65 dozens.  \n\nThe answer is 65.  \n\nThe final answer is 65.", "Answer: \nNext step: Calculate the total eggs for the second period by multiplying 6 eggs/day by 93 days.\n\n6 eggs/day × 93 days = 558 eggs.\n\nThe answer is 558 eggs."], "expected_answer": "65", "actual_answer": "558"}
{"question": "There are 6 periods in the day for a normal student but Sanjay has to take 3 extra classes. Each class is 35 minutes long. He goes to class for 6 days a week. He then spends 2/4 of his weekly minutes each on Saturday and Sunday as extra learning time. How many hours a week does he spend learning?", "index": 3941, "lines": ["Answer: \nLet's break down the problem step by step:\n\n1. **Calculate the total extra class time per day:**\n   - Sanjay takes 3 extra classes each day.\n   - Each class is 35 minutes long.\n   - Total extra class time per day = 3 classes × 35 minutes/class = 105 minutes.\n\n2. **Calculate the total extra class time for the week:**\n   - He attends classes for 6 days a week.\n   - Total weekly extra class time = 105 minutes/day × 6 days = 630 minutes.\n\n3. **Calculate the extra learning time on weekends:**\n   - He spends 2/4 of his weekly minutes each on Saturday and Sunday.\n   - Total extra learning time per weekend day = (2/4) × 630 minutes = 315 minutes.\n   - Total extra learning time for both days = 315 minutes × 2 = 630 minutes.\n\n4. **Calculate the total learning time in minutes:**\n   - Total learning time = Weekly extra class time + Extra learning time on weekends = 630 minutes + 630 minutes = 1260 minutes.\n\n5. **Convert total learning time from minutes to hours:**\n   - Since 1 hour = 60 minutes, total learning time in hours = 1260 minutes ÷ 60 = 21 hours.\n\n**Answer:** The answer is 21 hours."], "expected_answer": "63", "actual_answer": "21"}
{"question": "Bodhi collects garbage from 3 different apartment complexes. The first 2 have 200 apartments each and the last one is 60% bigger than the other 2 combined. Bodhi collects garbage 2 times a week from each place and he gets paid ¥0.3 per collection for each apartment. How much money does he make in a week?", "index": 2451, "lines": ["Answer: \nThe third apartment complex has 640 apartments because 60% of the combined first two complexes (200 + 200 = 400) is 240, so 400 + 240 = 640.\n\nNext, calculate the total number of collections per week:\n\n- First complex: 200 apartments * 2 collections = 400\n- Second complex: 200 apartments * 2 collections = 400\n- Third complex: 640 apartments * 2 collections = 1280\n\nTotal collections = 400 + 400 + 1280 = 2080 collections.\n\nTotal earnings = 2080 * ¥0.3 = ¥624.\n\nThe answer is ¥624."], "expected_answer": "624", "actual_answer": "624"}
{"question": "Sakura walks 25 kilometers every day on her favorite walking trail, which includes 13 kilometers of walking on the beach and 12 kilometers of walking on the sidewalk. On the sidewalk, Sakura walks at three times the rate of speed that she does on the beach. If 65 minutes of her walk is spent on the beach, how long does it take for her to complete the entire 25-kilometer walk, in minutes?", "index": 888, "lines": ["Answer: \nSakura's speed on the beach is 12 km/h. Since she walks three times faster on the sidewalk, her speed there is 36 km/h. The time spent on the sidewalk is 12 km / 36 km/h = 1/3 hours, which is 20 minutes. Adding the 65 minutes on the beach, the total time is 85 minutes.\n\nThe answer is 85 minutes."], "expected_answer": "85", "actual_answer": "85"}
{"question": "Sophia has a flower bed that is 203 feet long. Sophia wants to fill her flower bed with plants. Sophia's flowers grow 6 feet wide so she needs to leave 14.5 feet between every plant. Sophia already owns 10 flowers. Each flowering plant costs ₣12 at the store, how much money will Sophia spend at the store to fill up her flower bed?", "index": 2275, "lines": ["Answer: \nSophia needs to calculate the number of additional flowers required to fill her 203-foot bed, considering each flower takes up 6 feet plus 14.5 feet of space between them. Using the equation:  \n203 = 6x + 14.5(x - 1),  \nshe solves for x and finds she needs 11 flowers in total. Subtracting the 10 she already owns, Sophia needs to buy 1 more flower.  \n\nThe next step is to calculate the cost:  \n1 flower × ₣12 = ₣12.  \n\nThe answer is 12."], "expected_answer": "48", "actual_answer": "12"}
{"question": "There are 7 periods in the day for a normal student but Sanjay has to take 1 extra classes. Each class is 45 minutes long. He goes to class for 4 days a week. He then spends two-fourths of his weekly minutes each on Saturday and Sunday as extra learning time. How many hours a week does he spend learning?", "index": 3923, "lines": ["Answer: \nThe next step is to calculate the total weekly minutes from the 4 days of classes and then add the extra learning time for Saturday and Sunday.\n\nTotal minutes from 4 days: 4 days * 8 classes/day * 45 minutes/class = 1440 minutes. Extra learning time: 1440 minutes * (2/4) = 720 minutes on Saturday and 720 minutes on Sunday. Total learning time: 1440 + 720 + 720 = 2880 minutes. Convert to hours: 2880 / 60 = 48 hours.\n\nThe answer is 48 hours."], "expected_answer": "48", "actual_answer": "48"}
{"question": "Esteban collects garbage from 3 different apartment complexes. The first 2 have 100 apartments each and the last one is 50% bigger than the other 2 combined. Esteban collects garbage 2 times a week from each place and he gets paid ₣0.4 per collection for each apartment. How much money does he make in a week?", "index": 2455, "lines": ["Answer: \nThe third apartment complex has 50% more apartments than the combined total of the first two. The first two have 100 each, so together they have 200. 50% of 200 is 100, so the third complex has 200 + 100 = 300 apartments.\n\nThe next step is to calculate the total number of apartments across all three complexes.\n\nThe answer is 500 [numerical answer]."], "expected_answer": "400", "actual_answer": "500"}
{"question": "If Gabriel and Oscar have 580 yards of fence between them, and they agree to split it with Oscar getting 190 yards more than Gabriel, how much is left over for Gabriel?", "index": 4253, "lines": ["Answer: \nLet G be the amount Gabriel gets. Oscar gets G + 190 yards. The total fence is G + (G + 190) = 580 yards. Combining like terms gives 2G + 190 = 580. Subtract 190 from both sides: 2G = 390. Divide by 2: G = 195.\n\nThe answer is 195 yards."], "expected_answer": "195", "actual_answer": "195"}
{"question": "Luis works a 7-hour shift each day, 4 days a week. He earns ₺25 per hour and gets a ₺554 bonus each week if the company performs well. How much money did Luis make in March if the company performed very well for the whole month?", "index": 3002, "lines": ["Answer: \nLuis works 7 hours a day for 4 days a week, earning ₺25 per hour. His daily earnings are 7 * 25 = ₺175. Weekly earnings from his job are 175 * 4 = ₺700. Adding the ₺554 bonus, he earns 700 + 554 = ₺1254 per week. March has 31 days, so he works 31 / 4 = 7.75 weeks, meaning 7 full weeks and 3 extra days. Since he receives a bonus each week, he gets 7 bonuses. Total earnings: 7 * 1254 = ₺8778.\n\nThe answer is 8778."], "expected_answer": "5016", "actual_answer": "8778"}
{"question": "Dr. Martinez sold his cottage for $680000. He paid the legal fees that amount to 3% of the selling price and also paid a realtor fee that is 2% of the selling price. If he also paid $500000 for the remaining loan amount of the cottage, how much is Dr. Martinez's net proceeds from selling the cottage?", "index": 1713, "lines": ["Answer: \nThe next step is to calculate the total deductions from the selling price.  \n- Legal fees: 3% of $680,000 = $20,400  \n- Realtor fee: 2% of $680,000 = $13,600  \n- Loan payment: $500,000  \n\nTotal deductions: $20,400 + $13,600 + $500,000 = $534,000  \n\nThe answer is $146,000."], "expected_answer": "146000", "actual_answer": "146000"}
{"question": "To make a call from a hotel room phone, you must pay ¥0.5 for each minute of your call. After 30 minutes, that price drops to ¥0.4 per minute. How much would a 65-minute call cost?", "index": 516, "lines": ["Answer: \nLet's break down the call duration:\n\n1. For the first 30 minutes:  \n   Cost = 30 minutes × ¥0.5 = ¥15  \n\n2. For the remaining 35 minutes (65 - 30):  \n   Cost = 35 minutes × ¥0.4 = ¥14  \n\n3. Total cost = ¥15 + ¥14 = ¥29  \n\nThe answer is ¥29."], "expected_answer": "29", "actual_answer": "29"}
{"question": "A fog bank rolls in from the ocean to cover a city. It takes 63 minutes to cover every 13 miles of the city. If the city is 39 miles across from the oceanfront to the opposite inland edge, how many minutes will it take for the fog bank to cover the whole city?", "index": 52, "lines": ["Answer: \nThe next step is to calculate the time it takes for the fog to cover 39 miles by determining the rate per mile and then multiplying by the total distance.\n\nStep-by-step explanation:\n1. Calculate the rate per mile: 63 minutes / 13 miles = 63/13 minutes per mile.\n2. Multiply the rate by the total distance: (63/13) * 39 = (63 * 3) = 189 minutes.\n\nThe answer is 189 minutes."], "expected_answer": "189", "actual_answer": "189"}
{"question": "A cleaner has to clean a hospital with 140 floors. They have 10 days to get it done. It takes them 30 minutes per floor. If they work 10 hours each day, what percentage of their day, on average, is spent cleaning floors?", "index": 1990, "lines": ["Answer: \nTotal time available in 10 days: 10 days × 10 hours/day = 100 hours\n\nTotal time spent cleaning: 140 floors × 30 minutes/floor = 4200 minutes = 70 hours\n\nPercentage of the day spent cleaning: (70 hours / 100 hours) × 100% = 70%\n\nThe answer is 70%"], "expected_answer": "70", "actual_answer": "70"}
{"question": "Gabriel caught 5 trouts last Friday, the first trout he caught weighs 43 kilograms, the second trout he caught weighs 45 kilograms, and the last trout he caught weighs 28 kilograms. If a kilogram of trout costs ¥0.5, how much will he earn after selling all the trouts to the market?", "index": 3848, "lines": ["Answer: \nNext step: Calculate the total weight of all trouts caught by Gabriel.\n\nStep explanation: Gabriel caught three trouts with individual weights of 43 kg, 45 kg, and 28 kg. To find the total weight, add these weights together.\n\nTotal weight = 43 kg + 45 kg + 28 kg = 116 kg.\n\nThe answer is 116 kg."], "expected_answer": "86", "actual_answer": "116"}
{"question": "Xena can run ten times faster than she can walk, but she can skip at a rate of speed that is four-fifths as fast as she can run. If she can skip at 8 miles per hour, how many miles can she travel in 6 hours if she spends 1/3 of the time running and four-sixths of the time walking?", "index": 4417, "lines": ["Answer: \nFirst, determine Xena's walking speed. Since skipping speed is 8 mph and it's four-fifths of her running speed, her running speed is 10 mph. Consequently, her walking speed is 1 mph. Next, calculate the time spent running and walking: 1/3 of 6 hours is 2 hours running, and 2/3 is 4 hours walking. Finally, compute the distances: running covers 10 mph * 2 hours = 20 miles, and walking covers 1 mph * 4 hours = 4 miles. Total distance is 24 miles.\n\nThe answer is 24 miles."], "expected_answer": "24", "actual_answer": "24"}
{"question": "There are 9 periods in the day for a normal student but Arash has to take 3 extra classes. Each class is 45 minutes long. He goes to class for 6 days a week. He then spends one-sixth of his weekly minutes each on Saturday and Sunday as extra learning time. How many hours a week does he spend learning?", "index": 3921, "lines": ["Answer: \nThe next step is to calculate the total extra class time per week. Multiply the extra class minutes per day by the number of school days: 135 minutes/day * 6 days = 810 minutes. \n\nThe answer is 18 hours."], "expected_answer": "72", "actual_answer": "18"}
{"question": "Oakwood High School is holding graduation in their Auditorium this year which has space for 7800 people. After accounting for 1100 seats for graduates and 100 seats for faculty attending, how many tickets would each graduate receive to give to their friends and family if the tickets are split equally?", "index": 2324, "lines": ["Answer: \nThe total number of seats available for friends and family is 7800 - 1100 (graduates) - 100 (faculty) = 6600. Each graduate gets 6600 / 1100 = 6 tickets. The answer is 6."], "expected_answer": "6", "actual_answer": "6"}
{"question": "According to its nutritional info, a bag of cookies has 150 calories per serving. If a 200 oz bag has 5 servings, how many oz can you eat if your daily calorie target is 2300 and you have already consumed 800 calories?", "index": 1228, "lines": ["Answer: \nThe next step is to calculate how many servings you can consume without exceeding your calorie limit. \n\nYou have 1500 calories left (2300 - 800). Each serving is 150 calories, so you can eat 10 servings (1500 / 150). \n\nHowever, the bag only contains 5 servings (200 oz / 40 oz per serving). Therefore, you can eat the whole bag. \n\nThe answer is 200 oz."], "expected_answer": "400", "actual_answer": "200"}
{"question": "Elena has €72.2 and wants to buy 42 nails from a bin at the home improvement store. Each nail costs €0.1. How much money does Elena have left after paying for the nails?", "index": 1529, "lines": ["Called LLM to parse answer, got The answer is 68 [final numerical answer].", "Answer: \nLet's calculate the total cost of the nails first.\n\nThe next step is to multiply the number of nails by the cost per nail:\n42 nails × €0.1 per nail = €4.2\n\nNow, subtract this amount from Elena's initial money to find out how much she has left:  \n€72.2 - €4.2 = €68.0\n\nThe answer is €68.0"], "expected_answer": "68", "actual_answer": "68"}
{"question": "Camila sliced a whole kiwi into 32 pieces. She ate 3 slices, her sister ate 7 more than her, and her friend ate 9 more than her sister. How many slices of kiwi did they all eat?", "index": 2737, "lines": ["Called LLM to parse answer, got The answer is 32.", "Answer: \nCamila ate 3 slices. Her sister ate 7 more than Camila, which is 3 + 7 = 10 slices. Her friend ate 9 more than her sister, which is 10 + 9 = 19 slices.\n\nThe answer is 3 + 10 + 19 = 32 slices."], "expected_answer": "32", "actual_answer": "32"}
{"question": "One miner can mine 5 pounds of ore per day with bare hands. He can mine two times as much with a nickel pickaxe and 30% more with a steel pickaxe than with a nickel pickaxe. How many pounds of ore can 21 miners with steel pickaxes mine in a month with 28 days?", "index": 2910, "lines": ["Answer: \nEach miner with a steel pickaxe can mine 13 pounds daily. For 21 miners, the daily total is 13 * 21 = 273 pounds. Over 28 days, the total is 273 * 28 = 7,644 pounds.\n\nThe answer is 7644 pounds of ore."], "expected_answer": "7644", "actual_answer": "7644"}
{"question": "Leilani and Pavel have 136 minutes to walk to the park together. It takes them 17 minutes to get to the corner where the library is. It takes them another 57 minutes to get to the mall. How much longer do they have to get to park without being late?", "index": 736, "lines": ["Answer: \nNext step: Add the time taken to reach the library corner (17 minutes) and the time taken to reach the mall (57 minutes) to find the total time spent so far.\n\n17 + 57 = 74 minutes\n\nThe answer is 74 minutes."], "expected_answer": "62", "actual_answer": "74"}
{"question": "At Leon's house, there are ten times as many apples as bananas. He has a total of 93 bananas in his house. Leon bought 42 more bananas at the store and 25 fewer apples than the number of bananas. Find the combined total of the number of apples and bananas Leon has in the house?", "index": 4592, "lines": ["Answer: \nThe next step is to calculate the new total number of apples after purchasing. Leon bought 25 fewer apples than the number of bananas he has after buying more bananas. \n\nThe previous step established that Leon now has 135 bananas. Therefore, the number of apples he bought is 135 - 25 = 110 apples. \n\nSince Leon initially had 930 apples, the new total number of apples is 930 + 110 = 1040 apples. \n\nThe combined total of apples and bananas is 1040 apples + 135 bananas = 1175. \n\nThe answer is 1175."], "expected_answer": "1082", "actual_answer": "1175"}
{"question": "Andre caught 6 cods last Sunday, the first cod he caught weighs 54 kgs, the second cod he caught weighs 46 kgs, and the last cod he caught weighs 23 kgs. If a kg of cod costs €2.0, how much will he earn after selling all the cods to the market?", "index": 3801, "lines": ["Answer: \nStep 1: Calculate the total weight of the cods.\nTotal weight = 54 kg + 46 kg + 23 kg = 123 kg\n\nThe answer is 123 kg."], "expected_answer": "384", "actual_answer": "123"}
{"question": "Gabriel's van breaks down. The van weighs 1150 kilograms and he has groceries in it weighing 450 kilograms. He also has his 4 young friends who weigh 95 kilograms each in it. If the force to move the van is 5% of the weight, how much force does he need to push the van?", "index": 3387, "lines": ["Answer: \nThe total weight of the van, groceries, and friends is 1150 + 450 + (4 × 95) = 1150 + 450 + 380 = 1980 kg. The force needed is 5% of 1980 kg, which is 0.05 × 1980 = 99 kg. \n\nThe answer is 99 kg."], "expected_answer": "99", "actual_answer": "99"}
{"question": "At Xavier's house, there are eight times as many bananas as oranges. He has a total of 28 oranges in his house. Xavier bought 63 more oranges at the store and 26 fewer bananas than the number of oranges. Find the combined total of the number of bananas and oranges Xavier has in the house?", "index": 4551, "lines": ["Answer: \nXavier initially has 8 times as many bananas as oranges. With 28 oranges, he has 8 * 28 = 224 bananas. After purchasing 63 more oranges, his total oranges become 28 + 63 = 91. He buys 26 fewer bananas than oranges, so he buys 63 - 26 = 37 bananas. Adding these to his initial bananas: 224 + 37 = 261 bananas. The combined total is 91 + 261 = 352.\n\nThe answer is 352."], "expected_answer": "352", "actual_answer": "352"}
{"question": "A maintenance worker has to clean a university with 130 rooms. They have 5 days to get it done. It takes them 15 minutes per room. If they work 13 hours each day, what percentage of their day, on average, is spent cleaning rooms?", "index": 1977, "lines": ["Called LLM to parse answer, got The answer is 50 [50].", "Round 0:\nThe next step is to calculate the total time spent cleaning each day by dividing the total cleaning time by the number of days. \n\nStep-by-step explanation:\n1. Calculate total cleaning time: 130 rooms * 15 minutes = 1950 minutes.\n2. Divide by number of days: 1950 minutes / 5 days = 390 minutes per day.\n\nThe answer is 50% [50%].", "Called LLM to parse answer, got The answer is 0.5 [final numerical answer].", "Answer: \nThe next step is to convert the total work hours into minutes and then calculate the percentage of time spent cleaning.\n\nStep-by-step explanation:\n1. Convert daily work hours to minutes: 13 hours/day * 60 minutes/hour = 780 minutes/day.\n2. Calculate the percentage: (390 minutes/day / 780 minutes/day) * 100% = 50%.\n\nThe answer is 50% [50%]."], "expected_answer": "50", "actual_answer": "0.5"}
{"question": "The biggest waterslide at Aqua Adventure is 320 meters long, and people slide down at 40 meters/minute. The second biggest waterslide is 240 meters long, but steeper, so people slide down at 60 meters/minute. How much longer does it take to ride the biggest slide compared to the second biggest slide?", "index": 4393, "lines": ["Answer: \nThe next step is to calculate the time it takes to ride each slide by dividing the length by the speed.\n\nFor the biggest slide:  \n320 meters ÷ 40 meters/minute = 8 minutes.\n\nFor the second biggest slide:  \n240 meters ÷ 60 meters/minute = 4 minutes.\n\nThe answer is 4 minutes longer."], "expected_answer": "4", "actual_answer": "4"}
{"question": "On Thursday, Carlos wants to exercise for four times the amount of time he did on Wednesday and Tuesday combined. On Tuesday he exercised for 52 minutes. On Wednesday he exercised for 30 minutes. How many minutes does he have to exercise on Thursday to reach his goal?", "index": 3478, "lines": ["Answer: \nThe total time Carlos exercised on Tuesday and Wednesday is 52 + 30 = 82 minutes. To find the time needed on Thursday, multiply this sum by 4: 82 × 4 = 328 minutes.\n\nThe answer is 328 minutes."], "expected_answer": "328", "actual_answer": "328"}
{"question": "According to its nutritional info, a bag of breads has 425 calories per serving. If a 150 ounces bag has 5 servings, how many ounces can you eat if your daily calorie target is 2250 and you have already consumed 1400 calories?", "index": 1220, "lines": ["Answer: \nThe remaining calories you can consume are 2250 - 1400 = 850 calories. Since each serving is 425 calories, you can eat 850 / 425 = 2 servings. Each serving is 150 / 5 = 30 ounces, so you can eat 2 * 30 = 60 ounces.\n\nThe answer is 60 ounces."], "expected_answer": "60", "actual_answer": "60"}
{"question": "Faisal wants to make different sized ice cubes with 346 grams of water. He can make giant cubes that use 13 grams per cube, medium cubes that use 12 grams, and small cubes that use 2/3 of gram. If he makes 8 giant cubes, 15 small cubes, and 14 medium cubes, how many grams of water does he have left?", "index": 594, "lines": ["Answer: \nNext step: Calculate the total grams used for each cube size.\n\nGiant cubes: 8 cubes × 13g = 104g  \nMedium cubes: 14 cubes × 12g = 168g  \nSmall cubes: 15 cubes × (2/3)g = 10g  \n\nTotal grams used: 104g + 168g + 10g = 282g  \n\nThe answer is 64 grams left.  \nThe answer is 64 grams left.\n\nThe answer is 64 grams left.  \nThe answer is 64 grams left."], "expected_answer": "64", "actual_answer": "64"}
{"question": "Oliver caught 7 trouts last Thursday, the first trout he caught weighs 58 pounds, the second trout he caught weighs 40 pounds, and the last trout he caught weighs 28 pounds. If a pound of trout costs ₺0.5, how much will he earn after selling all the trouts to the market?", "index": 3815, "lines": ["Round 0:\nThe problem doesn't provide the weights of the 3rd to 6th trouts, making it impossible to calculate the total weight. Without this information, we cannot determine the total earnings. \n\nAnswer: More information is needed to solve the problem.", "Called LLM to parse answer, got The answer is ####.", "Round 1:\nThe answer is #### More information is needed to solve the problem.", "Called LLM to parse answer, got The answer is ####.", "Round 2:\nThe problem requires calculating total earnings from selling 7 trouts, but only 3 weights are provided. Without the weights of the remaining 4 trouts, we cannot determine the total weight or earnings. Further information is needed.\n\nThe answer is #### More information is needed to solve the problem.", "Called LLM to parse answer, got The answer is ####", "Round 3:\nThe answer is #### More information is needed to solve the problem.", "Called LLM to parse answer, got The answer is #### 0.", "Answer: \nThe problem requires calculating total earnings from selling 7 trouts, but only 3 weights are provided. Without the weights of the remaining 4 trouts, we cannot determine the total weight or earnings. Further information is needed.\n\nThe answer is #### More information is needed to solve the problem."], "expected_answer": "119", "actual_answer": "0"}
{"question": "Hiroshi was a pen pal with 13 people. He stopped being penpals with 3 of them. They each send 3 letters a week that are 11 pages long. He responds in kind. He can write a page every 8 minutes. How many hours does he spend writing a week?", "index": 3626, "lines": ["Answer: \nHiroshi has 10 pen pals after stopping with 3. Each pen pal sends 3 letters, so he receives 10 × 3 = 30 letters. Each letter is 11 pages, so he receives 30 × 11 = 330 pages to read.\n\nThe answer is 44 hours."], "expected_answer": "44", "actual_answer": "44"}
{"question": "Prof. Davis sold his condo for $880000. He paid the registration fees that amount to 2% of the selling price and also paid a agent fee that is 4% of the selling price. If he also paid $460000 for the remaining loan amount of the condo, how much is Prof. Davis's net proceeds from selling the condo?", "index": 1744, "lines": ["Answer: \nStep 1: Calculate the total deductions from the selling price.\n- Registration fees: 2% of $880,000 = $17,600\n- Agent fee: 4% of $880,000 = $35,200\n- Loan payment: $460,000\n- Total deductions: $17,600 + $35,200 + $460,000 = $512,800\n\nStep 2: Subtract the total deductions from the selling price to find the net proceeds.\n- Net proceeds = $880,000 - $512,800 = $367,200\n\nThe answer is 367200."], "expected_answer": "367200", "actual_answer": "367200"}
{"question": "Winnie went to the cafe and bought various types of treats. She bought 2 dozen danishes which cost $20 per dozen, 9 dozen tarts which cost $88 per dozen, and 8 dozen scones for $118 per dozen. How much was the total cost?", "index": 1831, "lines": ["Round 0:\nShe needs to calculate the cost for each type of treat and then sum them up to find the total cost.\n\nStep 1: Calculate the cost of danishes: 2 dozen × $20 = $40  \nStep 2: Calculate the cost of tarts: 9 dozen × $88 = $792  \nStep 3: Calculate the cost of scones: 8 dozen × $118 = $944  \n\nNow, add all these amounts together to find the total cost: $40 + $792 + $944 = $1,776", "Answer: \nThe next step is to add the costs together.  \nTotal cost = $40 + $792 + $944 = $1,776  \nThe answer is 1776."], "expected_answer": "1776", "actual_answer": "1776"}
{"question": "Kai caught 7 salmons last Monday, the first salmon he caught weighs 62 kgs, the second salmon he caught weighs 38 kgs, and the last salmon he caught weighs 21 kgs. If a kg of salmon costs €1.0, how much will he earn after selling all the salmons to the market?", "index": 3827, "lines": ["Answer: \nStep 1: Calculate the total weight of the salmon by adding the weights of each salmon: 62 kg + 38 kg + 21 kg.\n\nNext step: Multiply the total weight by the cost per kilogram to find the total earnings.\n\nThe answer is 121 €."], "expected_answer": "205", "actual_answer": "121"}
{"question": "Valeria went to the boardwalk for vacation. Her parents gave her €1300 to buy whatever she wanted. At the gift shop, saltwater taffy was on sale for \"Buy 15 kilograms at €20 per kilogram, get 5 kilograms 1/4 off.\" She scooped up 22 kilograms. She also bought a mixed bag of starfish for €11.5 and 17 keychains that were €20.5 each. How much money does Valeria have left?", "index": 2006, "lines": ["Answer: \nLet's break down Valeria's expenses step by step.\n\n1. **Saltwater Taffy:**\n   - **Offer:** Buy 15kg at €20/kg, get 5kg at 25% off.\n   - **Cost for 15kg:** 15 kg * €20/kg = €300\n   - **Cost for 5kg (25% off):** 5 kg * (€20 - €5) = 5 kg * €15 = €75\n   - **Total for taffy:** €300 + €75 = €375\n\n2. **Mixed Bag of Starfish:** €11.5\n\n3. **Keychains:** 17 * €20.5 = €348.5\n\n**Total Expenses:** €375 (taffy) + €11.5 (starfish) + €348.5 (keychains) = €735\n\n**Money Left:** €1300 - €735 = €565\n\nThe answer is €565."], "expected_answer": "525", "actual_answer": "565"}
{"question": "There are 6 periods in the day for a normal student but Oliver has to take 3 extra classes. Each class is 45 minutes long. He goes to class for 4 days a week. He then spends 2/3 of his weekly minutes each on Saturday and Sunday as extra learning time. How many hours a week does he spend learning?", "index": 3933, "lines": ["Answer: \nStep 1: Calculate the total extra class time Oliver attends during the week.\n\nThere are 3 extra classes each day, and he attends school for 4 days a week. Each class is 45 minutes long.\n\nTotal extra class time = 3 classes/day * 4 days * 45 minutes/class\n\nThe answer is 540 minutes."], "expected_answer": "63", "actual_answer": "540"}
{"question": "There are 8 periods in the day for a normal student but Gabriel has to take 1 extra classes. Each class is 50 minutes long. He goes to class for 5 days a week. He then spends five-sixths of his weekly minutes each on Saturday and Sunday as extra learning time. How many hours a week does he spend learning?", "index": 3904, "lines": ["Answer: \nThe total extra learning time for both Saturday and Sunday is calculated by multiplying five-sixths of the weekly class time by two days.  \nExtra time = 2 × (5/6 × 2250 minutes) = 3750 minutes.  \n\nThe answer is 100 hours."], "expected_answer": "100", "actual_answer": "100"}
{"question": "Benjamin caught 4 salmons last Saturday, the first salmon he caught weighs 79 pounds, the second salmon he caught weighs 41 pounds, and the last salmon he caught weighs 26 pounds. If a pound of salmon costs $1.5, how much will he earn after selling all the salmons to the market?", "index": 3809, "lines": ["Answer: \nStep 1: Calculate the total weight of the salmon caught.\n- 79 pounds (first salmon) + 41 pounds (second salmon) + 26 pounds (last salmon) = 146 pounds.\n\nThe answer is 146."], "expected_answer": "258", "actual_answer": "146"}
{"question": "The Brown family is busy making biscuits. So far, they've made 5225 biscuits. They have 1705 blueberry biscuits, 1569 strawberry biscuits, and some vanilla biscuits. How many vanilla biscuits have they made?", "index": 4187, "lines": ["Answer: \nThe next step is to find the total number of vanilla biscuits by subtracting the number of blueberry and strawberry biscuits from the total number of biscuits.\n\nStep: Subtract the sum of blueberry and strawberry biscuits from the total biscuits.\nCalculation: 5225 - (1705 + 1569) = 5225 - 3274 = 1951\n\nThe answer is 1951 vanilla biscuits."], "expected_answer": "1951", "actual_answer": "1951"}
{"question": "If Oliver and Kayla have 580 meters of fence between them, and they agree to split it with Kayla getting 160 meters more than Oliver, how much is left over for Oliver?", "index": 4252, "lines": ["Answer: \nLet Oliver's fence be O meters. Since Kayla gets 160 meters more, her fence is O + 160. The total fence is O + (O + 160) = 580.\n\nThe next step is to combine like terms:  \n2O + 160 = 580.\n\nSubtract 160 from both sides:  \n2O = 580 - 160.\n\nCalculate 580 - 160:  \n2O = 420.\n\nDivide by 2:  \nO = 210.\n\nThe answer is 210 meters."], "expected_answer": "210", "actual_answer": "210"}
{"question": "The vending machines sell gum for 75 cents and popcorn for 100 cents. Yusuf spent ¥900 and got 4 bags of gum and had 9% of his money left in change. How many popcorn did he buy?", "index": 4017, "lines": ["Answer: \nYusuf spent ¥900, which included the cost of 4 bags of gum and some bags of popcorn. First, calculate the total cost of the gum:\n\n4 bags × 75 yen = 300 yen.\n\nLet P be the number of popcorn bags. Each popcorn costs 100 yen, so the cost for popcorn is 100P yen. The total amount spent is therefore:\n\n300 + 100P = 900.\n\nSolving for P:\n\n100P = 600  \nP = 6.\n\nThe answer is 6."], "expected_answer": "816", "actual_answer": "6"}
{"question": "Mohammed has a bag of coins with 52 inside. He tripped over stick while carrying it and dropped 2/4 of them. He scrambled to search for them but only came up with 14. When he went back home, he inspected the coins further. Seven of them he picked up weren't coins, but actually coins so he got rid of it. How many coins did Mohammed end up with?", "index": 3098, "lines": ["Answer: \nHe dropped half of the 52 coins: 52 × (2/4) = 26 coins dropped, leaving 26 coins. He found 14 of the dropped coins, so he now has 26 + 14 = 40 coins. However, 7 of these were not actual coins, so he discarded them: 40 - 7 = 33 coins.\n\nThe answer is 33."], "expected_answer": "33", "actual_answer": "33"}
{"question": "According to its nutritional info, a bag of breads has 275 calories per serving. If a 100 ounces bag has 5 servings, how many ounces can you eat if your daily calorie target is 1900 and you have already consumed 800 calories?", "index": 1229, "lines": ["Answer: \nThe answer is 80 ounces.\n\nStep-by-Step Explanation:\n\n1. Determine calories remaining: 1900 - 800 = 1100 calories.\n2. Calculate calories per ounce: 275 calories/serving ÷ 20 ounces/serving = 13.75 calories/ounce.\n3. Find allowable ounces: 1100 ÷ 13.75 = 80 ounces.\n\nThe answer is 80 ounces."], "expected_answer": "80", "actual_answer": "80"}
{"question": "Ananya and Nadia are sisters from Moscow who love collecting signatures from athletes. During their fall break from school, the sisters spend every afternoon collecting signatures. After 7 weeks, Ananya and Nadia compare their autograph books, counting up the number of signatures each sister has collected. Ananya has 22 signatures in her book, and Nadia has 58. The sisters have 2 more weeks of fall break, and they decide they want to reach 115 signatures between them by the end of the break. How many signatures do the sisters need to collect to reach their goal?", "index": 1674, "lines": ["Round 0:\nThe sisters currently have a total of 22 (Ananya) + 58 (Nadia) = 80 signatures.", "Answer: \nThe next step is to subtract the signatures they currently have from their goal to find how many more they need.\n\nThe answer is 35."], "expected_answer": "35", "actual_answer": "35"}
{"question": "There are currently 12 yellow balls, 19 purple balls, and 18 green balls in the store. Yellow balls cost ₺7, green balls cost ₺7, and purple balls cost ₺6. How much will the store have received after all the balls are sold?", "index": 3773, "lines": ["Called LLM to parse answer, got The answer is 324.", "Answer: \nThe next step is to calculate the total revenue by multiplying the number of balls of each color by their respective prices and then summing these amounts.\n\nStep-by-step explanation:\n1. Calculate revenue from yellow balls: 12 balls * ₺7/ball = ₺84\n2. Calculate revenue from purple balls: 19 balls * ₺6/ball = ₺114\n3. Calculate revenue from green balls: 18 balls * ₺7/ball = ₺126\n4. Sum all revenues: ₺84 + ₺114 + ₺126 = ₺324\n\nThe answer is 324 ₺324."], "expected_answer": "324", "actual_answer": "324"}
{"question": "Winnie has a flower bed that is 203 meters long. Winnie wants to fill her flower bed with plants. Winnie's flowers grow 2 meters wide so she needs to leave 14.5 meters between every plant. Winnie already owns 10 flowers. Each flowering plant costs ₺11 at the store, how much money will Winnie spend at the store to fill up her flower bed?", "index": 2277, "lines": ["Answer: \nWinnie needs to calculate the total number of plants required to fill her 203-meter-long flower bed. Each plant needs 2 meters of space and 14.5 meters between them. \n\n**Step 1:** Calculate the space each plant requires, including the gap.  \nEach plant takes up 2 meters + 14.5 meters = 16.5 meters.  \n\n**Step 2:** Determine how many plants fit into 203 meters.  \nNumber of plants = Total length / Space per plant  \nNumber of plants = 203 / 16.5 ≈ 12.31.  \n\n**Step 3:** Since partial plants aren't possible, round up to 13 plants.  \n\n**Step 4:** Subtract the plants Winnie already has.  \nPlants needed = 13 - 10 = 3 plants.  \n\n**Step 5:** Calculate the cost.  \nCost = 3 plants * ₺11 = ₺33.  \n\nThe answer is 33."], "expected_answer": "44", "actual_answer": "33"}
{"question": "A loaf of sourdough at the cafe costs ₣3. Muffins cost ₣1 each. How much more do 9 loaves of sourdough cost than 6 muffins?", "index": 1949, "lines": ["Answer: \nStep 1: Calculate the total cost for 9 loaves of sourdough.  \nEach loaf costs ₣3, so 9 loaves cost 9 × 3 = ₣27.\n\nStep 2: Calculate the total cost for 6 muffins.  \nEach muffin costs ₣1, so 6 muffins cost 6 × 1 = ₣6.\n\nStep 3: Find the difference between the two totals.  \nSubtract the cost of the muffins from the cost of the sourdough: ₣27 - ₣6 = ₣21.\n\nThe answer is 21."], "expected_answer": "21", "actual_answer": "21"}
{"question": "In a set of artist's cards, there are 25 orange cards, and 84% more red cards. Yellow cards are as many as the sum of orange and red cards. How many cards of all mentioned colors are there?", "index": 3134, "lines": ["Answer: \nThe next step is to calculate the number of red cards by finding 84% more than 25 orange cards:  \nRed cards = 25 + (0.84 × 25) = 25 + 21 = 46.  \n\nThe answer is 142."], "expected_answer": "142", "actual_answer": "142"}
{"question": "A carpenter works for 4 weeks every month and for 4 days every week. If he gets paid ¥185 every day, how much does he earn if he works for a year?", "index": 3528, "lines": ["Round 0:\nLet's calculate his monthly earnings first. He works 4 weeks/month × 4 days/week = 16 days/month.", "Answer: \nNext step: Multiply the monthly earnings by the number of months in a year.  \nHe earns ¥185/day × 16 days/month = ¥2,960/month.  \nFor a year: ¥2,960/month × 12 months/year = ¥35,520.  \nThe answer is ¥35,520."], "expected_answer": "35520", "actual_answer": "35520"}
{"question": "Carlos went to buy some school supplies. He bought 24 crayons which cost ¥6.5 each, 8 notebooks which cost ¥12.75 each, and a rim of bond paper which cost ¥14. How much did Carlos spend on everything?", "index": 935, "lines": ["Answer: \nCarlos will first calculate the total cost for the crayons and notebooks separately by multiplying the quantity by the unit price for each item, then add the cost of the bond paper to these amounts to find the total expenditure.\n\nStep 1: Calculate the cost of crayons: 24 crayons × ¥6.5 per crayon = ?\n\nStep 2: Calculate the cost of notebooks: 8 notebooks × ¥12.75 per notebook = ?\n\nStep 3: Add the costs together and the bond paper: Total = (Step 1) + (Step 2) + ¥14.\n\nThe answer is ¥281.5."], "expected_answer": "272", "actual_answer": "281.5"}
{"question": "840 people apply for a job at Microsoft. Of the people that apply, only 50% receive interviews. Of those who receive interviews, 40% receive a job offer. Of those who receive a job offer, five-sixths of the people accept the position. How many people accept the position?", "index": 4748, "lines": ["Answer: \nStep 1: Calculate the number of people receiving interviews.\n\nThe next logical step is to determine how many applicants receive interviews. Since 50% of the 840 applicants get interviews, we calculate 50% of 840.\n\nStep 2: Calculate the number of people who accept the job offer.\n\nNext, we need to find out how many people actually accept the job offer. Of the 504 people who receive interviews, 40% get a job offer. Then, five-sixths of those who receive offers accept the position.\n\nThe answer is 224."], "expected_answer": "140", "actual_answer": "224"}
{"question": "A cup of juice is 14 ounces of juice. Tariq drinks 5 cups of juice. If juice has 6 calories per ounce how many calories did he consume?", "index": 2812, "lines": ["Answer: \nStep-by-step explanation:\n1. Calculate total ounces of juice Tariq drank: 5 cups × 14 ounces per cup = 70 ounces.  \n2. Multiply total ounces by calories per ounce: 70 ounces × 6 calories per ounce = 420 calories.  \n\nThe answer is 420 calories."], "expected_answer": "420", "actual_answer": "420"}
{"question": "Aisha went to the pier for vacation. Her parents gave her $1200 to buy whatever she wanted. At the beach shop, rock candy was on sale for \"Buy 16 pounds at $23 per pound, get 4 pounds 1/2 off.\" She scooped up 22 pounds. She also bought a mixed bag of sea glass for $11.5 and 11 stickers that were $20.5 each. How much money does Aisha have left?", "index": 2007, "lines": ["Answer: \nThe next step is to calculate the total cost of the rock candy. Aisha bought 22 pounds. The sale is \"Buy 16 pounds at $23 per pound, get 4 pounds 1/2 off.\" She can apply the sale once (16 + 4 = 20 pounds) and buy 2 pounds at full price.  \nCost = (16 * $23) + (4 * $23 * 0.5) + (2 * $23) = $368 + $46 + $46 = $460.  \n\nThe answer is $460."], "expected_answer": "503", "actual_answer": "460"}
{"question": "Theo caught 6 steelheads last Monday, the first steelhead he caught weighs 57 kgs, the second steelhead he caught weighs 47 kgs, and the last steelhead he caught weighs 28 kgs. If a kg of steelhead costs $1.75, how much will he earn after selling all the steelheads to the market?", "index": 3841, "lines": ["Answer: \nThe next step is to calculate the total weight of the steelheads by adding their individual weights: 57 kg + 47 kg + 28 kg = 132 kg.\n\nStep explanation: Sum the weights of the steelheads to determine the total weight available for sale.\n\nThe answer is 132 kg."], "expected_answer": "378", "actual_answer": "132"}
{"question": "Yusuf caught 6 trouts last Wednesday, the first trout he caught weighs 60 kgs, the second trout he caught weighs 39 kgs, and the last trout he caught weighs 38 kgs. If a kg of trout costs €1.0, how much will he earn after selling all the trouts to the market?", "index": 3834, "lines": ["Answer: \nThe next step is to sum the weights of the trouts with known weights: 60 kg + 39 kg + 38 kg = 137 kg. \n\nThe answer is €137."], "expected_answer": "251", "actual_answer": "137"}
{"question": "The Treasure hunt team hid 140 treats. The Lee twins each found 39 treats. All the other treats except 16 were found by their friends. How many treats did the friends find?", "index": 4084, "lines": ["Answer: \nThe Lee twins found a total of 78 treats. Subtracting this from the total treats found (140 - 16 = 124) gives the number of treats found by friends: 124 - 78 = 46.\n\nThe answer is 46."], "expected_answer": "46", "actual_answer": "46"}
{"question": "A farmer is buying feed for his cows. He buys a variety of apples, oats, beets and corns. Since corns are a rare treat, he only buys four 7-kg boxes of them for the whole stable. He only wants enough beets to feed the cows while the vegetables are fresh, so he buys thirteen 6-kg bags. Apples are the main diet of his cows, so he buys thirty five 39-kg packs. Oats are a staple to supplement the apples, so he buys seventeen 17-kg sacks. If his farm truck can carry 160 kgs at a time, how many trips does the farmer need to transport all the feed?", "index": 398, "lines": ["Answer: \nNext, calculate the total weight of each type of feed:  \n- Corn: 4 × 7 kg = 28 kg  \n- Beets: 13 × 6 kg = 78 kg  \n- Apples: 35 × 39 kg = 1365 kg  \n- Oats: 17 × 17 kg = 289 kg  \n\nAdd these totals to find the overall weight: 28 kg + 78 kg + 1365 kg + 289 kg = 1720 kg.  \n\nThe answer is 11 trips (1720 kg ÷ 160 kg/trip ≈ 10.75, rounded up to 11).  \n\nThe answer is 11."], "expected_answer": "11", "actual_answer": "11"}
{"question": "Jamal caught 7 salmons last Friday, the first salmon he caught weighs 42 pounds, the second salmon he caught weighs 52 pounds, and the last salmon he caught weighs 32 pounds. If a pound of salmon costs ¥0.5, how much will he earn after selling all the salmons to the market?", "index": 3821, "lines": ["Called LLM to parse answer, got The answer is 63.", "Answer: \nFirst, add the weights of the three salmons: 42 + 52 + 32 = 126 pounds.\n\nThe answer is ¥63 (126 pounds × ¥0.5 per pound = ¥63)."], "expected_answer": "127", "actual_answer": "63"}
{"question": "Kimia can peel 5 onions a minute and saute 40 onions in 6 minutes. How long will it take her to peel and saute 160 onions?", "index": 2426, "lines": ["Answer: \nTo determine the total time, calculate the time required for each task separately and then sum them. \n\n1. **Peeling Time**:  \n   Kimia peels 5 onions per minute.  \n   Time to peel 160 onions = 160 ÷ 5 = 32 minutes.\n\n2. **Sautéing Time**:  \n   Kimia sautés 40 onions in 6 minutes.  \n   Number of batches = 160 ÷ 40 = 4.  \n   Total sautéing time = 4 × 6 = 24 minutes.\n\n3. **Total Time**:  \n   Total time = Peeling time + Sautéing time = 32 + 24 = 56 minutes.\n\nThe answer is 56 minutes."], "expected_answer": "56", "actual_answer": "56"}
{"question": "The vending machines sell gum for 25 cents and crackers for 50 cents. Kai spent ¥1400 and got 6 bags of gum and had 3% of his money left in change. How many crackers did he buy?", "index": 4022, "lines": ["Answer: \nFirst, calculate the remaining money from the total spent and the 3% change. Since Kai spent 97% of his money, his total amount was approximately ¥1443.30. The change was ¥43.30. The total cost for gum was ¥150, so the remaining ¥1250 was spent on crackers. Dividing by 50 gives 25 crackers.\n\nThe answer is 25 crackers."], "expected_answer": "2713", "actual_answer": "25"}
{"question": "At Mohammed's house, there are five times as many kiwis as bananas. He has a total of 46 bananas in his house. Mohammed bought 62 more bananas at the store and 16 fewer kiwis than the number of bananas. Find the combined total of the number of kiwis and bananas Mohammed has in the house?", "index": 4590, "lines": ["Answer: \nMohammed initially has 46 bananas, so he has 5 × 46 = 230 kiwis. After buying 62 more bananas, he has 46 + 62 = 108 bananas. He then buys 108 − 16 = 92 kiwis. The total number of kiwis is 230 + 92 = 322. The combined total of kiwis and bananas is 322 + 108 = 430.\n\nThe answer is 430."], "expected_answer": "384", "actual_answer": "430"}
{"question": "At Yuki's house, there are nine times as many bananas as persimmons. He has a total of 66 persimmons in his house. Yuki bought 63 more persimmons at the store and 44 fewer bananas than the number of persimmons. Find the combined total of the number of bananas and persimmons Yuki has in the house?", "index": 4559, "lines": ["Answer: \nYuki initially has 66 persimmons and nine times as many bananas, so bananas = 9 * 66 = 594. After buying 63 more persimmons, total persimmons = 66 + 63 = 129. He also bought 44 fewer bananas than the new number of persimmons, so bananas bought = 129 - 44 = 85. Total bananas after purchase = 594 + 85 = 679. Combined total of bananas and persimmons = 679 + 129 = 808.\n\nThe answer is 808."], "expected_answer": "742", "actual_answer": "808"}
{"question": "Oscar has 61 light indigo spools of thread, 83 dark indigo spools of thread, 26 light magenta spools of thread, and 70 dark magenta spools of thread. What percent of the spools are indigo?", "index": 3345, "lines": ["Answer: \nThe next step is to calculate the total number of spools by adding all the given quantities. Adding 61, 83, 26, and 70 gives a total of 240 spools. This total is necessary to determine the percentage of indigo spools.\n\nThe answer is 60%."], "expected_answer": "60", "actual_answer": "60"}
{"question": "Tara has a flower bed that is 196 meters long. Tara wants to fill her flower bed with plants. Tara's flowers grow 7 meters wide so she needs to leave 12.25 meters between every plant. Tara already owns 11 flowers. Each flowering plant costs $7 at the store, how much money will Tara spend at the store to fill up her flower bed?", "index": 2276, "lines": ["Answer: \nTo determine how many plants Tara can fit in her flower bed, calculate the space each plant and its required spacing occupy. Each plant takes 7 meters, and the space after each plant is 12.25 meters, totaling 19.25 meters per plant after the first one. \n\nThe formula for the total length needed is:  \nTotal length = 7 + (n - 1) * 19.25  \n\nSet this equal to the bed's length and solve for n:  \n7 + (n - 1) * 19.25 = 196  \n(n - 1) * 19.25 = 189  \nn - 1 = 9.8235  \nn ≈ 10.8235  \n\nSince Tara can only fit 10 full plants, she will need to buy **10 plants**.  \n\nThe answer is 10 plants, costing 10 * $7 = $70.  \nThe answer is 70."], "expected_answer": "35", "actual_answer": "70"}
{"question": "If Wei and Quinn have 560 yards of fence between them, and they agree to split it with Quinn getting 190 yards more than Wei, how much is left over for Wei?", "index": 4259, "lines": ["Answer: \nLet W be the amount Wei gets. Quinn gets W + 190 yards. Together, their total is W + (W + 190) = 560 yards. Simplifying, 2W + 190 = 560.\n\nThe next step is to solve for W:\n\n2W = 560 - 190  \n2W = 370  \nW = 185\n\nThe answer is 185 yards."], "expected_answer": "185", "actual_answer": "185"}
{"question": "Daphne has a flower bed that is 175 meters long. Daphne wants to fill her flower bed with plants. Daphne's flowers grow 2 meters wide so she needs to leave 12.5 meters between every plant. Daphne already owns 13 flowers. Each flowering plant costs ₺5 at the store, how much money will Daphne spend at the store to fill up her flower bed?", "index": 2269, "lines": ["Answer: \nDaphne needs to calculate the total number of flowers required to fill her 175-meter flower bed, considering each flower is 2 meters wide with 12.5 meters between them. Using the formula for total length: \n\nTotal length = (number of flowers × 2) + ((number of flowers - 1) × 12.5)\n\nSolving for the number of flowers (n):\n\n175 ≥ 2n + 12.5(n - 1)  \n175 ≥ 14.5n - 12.5  \n187.5 ≥ 14.5n  \nn ≤ 12.93\n\nSince Daphne can't have a fraction of a flower, she needs 12 flowers. She already owns 13 flowers, so she doesn't need to buy any more. \n\nThe answer is ₺0."], "expected_answer": "5", "actual_answer": "0"}
{"question": "Xena has a flower bed that is 159 meters long. Xena wants to fill her flower bed with plants. Xena's flowers grow 2 meters wide so she needs to leave 13.25 meters between every plant. Xena already owns 10 flowers. Each flowering plant costs €14 at the store, how much money will Xena spend at the store to fill up her flower bed?", "index": 2266, "lines": ["Answer: \nTo determine how many additional plants Xena needs to buy, calculate the number of plants that fit in the bed. Each plant, including spacing, requires 15.25 meters. Dividing the bed length by this gives approximately 10.44, so 10 plants fit. Subtracting the 10 she already has, Xena needs to buy 0 more plants.\n\nThe answer is €0."], "expected_answer": "28", "actual_answer": "0"}
{"question": "Aisha has a flower bed that is 182 meters long. Aisha wants to fill her flower bed with plants. Aisha's flowers grow 3 meters wide so she needs to leave 13.0 meters between every plant. Aisha already owns 12 flowers. Each flowering plant costs $4 at the store, how much money will Aisha spend at the store to fill up her flower bed?", "index": 2264, "lines": ["Answer: \nThe next step is to calculate the number of plants Aisha can fit in her flower bed:\n\nThe total length required for `x` plants is given by the formula:\n\\[ 3x + 13(x - 1) \\leq 182 \\]\n\nThe answer is \\$0."], "expected_answer": "8", "actual_answer": "0"}
